import { AppsScriptData } from "../types";

export const INITIAL_APP_DATA: AppsScriptData = {
  "settings": {
    "rowNum": 2,
    "SiteName": "กองทรัพยากรมนุษย์",
    "SubSiteName": "สำนักงานอธิการบดี มหาวิทยาลัยศิลปากร",
    "LogoURL": "https://upload.wikimedia.org/wikipedia/commons/5/54/Logo_of_Silpakorn_University.svg",
    "AdminPass": 1234,
    "HeroTitle": "Guideline ตำแหน่งทางวิชาการ",
    "HeroSubTitle": "รวมหลักเกณฑ์ ข้อคำถาม และหนังสือเวียนคณะ/หนังสือตอบข้อหารือ",
    "SlideInterval": 2500,
    "FieldsDescription": ""
  },
  "slider": [
    {
      "rowNum": 2,
      "ImageURL": "https://drive.google.com/file/d/1Ps4iWsZxcXSskEUR2BrwyrQl_ZpmoCET/view?usp=sharing"
    },
    {
      "rowNum": 3,
      "ImageURL": "https://drive.google.com/file/d/1oCzFZkC1QKSmGAZpFsVSSmBtAjVk4NuZ/view?usp=sharing"
    },
    {
      "rowNum": 4,
      "ImageURL": "https://drive.google.com/file/d/1oV8RzW7z0MC4QCJ_gzWIi9B7Q5fOIReV/view?usp=sharing"
    },
    {
      "rowNum": 5,
      "ImageURL": "https://drive.google.com/file/d/12hCAANfQwjDAQJnCVkLAiER-PE78ObHh/view?usp=sharing"
    },
    {
      "rowNum": 6,
      "ImageURL": "https://drive.google.com/file/d/1D0wkDZ1Hy9wVLx0eOfl3D2PmW2boo7q4/view?usp=sharing"
    }
  ],
  "contact": {
    "rowNum": 2,
    "Address": "งานพัฒนาทรัพยากรมนุษย์ กองทรัพยากรมนุษย์ สำนักงานอธิการบดี (ตลิ่งชัน) มหาวิทยาลัยศิลปากร\n215 ถนนบรมราชชนนี แขวง/เขตตลิ่งชัน กรุงเทพมหานคร 10700",
    "AddressLink": "https://maps.app.goo.gl/dyKHQSPeZ6j6TNFo7",
    "Phone": "0 2849 7567",
    "InternalPhone": "100051 - 100076",
    "Email": "personpd@su.ac.th",
    "LineURL": "https://lin.ee/qe5XCwv",
    "Copyright": "© 2026 Human Resources Division, Silpakorn University",
    "FacebookURL": "https://www.facebook.com/profile.php?id=100064456761359&mibextid=LQQJ4d",
    "FacebookText": "",
    "LineText": ""
  },
  "links": [
    {
      "rowNum": 2,
      "Name": "มหาวิทยาลัยศิลปากร",
      "URL": "https://www.su.ac.th/"
    },
    {
      "rowNum": 3,
      "Name": "กองทรัพยากรมนุษย์ สำนักงานอธิการบดี มศก.",
      "URL": "https://president.su.ac.th/personnel/"
    },
    {
      "rowNum": 4,
      "Name": "ฐานข้อมูลบัญชีรายชื่อผู้ทรงคุณวุฒิ (ก.พ.อ.)",
      "URL": "https://lookerstudio.google.com/reporting/51b1a8e9-2408-45c0-a9f9-6dcb654436d1/page/DbXsF"
    }
  ],
  "categories": [
    "Q&A",
    "หนังสือเวียนคณะ/ตอบข้อหารือ"
  ],
  "mainMenus": [
    {
      "rowNum": 2,
      "Name": "หลักเกณฑ์และแบบฟอร์ม",
      "Icon": "",
      "TargetPage": "forms"
    },
    {
      "rowNum": 3,
      "Name": "Q&A และหนังสือเวียนคณะ/ตอบข้อหารือ",
      "Icon": "",
      "TargetPage": "search"
    },
    {
      "rowNum": 4,
      "Name": "ค้นหาสาขาวิชา",
      "Icon": "",
      "TargetPage": "branchSearch"
    }
  ],
  "items": [
    {
      "rowNum": 3,
      "Category": "Q&A",
      "Title": "กรณีได้รับการกำหนดตำแหน่งผู้ช่วยศาสตราจารย์\nในสาขาวิชา A หากจะขอกำหนดตำแหน่งรองศาสตราจารย์ ในสาขาวิชา B สามารถทำได้หรือไม่",
      "Details": "สามารถดำเนินการได้ โดยจะต้องเสนอขอกำหนดตำแหน่งทางวิชาการ โดยวิธีพิเศษ มีหลักเกณฑ์ ดังนี้\n- เสนอด้วยวิธีที่ 1 ของวิธีการปกติเท่านั้น โดยแต่งตั้งคณะอนุกรรมการประเมินผลงานทางวิชาการ จำนวน 5 ท่าน \n- ตำแหน่งผู้ช่วยศาสตราจารย์และรองศาสตราจารย์ ผลงานต้องมีคุณภาพในระดับดีมาก 3 ใน 5\n- ตำแหน่งศาสตราจารย์ ผลงานต้องมีคุณภาพในระดับดีเด่น 4 ใน 5)\n\nทั้งนี้ ผลงานทางวิชาการที่เสนอขอจะต้องสอดคล้องหรือเกี่ยวข้องกับสาขาวิชาที่เสนอขอ",
      "Date": "2026-03-22",
      "Link": "",
      "ImageURL": ""
    },
    {
      "rowNum": 4,
      "Category": "Q&A",
      "Title": "กระบวนการเสนอขอกำหนดตำแหน่งทางวิชาการ ปัจจุบันมีระยะเวลาการดำเนินการเท่าใด",
      "Details": "ปัจจุบันมีระยะเวลาการดำเนินการ ประมาณ 6 - 7 เดือน (นับจากวันที่กองทรัพยากรมนุษย์รับเรื่อง)\n(กรณีที่ไม่ได้ส่งกลับคณะเพื่อแก้ไขเอกสาร ไม่ได้จัดให้มีการประชุมคณะอนุกรรมการประเมินผลงานทางวิชาการ หรือประเด็นอื่น ๆ ที่ต้องชี้แจงหรือดำเนินการเพิ่มเติม)\n\nทั้งนี้ ขึ้นอยู่กับระดับตำแหน่งทางวิชาการและจำนวนผลงานทางวิชาการที่เสนอขอด้วย หากเสนอตำรา หนังสือ หรือผลงานหลายเรื่อง ผู้ทรงคุณวุฒิจะใช้เวลาในการพิจารณามากขึ้น",
      "Date": "2026-03-22",
      "Link": "",
      "ImageURL": ""
    },
    {
      "rowNum": 5,
      "Category": "Q&A",
      "Title": "การใช้ AI ในการทำงานวิจัย มีข้อกำหนดหรือขอบเขตความเหมาะสมอย่างไร",
      "Details": "ขอให้พิจารณาดำเนินการตามประกาศมหาวิทยาลัยศิลปากร เรื่อง แนวปฏิบัติการใช้ปัญญาประดิษฐ์แบบเจเนอเรทิฟ (Generative Artificial Intelligence) หรือ Gen AI พ.ศ. 2568 ประกาศ ณ วันที่ 24 กุมภาพันธ์ 2568 ซึ่งได้กำหนดแนวปฏิบัติ ข้อห้าม และบทลงโทษกรณีดำเนินการผิดตามที่ประกาศกำหนดไว้แล้ว",
      "Date": "2026-03-22",
      "Link": "https://lawapp.su.ac.th/uploads/3-OT68-02-24_2502240934.pdf",
      "ImageURL": ""
    },
    {
      "rowNum": 6,
      "Category": "Q&A",
      "Title": "การประเมินการสอน หมายถึงอะไร ต้องทำอะไรบ้าง ต้องทำทุกหัวข้อหรือไม่ หรือทำเฉพาะหัวข้อที่มีการสอบสอน",
      "Details": "1. การประเมินคุณภาพการสอนของผู้ขอระดับตำแหน่งผู้ช่วยศาสตราจารย์และรองศาสตราจารย์ ที่ครอบคลุมข้อมูลที่จำเป็นทุก ๆ ด้าน โดยเฉพาะความสามารถในการถ่ายทอดความรู้ เพื่อช่วยให้ผู้เรียนได้เกิดการเรียนรู้ สามารถประเมินการเรียนรู้ได้ผลถูกต้องที่สุด และสอดคล้องกับผลลัพธ์การเรียนรู้ที่คาดหวัง \n2. พนักงานมหาวิทยาลัย ประเมินการสอนก่อนยื่นเสนอขอกำหนดตำแหน่งทางวิชาการ\n3. ข้าราชการฯ ประเมินการสอนพร้อมยื่นเสนอขอกำหนดตำแหน่งทางวิชาการ\n\nสิ่งที่ต้องยื่นประเมินการสอน\n1. รายวิชาของผู้ขอซึ่งเทียบค่าได้ไม่น้อยกว่า 3 หน่วยกิตระบบทวิภาคหรือ 45 ชั่วโมงบรรยาย\n2. ประเมินการสอนรายวิชาที่ผู้ขอยื่น ตามองค์ประกอบการประเมินผลการสอน 9 ข้อ รวม 100 คะแนน\n   - ผู้ช่วยศาสตราจารย์ 60 คะแนนขึ้นไป (ระดับชำนาญ)\n   - รองศาสตราจารย์ 80 คะแนนขึ้นไป (ระดับชำนาญพิเศษ)\n3. เสนอเอกสารหลักฐานทุกหัวข้อที่ทำการสอนในรายวิชาที่เสนอประเมินการสอน โดย\n   - แบบที่ 1 เอกสารประกอบการสอน หรือ\n   - แบบที่ 2 เอกสารคําสอน\nคุณภาพเป็นไปตามเกณฑ์ 4 ข้อแรก (ไม่ต่ำกว่าระดับดี)",
      "Date": "2026-03-22",
      "Link": "http://bit.ly/4pANqY6",
      "ImageURL": ""
    },
    {
      "rowNum": 7,
      "Category": "Q&A",
      "Title": "การเตรียมตัวเสนอขอกำหนดตำแหน่งทางวิชาการ",
      "Details": "1. พนักงานมหาวิทยาลัยต้องมีผลการประเมินการสอนก่อนเสนอขอกำหนดตำแหน่งทางวิชาการ (ผลการประเมินมีอายุ 2 ปีนับจากวันที่ ก.พ.ว. เห็นชอบผลการประเมิน) / ข้าราชการฯ ประเมินการสอนพร้อมเสนอขอกำหนดตำแหน่งทางวิชาการ\n2. ต้องมีคุณสมบัติครบถ้วนตามตำแหน่งที่จะเสนอขอ\n3. มีจำนวนผลงานทางวิชาการตามระดับตำแหน่งที่เสนอขอ โดยผลงานทางวิชาการต้องเป็นไปตามคำนิยามและได้รับการเผยแพร่ตามหลักเกณฑ์ที่กำหนด \n   - พนักงานมหาวิทยาลัยบังคับใช้ตามข้อบังคับ มศก. พ.ศ. 2561 และฉบับที่แก้ไขเพิ่มเติม\n   - ข้าราชการฯ บังคับใช้ตามประกาศ ก.พ.อ.ฯ พ.ศ. 2564 และฉบับที่แก้ไขเพิ่มเติม",
      "Date": "2026-03-22",
      "Link": "",
      "ImageURL": ""
    },
    {
      "rowNum": 8,
      "Category": "Q&A",
      "Title": "ถ้าได้ตำแหน่งรองศาสตราจารย์ตอนอายุงานเหลือน้อยกว่า 1 ปี ก่อนเกษียณอายุ จะสามารถต่ออายุราชการได้หรือไม่",
      "Details": "ตามหลักเกณฑ์การต่อเวลาราชการหรือต่อการจ้าง ผู้เสนอขอต่อเวลาราชการหรือต่อการจ้าง ต้องดำรงตำแหน่งรองศาสตราจารย์ ดร. หรือศาสตราจารย์ ก่อนสิ้นปีงบประมาณที่จะเกษียณอายุ\n\nทั้งนี้ เพื่อให้การพิจารณาต่อเวลาราชการหรือต่อการจ้างเป็นไปด้วยความเรียบร้อย จึงแนะนำให้ผู้ที่ยังมีคุณสมบัติยังไม่เป็นไปตามเกณฑ์ที่กำหนดเสนอขอกำหนดตำแหน่งรองศาสตราจารย์ ล่วงหน้า 1-2 ปี ก่อนเกษียณอายุ\n\nสำหรับผู้ที่จะเสนอขอกำหนดตำแหน่งศาสตราจารย์ ควรพิจารณาระยะเวลาในการเสนอขอกำหนดตำแหน่ง เนื่องจากตำแหน่งศาสตราจารย์ต้องเสนอ สป.อว. เพื่อนำความกราบบังคมทูลเสนอโปรดเกล้าโปรดกระหม่อมแต่งตั้งให้ดำรงตำแหน่งศาสตราจารย์",
      "Date": "2026-03-22",
      "Link": "",
      "ImageURL": ""
    },
    {
      "rowNum": 10,
      "Category": "Q&A",
      "Title": "ข้อแนะนำในการกำหนดสาขาวิชาในการขอตำแหน่งทางวิชาการ",
      "Details": "อาจารย์สามารถกำหนดสาขาวิชาในการเสนอขอกำหนดตำแหน่งทางวิชาการ โดยพิจารณาจาก\n1. ความเชี่ยวชาญของอาจารย์ (อาจพิจารณาจากประสบการณ์หรือการศึกษาที่ผ่านมา)\n2. อาจพิจารณาจาก เนื้อหา ทฤษฎีที่เกี่ยวข้อง กระบวนการวิจัย หรือผลลัพท์ที่เกิดจากผลงานทางวิชาการ\n3. การกำหนดสาขาวิชา ควรพิจารณาให้ถี่ถ้วนตั้งแต่การขอกำหนดตำแหน่งผู้ช่วยศาสตราจารย์ เนื่องจากเมื่อเสนอขอกำหนดตำแหน่งที่สูงขึ้น อาจารย์จะต้องได้รับการกำหนดตำแหน่งทางวิชาการในสาขาวิชาเดิม (เว้นแต่ขอเปลี่ยนสาขาจะต้องเสนอขอโดยวิธีพิเศษ)\n4. ผู้ขอต้องระบุสาขาวิชา (เลขรหัส 4 ตัว) ทุกครั้ง (ไม่บังคับให้ระบุอนุสาขาวิชา (เลขรหัส 6 ตัว)) ทั้งนี้ วุฒิการศึกษากับสังกัดของผู้ขอ ไม่เกี่ยวข้องกับการเลือกสาขาวิชาในการเสนอขอกำหนดตำแหน่งทางวิชาการ ขอให้พิจารณาจากความเชี่ยวชาญจากผลงานทางวิชาการและรายวิชาที่สอน",
      "Date": "2026-03-22",
      "Link": "",
      "ImageURL": ""
    },
    {
      "rowNum": 11,
      "Category": "Q&A",
      "Title": "สามารถใช้ผลงานวิจัยหรือเอกสารประกอบการสอนจากต้นสังกัดเดิมได้หรือไม่",
      "Details": "1. ผลงานวิจัย สามารถนำมาใช้เสนอขอกำหนดตำแหน่งทางวิชาการได้ ทั้งนี้ ต้องทำในฐานะอาจารย์ประจำ และต้องแนบหนังสือรับรองการทำงานจากต้นสังกัดเดิมด้วย\n\n2. รายวิชาที่จะประเมินการสอนและเอกสารหลักฐานที่ใช้ในการประเมินผลการสอน ต้องเป็นวิชาใดวิชาหนึ่งตามหลักสูตรของมหาวิทยาลัยศิลปากรที่สภามหาวิทยาลัยศิลปากรกำหนด และใช้สอนมาแล้วไม่เกิน 3 ปีการศึกษา",
      "Date": "2026-03-22",
      "Link": "",
      "ImageURL": ""
    },
    {
      "rowNum": 9,
      "Category": "Q&A",
      "Title": "การขอตำแหน่งทางวิชาการทั่วไปหรือเฉพาะด้าน และการระบุสาขาวิชาในการเสนอขอกำหนดตำแหน่งทางวิชาการ มีผลต่อสาขาวิชาที่สอนภายหลังหรือไม่อย่างไร",
      "Details": "การขอกำหนดตำแหน่งทางวิชาการให้สูงขึ้น และการระบุสาขาวิชาในการเสนอขอกำหนดตำแหน่งทางวิชาการ จะแสดงให้เห็นถึงความเชี่ยวชาญของอาจารย์ในสาขาวิชาที่สอน",
      "Date": "2026-03-21",
      "Link": "",
      "ImageURL": ""
    },
    {
      "rowNum": 2,
      "Category": "Q&A",
      "Title": "ผู้ทรงคุณวุฒิประเมินผลงานทางวิชาการ (Reader) มีความเห็นอย่างไรเกี่ยวกับการตีพิมพ์ผลงานกับสำนักพิมพ์ MDPI",
      "Details": "ขึ้นอยู่กับประเด็นต่าง ๆ ดังนี้\n1. ความเห็นของผู้ทรงคุณวุฒิแต่ละท่าน\n2. ทิศทาง/ความนิยมในแต่ละสาขาวิชา\n3. คุณภาพของผลงานเรื่องนั้น ๆ",
      "Date": "2026-03-20",
      "Link": "",
      "ImageURL": ""
    },
    {
      "rowNum": 15,
      "Category": "หนังสือเวียนคณะ/ตอบข้อหารือ",
      "Title": "อว 8603.7/1495\nหนังสือเวียนที่เกี่ยวข้องในการเสนอขอกำหนดตำแหน่งทางวิชาการ\n(การขอหารือเกี่ยวกับหลักเกณฑ์และวิธีการแต่งตั้งบุคคลให้ดำรงตำแหน่งทางวิชาการ, การดำเนินการตามมาตรการบังคับใช้กฎหมาย ตามมาตรา 70 แห่งพระราชบัญญัติการอุดมศึกษา พ.ศ. 2562, คู่มือการขอกำหนดตำแหน่งทางวิชาการเฉพาะด้าน และบัญชีผู้ทรงคุณวุฒิเฉพาะด้าน (เพิ่มเติม))",
      "Details": "หนังสือเวียน สป.อว. ทั้ง 3 ฉบับ ดังนี้\n1. แนวปฏิบัติการหารือตำแหน่งทางวิชาการ (ว 10589): เพื่อความรวดเร็วและลดขั้นตอน ให้สถาบันอุดมศึกษาหารือประเด็นหลักเกณฑ์การแต่งตั้งตำแหน่งทางวิชาการกับคณะกรรมการพิจารณาตำแหน่งทางวิชาการ (ก.พ.ว.) ภายในสถาบันก่อน หากหาข้อสรุปไม่ได้จึงค่อยหารือมายัง สป.อว.\n\n2. มาตรการการรับจ้างทำผลงานวิชาการ (ว 11622): กำชับให้ปฏิบัติตาม พ.ร.บ.การอุดมศึกษาฯ มาตรา 70 อย่างเคร่งครัด ห้ามจ้าง วาน หรือรับจ้างทำวิทยานิพนธ์และผลงานวิชาการ หากฝ่าฝืนมีโทษจำคุกไม่เกิน 3 ปี หรือปรับไม่เกิน 6 หมื่นบาท หรือทั้งจำทั้งปรับ และให้สถาบันลงโทษทางวินัย/กฎหมายขั้นเด็ดขาด\n\n3. เอกสารประกอบการขอตำแหน่งทางวิชาการเฉพาะด้าน (ว 10583 และ ว 10585):\n    3.1 คู่มือเพิ่มเติม: จัดทำคู่มือสำหรับผู้ขอและผู้ประเมินใน 3 ด้าน คือ ด้านรับใช้ท้องถิ่นและสังคม, ด้านนวัตกรรม และด้านศาสนา (https://shorturl.asia/9pBAn)\n    3.2 บัญชีรายชื่อผู้ทรงคุณวุฒิ: เพิ่มเติมรายชื่อกรรมการประเมินผลงานและจริยธรรมใน 3 ด้านดังกล่าว (https://shorturl.asia/6QkKy)",
      "Date": "2023-07-19",
      "Link": "https://drive.google.com/file/d/1hkHW2GQoIhPuzvw8TX6NipSCTAtBS_fX/view?usp=drive_link",
      "ImageURL": ""
    },
    {
      "rowNum": 14,
      "Category": "หนังสือเวียนคณะ/ตอบข้อหารือ",
      "Title": "อว 8603.7/1642\nแนวทางปฏิบัติในการดำเนินการวิจัยในมนุษย์ ด้านพฤติกรรมศาสตร์ สังคมศาสตร์และมนุษยศาสตร์",
      "Details": "คณะอนุกรรมการเกี่ยวกับตำแหน่งทางวิชาการของข้าราชการพลเรือนในสถาบันอุดมศึกษา \nในการประชุมครั้งที่ 2/2566 เมื่อวันที่ 9 กุมภาพันธ์ 2566 ซึ่งทำหน้าที่แทน ก.พ.อ. ได้พิจารณาข้อเสนอแนวทางปฏิบัติของสำนักงานการวิจัยแห่งชาติประกอบกับเอกสารหลักฐานที่เกี่ยวข้องแล้วเห็นว่า ตามความในข้อ 5.1.5 (6) ของประกาศ ก.พ.อ.ฯ พ.ศ. 2564 กำหนดไว้ว่า “หากผลงานทางวิชาการมีการใช้ข้อมูลจากการทำการวิจัยในคนหรือสัตว์ ผู้ขอจะต้องยื่นหลักฐานแสดงการอนุญาตจากคณะกรรมการจริยธรรมการวิจัยของสถาบันที่มีการดำเนินการ” ประกอบกับมติที่ประชุมครั้งที่ 10/2561 เมื่อวันที่ 4 ตุลาคม 2561 ซึ่งได้เคยพิจารณาประเด็นเกี่ยวกับผลงานทางวิชาการที่มีการใช้ข้อมูลจากการทำวิจัยในคนหรือสัตว์แล้ว เห็นควรให้สภาสถาบันอุดมศึกษาอาจอ้างอิงจากคำจำกัดความของการวิจัยในคนและสัตว์ และแนวทางปฏิบัติของสำนักงานคณะกรรมการวิจัยแห่งชาติได้ ตามหนังสือสำนักงานคณะกรรมการการอุดมศึกษา ที่ ศธ 0509(2)/ว1678 ลงวันที่ 16 ตุลาคม 2561 ดังนั้น จึงมีมติเห็นชอบแนวทางปฏิบัติดังกล่าวตามสิ่งที่ส่งมาด้วย เพื่อให้สภาสถาบันอุดมศึกษาต่าง ๆ อาจนำไปใช้อ้างอิงได้",
      "Date": "2023-05-23",
      "Link": "https://drive.google.com/file/d/1bUGWc8ZQlZwycLdnrl_sSJNsixHG0_Hn/view?usp=drive_link",
      "ImageURL": ""
    },
    {
      "rowNum": 13,
      "Category": "หนังสือเวียนคณะ/ตอบข้อหารือ",
      "Title": "อว 8603.7/1495\nข้อหารือเกี่ยวกับประเด็นปัญหาและข้อเสนอแนะทีได้จากการระดมความคิดเห็น (peer review ผลงานสร้างสรรค์ด้านสุนทรียะ ศิลปะ)",
      "Details": "การเผยแพร่ผลงานด้านสร้างสรรค์สุนทรียะ ศิลปะ เห็นว่า การกำหนดจำนวนและคะแนนเสียงของผู้ทรงคุณวุฒิ (peer reviewer) ในการประชุม มีความซ้ำซ้อนกับผู้ทรงคุณวุฒิเพื่อทำหน้าที่ประเมินผลงานทางวิชาการและจริยธรรมและจรรยาบรรณทางวิชาการ จึงเห็นควรปรับการเผยแพร่ผลงานสร้างสรรค์ด้านสุนทรียะ ศิลปะ เพื่อให้สอดคล้องกับการเผยแพร่ผลงานด้านอื่น ๆ โดย ก.พ.อ. ในการประชุมครั้งที่ 6/2565 เมื่อวันที่ 7 ธันวาคม 2565 ได้มีมติให้ปรับการเผยแพร่ผลงานสร้างสรรค์ด้านสุนทรียะ ศิลปะ เป็น “เผยแพร่ในลักษณะใดลักษณะหนึ่ง ไม่น้อยกว่าสี่เดือน โดยต้องแสดงหลักฐานว่าได้ผ่านการประเมินโดยคณะผู้ทรงคุณวุฒิในสาขาวิชานั้น ๆ หรือสาขาวิชาที่เกี่ยวข้อง (peer reviewer) ที่มาจากหลากหลายสถาบัน”",
      "Date": "2023-05-03",
      "Link": "https://drive.google.com/file/d/1X7RZ3nWwSV2vwMYcK1tYM6PQZfk5Gg0X/view?usp=drive_link",
      "ImageURL": ""
    },
    {
      "rowNum": 12,
      "Category": "หนังสือเวียนคณะ/ตอบข้อหารือ",
      "Title": "อว 8603.7/ว0466\nหนังสือเวียนที่เกี่ยวข้องในการเสนอขอกำหนดตำแหน่งทางวิชาการ (การเผยแพร่ผลงานด้านสร้างสรรค์สุนทรียะ ศิลปะ และคู่มือและบัญชีผู้ทรงคุณวุฒิในการขอกำหนดตำแหน่งทางวิชาการเฉพาะด้าน)",
      "Details": "1. หนังสือสำนักงานปลัดกระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม ที่ อว 0209.5/ว 1137 ลงวันที่ 18 มกราคม 2566 เรื่อง การเผยแพร่ผลงานด้านสร้างสรรค์สุนทรียะ ศิลปะ ได้ปรับการเผยแพร่ผลงานสร้างสรรค์ด้านสุนทรียะ ศิลปะ ซึ่งระบุในเอกสารแนบท้ายประกาศ ก.พ.อ.ฯ พ.ศ. 2564 ข้อ 7 คำจำกัดความ รูปแบบ การเผยแพร่ และลักษณะคุณภาพของผลงานทางวิชาการ หัวข้อย่อย 7.4.2 ผลงานสร้างสรรค์ด้านสุนทรียะ ศิลปะ เพื่อให้สอดคล้องกับการเผยแพร่ผลงานด้านอื่น ๆ จากเดิม เป็น “เผยแพร่ในลักษณะใดลักษณะหนึ่ง ไม่น้อยกว่าสี่เดือน โดยต้องแสดงหลักฐานว่าได้ผ่านการประเมินโดยคณะผู้ทรงคุณวุฒิในสาขาวิชานั้นๆ หรือสาขาวิชาที่เกี่ยวข้อง (peer reviewer) ที่มาจากหลากหลายสถาบัน” สำหรับวิธีการเผยแพร่และคุณสมบัติของผู้ที่ทำหน้าที่เป็น peer reviewer ให้คงไว้ตามเดิม\n\n\n2. หนังสือที่เกี่ยวข้องในการเสนอขอกำหนดตำแหน่งทางวิชาการเฉพาะด้าน 5 ด้าน ได้แก่ 1) ด้านรับใช้ท้องถิ่นและสังคม 2) ด้านสร้างสรรค์สุนทรียะ ศิลปะ 3) ด้านการสอน 4) ด้านนวัตกรรม และ 5) ด้านศาสนา จำนวน 2 ฉบับ ดังนี้\n   2.1 หนังสือสำนักงานปลัดกระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม ที่ อว 0209.5/ว 956 ลงวันที่ 16 มกราคม 2566 เรื่อง คู่มือการขอกำหนดตำแหน่งทางวิชาการเฉพาะด้าน สำหรับผู้ขอและผู้ประเมิน\n   2.2 หนังสือสำนักงานปลัดกระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม ที่ อว 0209.5/ว 1518 ลงวันที่ 25 มกราคม 2566 เรื่อง บัญชีรายชื่อผู้ทรงคุณวุฒิเพื่อแต่งตั้งเป็นคณะกรรมการพิจารณาตำแหน่งทางวิชาการ และกรรมการผู้ทรงคุณวุฒิเพื่อทำหน้าที่ประเมินผลงานทางวิชาการและจริยธรรมและจรรยาบรรณทางวิชาการ (เฉพาะด้าน)",
      "Date": "2023-02-12",
      "Link": "https://drive.google.com/file/d/1lSgruxDbjg9WIBVBOUBsnY8j96OaRM0V/view?usp=drive_link",
      "ImageURL": ""
    }
  ],
  "formsData": [
    {
      "rowNum": 2,
      "Level1": "การประเมินการสอน",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "สรุปหลักเกณฑ์การประเมินการสอน",
      "LinkURL": "https://drive.google.com/file/d/1jAwbJujgeg6rJfkKuGEABW_31MlCO-QC/view?usp=drive_link"
    },
    {
      "rowNum": 3,
      "Level1": "การประเมินการสอน",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "หนังสือตอบข้อหารือ : ต้องมีคุณสมบัติครบตามหลักเกณฑ์เพื่อขอประเมินการสอน",
      "LinkURL": "https://drive.google.com/file/d/12pLb1FkQszLd49h-xC-4sLZFKNQXnBbN/view?usp=drive_link"
    },
    {
      "rowNum": 4,
      "Level1": "การประเมินการสอน",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "ประกาศ ก.พ.ว. เรื่อง แนวทางการประเมินผลการสอน (ฉบับลงวันที่ 31 ตุลาคม 2561)",
      "LinkURL": "https://drive.google.com/file/d/1cmaWaG9hle7NL7UMlmCIeclt_6jm30SK/view?usp=drive_link"
    },
    {
      "rowNum": 5,
      "Level1": "การประเมินการสอน",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "หนังสือเวียน : การเสนอรายชื่อคณะทำงานเพื่อทำหน้าที่เป็นคณะอนุกรรมการประเมินผลการสอนฯ",
      "LinkURL": "https://drive.google.com/file/d/11HQ3fwmUQrDonZzPAaJMznb-EE6YrEwK/view?usp=drive_link"
    },
    {
      "rowNum": 6,
      "Level1": "การประเมินการสอน",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "ประกาศคณะกรรมการมาตรฐานการอุดมศึกษา เรื่อง เกณฑ์มาตรฐานหลักสูตรระดับปริญญาตรี พ.ศ. 2565",
      "LinkURL": "https://drive.google.com/file/d/1gTAOyMgxQx3KoXuP1wNDKLctmqi-mkyu/view?usp=drive_link"
    },
    {
      "rowNum": 7,
      "Level1": "การประเมินการสอน",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "ตารางคำนวณการเทียบเคียงจำนวนหน่วยกิตหลายรายวิชา",
      "LinkURL": "https://docs.google.com/spreadsheets/d/1y5mYwQ1JOLbHsVbPaWJq1dtD-Kw2F4w5/edit?usp=drive_link&ouid=113550924798974145758&rtpof=true&sd=true"
    },
    {
      "rowNum": 8,
      "Level1": "การประเมินการสอน",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรับรองเอกสารประกอบการสอน/เอกสารคำสอน",
      "LinkURL": "https://docs.google.com/document/d/1kxo14hNKjvX4fO7nA6iCS3w3BZyKqmuJ/edit?usp=drive_link&ouid=113550924798974145758&rtpof=true&sd=true"
    },
    {
      "rowNum": 9,
      "Level1": "การประเมินการสอน",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบประเมินผลการสอน",
      "LinkURL": "https://docs.google.com/document/d/1f7-5gSaazqzpFsO8QE-BBNozpA1EG4sL/edit?usp=drive_link&ouid=113550924798974145758&rtpof=true&sd=true"
    },
    {
      "rowNum": 10,
      "Level1": "การประเมินการสอน",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบประเมินเอกสารหลักฐานที่ใช้ในการประเมินผลการสอน",
      "LinkURL": "https://docs.google.com/document/d/1l4IxfSdaE1Exf3UIxu5uF4_8v4kYeCP1/edit?usp=drive_link&ouid=113550924798974145758&rtpof=true&sd=true"
    },
    {
      "rowNum": 11,
      "Level1": "การประเมินการสอน",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "(สำหรับคณะ) เอกสารแนบเพิ่มเติม - ประเมินผลการสอน",
      "LinkURL": "https://docs.google.com/document/d/1ez9909P5P4oqs8NFOFX_pk07hqDVKq61/edit?usp=drive_link&ouid=113550924798974145758&rtpof=true&sd=true"
    },
    {
      "rowNum": 12,
      "Level1": "การประเมินการสอน",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "(สำหรับคณะ) ส่วนที่ 3 แบบประเมินผลการสอน",
      "LinkURL": "https://docs.google.com/document/d/1llC2hy3Xd6gxSm79Od58tbiFDpSyuFH3/edit?usp=drive_link&ouid=113550924798974145758&rtpof=true&sd=true"
    },
    {
      "rowNum": 13,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ประกาศ ก.พ.อ.​ เรื่อง หลักเกณฑ์และวิธีการพิจารณาแต่งตั้งบุคคลให้ดำรงตำแหน่งผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์",
      "Title": "ฉบับ พ.ศ. 2564",
      "LinkURL": "https://drive.google.com/file/d/1eruGYTFsBkDzq5qcQ1vBRswJoLTVyDlQ/view?usp=drive_link"
    },
    {
      "rowNum": 14,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ประกาศ ก.พ.อ.​ เรื่อง หลักเกณฑ์และวิธีการพิจารณาแต่งตั้งบุคคลให้ดำรงตำแหน่งผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์",
      "Title": "ฉบับที่ 2 พ.ศ. 2568",
      "LinkURL": "https://drive.google.com/file/d/1hFNf7-ib5Y6xclFjF_NzQKrDbEjFrYbf/view?usp=drive_link"
    },
    {
      "rowNum": 15,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ประกาศ ก.พ.อ.​ เรื่อง หลักเกณฑ์และวิธีการพิจารณาแต่งตั้งบุคคลให้ดำรงตำแหน่งผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์",
      "Title": "ฉบับที่ 3 พ.ศ. 2568",
      "LinkURL": "https://drive.google.com/file/d/1e4Eiud5tMwziPr7CXrpQqjuuTzpjCh5O/view?usp=drive_link"
    },
    {
      "rowNum": 16,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "01 แบบ ก.พ.อ. 03 (ฉบับที่ 3) พ.ศ. 2568",
      "LinkURL": "https://docs.google.com/document/d/1FAnGTIXbgfu8Aa2R9nshPEMiFcaIXCKh/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 17,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "02 แบบ Check List",
      "LinkURL": "https://docs.google.com/document/d/1Qt02mtUXXGZfKJhE8ga5vAS6aSGzKaZS/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 18,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "03 แบบรับรองจริยธรรมและจรรยาบรรณทางวิชาการ 2568 (เพิ่มข้อ 7)",
      "LinkURL": "https://docs.google.com/document/d/1mESyDWlbJRMKu8mgXURQiHWVnop066fd/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 19,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "04 แบบรับรองผลงานวิจัยและผลงานทางวิชาการ",
      "LinkURL": "https://docs.google.com/document/d/16XmzJ1hgrm2chaXMh5uZVgp9j8mvXV1r/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 20,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "05 แบบรับรองผลงานวิจัยไม่ใช้ข้อมูลจากการวิจัยในคนหรือสัตว์",
      "LinkURL": "https://docs.google.com/document/d/1YAylBXNQH5dnVYl_zWhtYmhuVWFbsiSR/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 21,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "06 ก.พ.อ. (ฉ.3) 2568 แบบแสดงหลักฐานการมีส่วนร่วม-งานวิจัย (กรณีรายงานวิจัยฉบับสมบูรณ์).docx",
      "LinkURL": "https://docs.google.com/document/d/1Cj7lQdjdPZQuhbgzjskef44iboCoQ1q6/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 22,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "06 ก.พ.อ. (ฉ.3) 2568 แบบแสดงหลักฐานการมีส่วนร่วม-ผลงานวิจัย",
      "LinkURL": "https://docs.google.com/document/d/1YmNfbSyz0C_xivOqv_MrA7K31t7xEX3N/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 23,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "06 ก.พ.อ. (ฉ.3) 2568 แบบแสดงหลักฐานการมีส่วนร่วม-ผลงานทางวิชาการกลุ่มอื่นที่มิใช่งานวิจัย",
      "LinkURL": "https://docs.google.com/document/d/1VbT61DNdva83KUHYmkieVp_ZfJUetbG7/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 24,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "07 แบบรายงานผลการตรวจสอบและรับรองการเผยแพร่ตำรา",
      "LinkURL": "https://docs.google.com/document/d/1SX6eCBqXOQjAeWRXN7cOLwePcBoI2cVN/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 25,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "08 แบบรายงานผลการตรวจสอบและรับรองการเผยแพร่หนังสือ",
      "LinkURL": "https://docs.google.com/document/d/1kJcXpjLmvsWu256kpWvg-bd-w8RDP89w/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 26,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "09 แบบรายงานผลงานทางวิชาการลักษณะอื่น (ที่ไม่ใช่ผลงานวิจัย)",
      "LinkURL": "https://docs.google.com/document/d/1sm43iiyaV9Ji9mzJwaQB-2mQvNorBW2w/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 27,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "09 แบบรายงานผลงานทางวิชาการลักษณะอื่น (ที่ไม่ใช่ผลงานวิจัย)",
      "LinkURL": "https://docs.google.com/document/d/1sm43iiyaV9Ji9mzJwaQB-2mQvNorBW2w/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 28,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "010 แบบประเมินเอกสารหลักฐานที่ใช้ในการประเมินการสอน",
      "LinkURL": "https://docs.google.com/document/d/1BDGuXAx2OtiqCu3ZmtSCkhwU3n8jdJ9o/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 29,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (ข้าราชการพลเรือนในสถาบันอุดมศึกษา สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "011 แบบประเมินผลงานทางวิชาการ",
      "LinkURL": "https://docs.google.com/document/d/1f50OXVdF18AZ19is1wDhHmh1Va528dpk/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 30,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์และวิธีการพิจารณาแต่งตั้งบุคคลให้ดำรงตำแหน่งผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์",
      "Title": "ฉบับ พ.ศ. 2561",
      "LinkURL": "https://lawapp.su.ac.th/uploads/1-A61-6-15-L_2012010333.pdf"
    },
    {
      "rowNum": 31,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์และวิธีการพิจารณาแต่งตั้งบุคคลให้ดำรงตำแหน่งผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์",
      "Title": "ฉบับที่ 2 พ.ศ. 2562",
      "LinkURL": "https://lawapp.su.ac.th/uploads/1-A2-62-4-30-L_2011280731.pdf"
    },
    {
      "rowNum": 32,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์และวิธีการพิจารณาแต่งตั้งบุคคลให้ดำรงตำแหน่งผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์",
      "Title": "ฉบับที่ 3 พ.ศ. 2563",
      "LinkURL": "https://lawapp.su.ac.th/uploads/1-A3-63-8-5-L_2011280732.pdf"
    },
    {
      "rowNum": 33,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์และวิธีการพิจารณาแต่งตั้งบุคคลให้ดำรงตำแหน่งผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์",
      "Title": "ฉบับที่ 4 พ.ศ. 2564 (ปรับแก้ไขหลักเกณฑ์)",
      "LinkURL": "https://lawapp.su.ac.th/uploads/1-A4-64-03-24-L_2103250936.pdf"
    },
    {
      "rowNum": 34,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์และวิธีการพิจารณาแต่งตั้งบุคคลให้ดำรงตำแหน่งผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์",
      "Title": "ฉบับที่ 5 พ.ศ. 2566",
      "LinkURL": "https://lawapp.su.ac.th/uploads/1-A5-66-8-23-L_2308230716.pdf"
    },
    {
      "rowNum": 35,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์และวิธีการพิจารณาแต่งตั้งบุคคลให้ดำรงตำแหน่งผู้ช่วยศาสตราจารย์ รองศาสตราจารย์ และศาสตราจารย์",
      "Title": "ฉบับที่ 6 พ.ศ. 2568 (การขอตำแหน่งเฉพาะด้าน ให้ใช้ตามประกาศ ก.พ.อ.ฯ พ.ศ. 2564)",
      "LinkURL": "https://lawapp.su.ac.th/uploads/1-V6-68-4-2_2504030624.pdf"
    },
    {
      "rowNum": 36,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ประกาศคณะกรรมการพิจารณาตำแหน่งทางวิชาการ (ก.พ.ว.) มหาวิทยาลัยศิลปากร",
      "Title": "แนวปฏิบัติเกี่ยวกับการเสนอขอกำหนดตำแหน่งทางวิชาการ",
      "LinkURL": "https://drive.google.com/file/d/14paxXSJcS_hvOJHXk2yoZ7UB5jQTU9Gz/view?usp=drive_link"
    },
    {
      "rowNum": 37,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ประกาศคณะกรรมการพิจารณาตำแหน่งทางวิชาการ (ก.พ.ว.) มหาวิทยาลัยศิลปากร",
      "Title": "แนวปฏิบัติเกี่ยวกับการเสนอขอกำหนดตำแแหน่งทางวิชาการ (ฉบับที่ 2) แก้ไขการเผยแพร่หนังสือ",
      "LinkURL": "https://drive.google.com/file/d/1DzbCfX6iyhkpB9q9Deqerb76y11coYJ8/view?usp=drive_link"
    },
    {
      "rowNum": 38,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ประกาศคณะกรรมการพิจารณาตำแหน่งทางวิชาการ (ก.พ.ว.) มหาวิทยาลัยศิลปากร",
      "Title": "การมีส่วนร่วมในผลงานทางวิชาการ",
      "LinkURL": "https://drive.google.com/file/d/12AFqJcC260DbI_MOAY7fziXKx9wbdgub/view?usp=drive_link"
    },
    {
      "rowNum": 39,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ประกาศคณะกรรมการพิจารณาตำแหน่งทางวิชาการ (ก.พ.ว.) มหาวิทยาลัยศิลปากร",
      "Title": "การเผยแพร่ผลงานสร้างสรรค์ด้านสุนทรียะ ศิลปะ สำหรับตำแหน่งศาสตราจารย์",
      "LinkURL": "https://drive.google.com/file/d/1qIB0c5oy6yL70n5WCSXaoTbo7dIvek2X/view?usp=drive_link"
    },
    {
      "rowNum": 40,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ประกาศคณะกรรมการพิจารณาตำแหน่งทางวิชาการ (ก.พ.ว.) มหาวิทยาลัยศิลปากร",
      "Title": "การเผยแพร่ผลงานวิจัยระดับชาติ (สาขาวิชาทางสังคมศาสตร์และมนุษยศาสตร์ และศิลปะและการออกแบบ)",
      "LinkURL": "https://drive.google.com/file/d/1-9jOjejshVKeybSSZfQkxzZNL3FfzHl2/view?usp=drive_link"
    },
    {
      "rowNum": 41,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "หลักเกณฑ์",
      "Level3": "ประกาศคณะกรรมการพิจารณาตำแหน่งทางวิชาการ (ก.พ.ว.) มหาวิทยาลัยศิลปากร",
      "Title": "ลักษณะและมูลค่าทุนสำหรับวิธีที่ 3",
      "LinkURL": "https://drive.google.com/file/d/1QD7WY1mfRNdWn_8H5P_4SIf2Bs4xTlNj/view?usp=drive_link"
    },
    {
      "rowNum": 42,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "01 แบบ ก.พ.ว. 01 (ผู้ขอดำเนินการเอง)",
      "LinkURL": "https://docs.google.com/document/d/1mO933SMPLHIaDE6TWvEPyy0Q9u7wt6S1/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 43,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "01 แบบ ก.พ.ว. 02 (คณะวิชาเสนอให้)",
      "LinkURL": "https://docs.google.com/document/d/1tTZkwcvmySU0jANDkC4WTFkanGAOurmS/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 44,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "02 แบบ Check List",
      "LinkURL": "https://docs.google.com/document/d/1zGp2rq0CJscvwprubaL0Nmma57V0hPJd/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 45,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "03 แบบรับรองจริยธรรมและจรรยาบรรณทางวิชาการ",
      "LinkURL": "https://docs.google.com/document/d/1nfprDNHpMfuSqrjqC4F2qycQDGzXKvI8/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 46,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "04 แบบรับรองผลงานวิจัยและผลงานทางวิชาการไม่เป็นส่วนหนึ่งของการศึกษาเพื่อรับปริญญานิพนธ์",
      "LinkURL": "https://docs.google.com/document/d/1rdnj7BZhwpcgZ2PNrur88EhfeAYLnfE7glCpwqTky18/edit?usp=drive_link"
    },
    {
      "rowNum": 47,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "05 แบบรับรองการไม่ใช้ข้อมูลจากการวิจัยในคนหรือสัตว์ (สำหรับผลงานวิจัย)",
      "LinkURL": "https://docs.google.com/document/d/180kzNqgHUZ4zMR-5l9aUoX-dHCF4BODO/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 48,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "06 แบบรับรองสัดส่วนแบบที่ 1 แบบปริมาณร้อยละ และแบบแสดงความจำนง",
      "LinkURL": "https://docs.google.com/document/d/1P3J1bLX2PZ5wh2-_kToOyb0yynqALN26/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 49,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "06 แบบรับรองสัดส่วนแบบที่ 2 แบบลักษณะการมีส่วนร่วม (FA-CA-ผู้ดำเนินการหลัก) และแบบแสดงความจำนง",
      "LinkURL": "https://docs.google.com/document/d/1oZUcI8GloBem0DYDU9PFezt2cCWh0_wS/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 50,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "07 แบบรายงานผลการตรวจสอบและรับรองการเผยแพร่ตำรา",
      "LinkURL": "https://docs.google.com/document/d/1k_A9_qKqKTtqYFBUYDIitVgdjP24bJLG/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 51,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "08 แบบรายงานผลการตรวจสอบและรับรองการเผยแพร่หนังสือ",
      "LinkURL": "https://docs.google.com/document/d/1PYVNL-Vo_7_1rhPab7kUmhAvpBYQPZl8/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 52,
      "Level1": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "09 แบบรายงานผลงานลักษณะอื่น (ผลงานวิจัยไม่ต้องใช้)",
      "LinkURL": "https://docs.google.com/document/d/1wRCH4pBcKIAxtoymwA2wmwzansrBh51U/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 53,
      "Level1": "จริยธรรมและจรรยาบรรณทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "การแต่งตั้งคณะกรรมการจริยธรรมการวิจัยของสถาบัน (การแสดงหลักฐานการอนุญาตการวิจัยในมนุษย์ที่ดำเนินการก่อนวันที่ 1 พฤศจิกายน 2561)",
      "LinkURL": "https://drive.google.com/file/d/1e0vOfmOFPJv6ZdDuqqoLf4dCJk0Axjo8/view?usp=drive_link"
    },
    {
      "rowNum": 54,
      "Level1": "จริยธรรมและจรรยาบรรณทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "คู่มือมาตรฐานการเผยแพร่ผลงานวิจัยและผลงานทางวิชาการ (สำนักงานการวิจัยแห่งชาติ (วช.))",
      "LinkURL": "https://drive.google.com/file/d/10eUcXkvbxeIUf_LsbnyiP4ns0f4KFPQr/view?usp=drive_link"
    },
    {
      "rowNum": 55,
      "Level1": "จริยธรรมและจรรยาบรรณทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ระเบียบคณะกรรมการส่งเสริมวิทยาศาสตร์ วิจัยและนวัตกรรมว่าด้วยจริยธรรมการวิจัยทั่วไป พ.ศ. 2565",
      "LinkURL": "https://drive.google.com/file/d/1-3rnPt0rE6Qxg7odRHXkCL0puFRykBJV/view?usp=drive_link"
    },
    {
      "rowNum": 56,
      "Level1": "จริยธรรมและจรรยาบรรณทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "จริยธรรมและจรรยาบรรณในการพิจารณากำหนดตำแหน่งทางวิชาการ (หนังสือเวียนกองทรัพยากรมนุษย์ ที่ อว 8603.7/ว1454 ลว. 9 มิถุนายน 2563)",
      "LinkURL": "https://drive.google.com/file/d/1KmvIXkpVlueXVONDuElFG9UPS_UDHIJA/view?usp=drive_link"
    },
    {
      "rowNum": 57,
      "Level1": "จริยธรรมและจรรยาบรรณทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "แนวทางปฏิบัติในการดำเนินการวิจัยในมนุษย์ ด้านพฤติกรรมศาสตร์ สังคมศาสตร์และมนุษยศาสตร์",
      "LinkURL": "https://drive.google.com/file/d/1xhXKxGxJOw20YNv3vzvIsrxLD3yWTy5r/view?usp=drive_link"
    },
    {
      "rowNum": 58,
      "Level1": "จริยธรรมและจรรยาบรรณทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "การดำเนินการตามมาตรการบังคับใช้กฎหมายตามมาตรา 70 แห่งพระราชบัญญัติการอุดมศึกษา พ.ศ. 2562",
      "LinkURL": "https://drive.google.com/file/d/12fY2b-KWW4jU0sHgEe-lMpOupF9gI8SA/view?usp=drive_link"
    },
    {
      "rowNum": 59,
      "Level1": "จริยธรรมและจรรยาบรรณทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ซักซ้อมความเข้าใจในการดำเนินการตามพระราชบัญญัติการอุดมศึกษา พ.ศ. 2562 มาตรา 70",
      "LinkURL": "https://drive.google.com/file/d/150l9pvVOSRo_Q7R0mAkxxGP2AhE9yXuM/view?usp=drive_link"
    },
    {
      "rowNum": 60,
      "Level1": "จริยธรรมและจรรยาบรรณทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยประมวลจริยธรรม พ.ศ. 2567",
      "LinkURL": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยประมวลจริยธรรม พ.ศ. 2567"
    },
    {
      "rowNum": 61,
      "Level1": "จริยธรรมและจรรยาบรรณทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "แนวปฏิบัติเพื่อการส่งเสริมการดำเนินการตามข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยประมวลจริยธรรม พ.ศ. 2567 (ส่วนที่ 4.3)",
      "LinkURL": "https://drive.google.com/file/d/1iTPVCWt-CCuDHsEKiNqTuPBCBv30_xbN/view?usp=drive_link"
    },
    {
      "rowNum": 62,
      "Level1": "จริยธรรมและจรรยาบรรณทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ประกาศมหาวิทยาลัยศิลปากร เรื่อง แนวปฏิบัติการใช้ปัญญาประดิษฐ์แบบเจเนอเรทิฟ (Generative Artificial Intelligence) หรือ Gen AI พ.ศ. 2568",
      "LinkURL": "https://drive.google.com/file/d/1bmvVoTHiDJthl5QFfqnzFAlhjynWJVxa/view?usp=drive_link"
    },
    {
      "rowNum": 63,
      "Level1": "สาขาวิชาในการเสนอขอกำหนดตำแหน่งทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ประกาศ ก.พ.อ. เรื่อง การกำหนดชื่อสาขาวิชาสำหรับการเสนอขอกำหนดตำแหน่งทางวิชาการและการเทียบเคียงสาขาวิชาที่เคยกำหนดไปแล้ว พ.ศ. 2562",
      "LinkURL": "https://drive.google.com/file/d/1sWt1kn1f2AR7lFk8AYRJtCyU7dkWKmVj/view?usp=drive_link"
    },
    {
      "rowNum": 64,
      "Level1": "สาขาวิชาในการเสนอขอกำหนดตำแหน่งทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "เพิ่มเติมรายชื่อสาขาวิชาและอนุสาขาวิชาที่แตกต่างไปจากบัญชีรายชื่อสาขาวิชาที่ ก.พ.อ. กำหนด",
      "LinkURL": "https://drive.google.com/file/d/1MZvhZeU5pS5_Qw0vrg6Rm2ZWcKpCzW7z/view?usp=sharing"
    },
    {
      "rowNum": 65,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "ข้าราชการพลเรือนในสถาบันอุดมศึกษา",
      "Level3": "",
      "Title": "ประกาศ ก.พ.อ. เรื่อง หลักเกณฑ์และวิธีการประเมินคุณสมบัติและผลงานทางวิชาการเพื่อให้ผู้ดำรงตำแหน่งศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น พ.ศ. 2566",
      "LinkURL": "https://drive.google.com/file/d/1f1Kx547PM-deA3oIflf-qoo8-pzxQRXr/view?usp=drive_link"
    },
    {
      "rowNum": 66,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "พนักงานมหาวิทยาลัยประเภทพนักงานประจำ สายวิชาการ",
      "Level3": "",
      "Title": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์และวิธีการประเมินคุณสมบัติและผลงานทางวิชาการเพื่อให้ผู้ดำรงตำแหน่งศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น พ.ศ. 2565",
      "LinkURL": "https://drive.google.com/file/d/1f14YZPYLX37gxIl0O-b3JF-MmO1T1X1G/view?usp=drive_link"
    },
    {
      "rowNum": 67,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบ ก.พ.ว. 03",
      "LinkURL": "https://docs.google.com/document/d/1Xx0xATsEd5olT-1UBaReJ54BUE9JDbN3/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 68,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบ Check List",
      "LinkURL": "https://docs.google.com/document/d/1nfprDNHpMfuSqrjqC4F2qycQDGzXKvI8/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 69,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรับรองผลงานวิจัยและผลงานทางวิชาการ",
      "LinkURL": "https://docs.google.com/document/d/1rdnj7BZhwpcgZ2PNrur88EhfeAYLnfE7glCpwqTky18/edit?usp=drive_link"
    },
    {
      "rowNum": 70,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรับรองไม่ใช่ผลงานที่วิจัยในคนหรือสัตว์",
      "LinkURL": "https://docs.google.com/document/d/180kzNqgHUZ4zMR-5l9aUoX-dHCF4BODO/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 71,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรับรองสัดส่วนแบบที่ 1 แบบปริมาณร้อยละ และแบบแสดงความจำนง",
      "LinkURL": "https://docs.google.com/document/d/1z7JMJvATxidE7nmnU-uPeY9Pns2mUgI3/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 72,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรับรองสัดส่วนแบบที่ 2 แบบลักษณะการมีส่วนร่วม (FA-CA-ผู้ดำเนินการหลัก) และแบบแสดงความจำนง",
      "LinkURL": "https://docs.google.com/document/d/1OsiNYQRR4tA64PZtdfvp83HrxVuHU2Pk/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 73,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรายงานผลการตรวจสอบและรับรองการเผยแพร่ตำรา",
      "LinkURL": "https://docs.google.com/document/d/1k_A9_qKqKTtqYFBUYDIitVgdjP24bJLG/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 74,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรายงานผลการตรวจสอบและรับรองการเผยแพร่หนังสือ",
      "LinkURL": "https://docs.google.com/document/d/1PYVNL-Vo_7_1rhPab7kUmhAvpBYQPZl8/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 75,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรายงานผลงานลักษณะอื่น (ผลงานวิจัยไม่ต้องใช้)",
      "LinkURL": "https://docs.google.com/document/d/1wRCH4pBcKIAxtoymwA2wmwzansrBh51U/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 76,
      "Level1": "การเสนอขอศาสตราจารย์ได้รับเงินประจำตำแหน่งสูงขึ้น",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบประเมินผลงานทางวิชาการและจริยธรรมและจรรยาบรรณทางวิชาการ",
      "LinkURL": "https://docs.google.com/document/d/1DxJOV5VZnj276FSIFb2Ba7l9lhmXW1aL/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 77,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "Infographic สรุปหลักเกณฑ์",
      "LinkURL": "https://drive.google.com/file/d/1AY8m7BvvEolCtTbv1HpS2x0oRGAEOKYn/view?usp=drive_link"
    },
    {
      "rowNum": 78,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยคุณสมบัติ หลักเกณฑ์ และวิธีการแต่งตั้งและถอดถอนผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ พ.ศ. 2567",
      "LinkURL": "https://drive.google.com/file/d/1tRrDut951V22vZZoLNsHaWh4a243Dr1S/view?usp=drive_link"
    },
    {
      "rowNum": 79,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบคำขอกำหนดตำแหน่งทางวิชาการ",
      "LinkURL": "https://docs.google.com/document/d/1ake1SVb1iEhfILUSD7t0nvKJJOYgyAYC/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 80,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรับรองจริยธรรมและจรรยาบรรณทางวิชาการ",
      "LinkURL": "https://docs.google.com/document/d/1VbM5wDZ3eJ02_TQllW2o9wpc-kpjA1fl/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 81,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรับรองผลงานวิจัยและผลงานทางวิชาการ",
      "LinkURL": "https://docs.google.com/document/d/1CzBtV-6C4CAfYgnm2cSg9ajLkKcsOoem/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 82,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรับรองไม่ใช่ผลงานที่วิจัยในคนหรือสัตว์",
      "LinkURL": "https://docs.google.com/document/d/1qYLTMtOYVP9wH68ys5KcgQYXYpXvu6Fc/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 83,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรับรองสัดส่วนแบบที่ 1 แบบปริมาณร้อยละ และแบบแสดงความจำนง",
      "LinkURL": "https://docs.google.com/document/d/1P3J1bLX2PZ5wh2-_kToOyb0yynqALN26/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 84,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรับรองสัดส่วนแบบที่ 2 แบบลักษณะการมีส่วนร่วม (FA-CA-ผู้ดำเนินการหลัก) และแบบแสดงความจำนง",
      "LinkURL": "https://docs.google.com/document/d/1R6X7K5e47lO1VwV43Mt_RCmBGTCN_xzV/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 85,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรายงานผลการตรวจสอบและรับรองการเผยแพร่ตำรา",
      "LinkURL": "https://docs.google.com/document/d/1EhnkVLp5Y-AoAyJ5WPyNKaQe8nGUkYTk/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 86,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรายงานผลการตรวจสอบและรับรองการเผยแพร่หนังสือ",
      "LinkURL": "https://docs.google.com/document/d/1iUUNPH3Uc4ANcCelNmvKxBAvNzIfzArM/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 87,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรายงานผลการตรวจสอบและรับรองการเผยผลงานลักษณะอื่น",
      "LinkURL": "https://docs.google.com/document/d/1Bd9XILEK0r3aauOPVqnFfOenw8tvv9Rp/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 88,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบรายงานผลงานในลักษณะอื่นๆ",
      "LinkURL": "https://docs.google.com/document/d/1jyGz9WHZr9dxmRU06KBcYXIIq0K10UsN/edit?usp=sharing&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 89,
      "Level1": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบประเมินผลงานทางวิชาการและจริยธรรมและจรรยาบรรณทางวิชาการ",
      "LinkURL": "https://docs.google.com/document/d/1ar93izeZ86QQzisCz2pjjqPUk1VrH3Hm/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 90,
      "Level1": "การประเมินความก้าวหน้าตำแหน่งทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยการบริหารงานบุคคลพนักงานมหาวิทยาลัย พ.ศ. 2559",
      "LinkURL": "https://drive.google.com/file/d/13XNI_AUl40A9EelKY3MN6IZg7cc05tHd/view?usp=drive_link"
    },
    {
      "rowNum": 91,
      "Level1": "การประเมินความก้าวหน้าตำแหน่งทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ประกาศมหาวิทยาลัยศิลปากร เรื่อง แนวทางการดำเนินการสำหรับพนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ ผู้ดำรงตำแหน่งอาจารย์ หรือผู้ช่วยศาสตราจารย์ ที่ไม่สามารถเข้าสู่ตำแหน่งทางวิชาการที่สูงขึ้นได้ภายในระยะเวลาที่กำหนด",
      "LinkURL": "https://drive.google.com/file/d/1Jo3QC60ntlGO-leOyX6VpRI0kFXLtd6P/view?usp=drive_link"
    },
    {
      "rowNum": 92,
      "Level1": "ภาระงานขั้นต่ำและการรายงานจำนวนผลงานทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยการกำหนดภาระงานขั้นต่ำและผลงานทางวิชาการของคณาจารย์ประจำ พ.ศ. 2563",
      "LinkURL": "https://drive.google.com/file/d/1KZlR4OHbr7dKtDF2dtjapJ3XTRPiFvfI/view?usp=drive_link"
    },
    {
      "rowNum": 93,
      "Level1": "ภาระงานขั้นต่ำและการรายงานจำนวนผลงานทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์และวิธีการประเมินผลการปฏิบัติงาน พ.ศ. 2561",
      "LinkURL": "https://lawapp.su.ac.th/uploads/1-P61-9-12-21-L_compressed_2109280829.pdf"
    },
    {
      "rowNum": 94,
      "Level1": "ภาระงานขั้นต่ำและการรายงานจำนวนผลงานทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์และวิธีการประเมินผลการปฏิบัติงาน พ.ศ. 2563 (ฉบับที่ 2)",
      "LinkURL": "https://drive.google.com/file/d/1HXaeK18vGzFqm9h5q7PdEo2Nm-LwgLLl/view?usp=drive_link"
    },
    {
      "rowNum": 95,
      "Level1": "ภาระงานขั้นต่ำและการรายงานจำนวนผลงานทางวิชาการ",
      "Level2": "",
      "Level3": "",
      "Title": "ประกาศมหาวิทยาลัยศิลปากร เรื่อง กำหนดตำแหน่งที่ได้รับยกเว้นการมีผลงานทางวิชาการมาเป็นส่วนหนึ่งของตัวชี้วัดผลงานหลักในการจัดทำข้อตกลงร่วมกันในการประเมินประสิทธิภาพและประสิทธิผลการปฏิบัติงานในหน้าที่ความรับผิดชอบของคณาจารย์ประจำ",
      "LinkURL": "https://drive.google.com/file/d/1buKhNyk8tVUVbt9K6znhMx92KaWqtKPl/view?usp=drive_link"
    },
    {
      "rowNum": 96,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "",
      "Level3": "",
      "Title": "ระบบคำนวณการระบุปีของภาระงานและผลงานทางวิชาการ",
      "LinkURL": "https://silpakornuniversity.my.canva.site/extended-retire"
    },
    {
      "rowNum": 97,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "สรุปหลักเกณฑ์การต่อเวลาราชการ/ต่อการจ้าง",
      "LinkURL": "https://drive.google.com/file/d/1Db1VuuY3POR-p9Ttj2B91_GVfIyNMO5U/view?usp=drive_link"
    },
    {
      "rowNum": 98,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "แผนการดำเนินงานการต่อเวลาราชการ/ต่อการจ้าง",
      "LinkURL": "https://drive.google.com/file/d/1a3ROYqOwcVzwhszB0H01FT_VgS6BmBqQ/view?usp=drive_link"
    },
    {
      "rowNum": 99,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "ประกาศ ก.พ.อ. เรื่อง หลักเกณฑ์ วิธีการ และเงื่อนไขการต่อเวลาราชการของข้าราชการพลเรือนในสถาบันอุดมศึกษา พ.ศ. 2557",
      "LinkURL": "https://drive.google.com/file/d/1ziwBRl9HVSBMymlT8ho4gJHUOrz_Zmo3/view?usp=drive_link"
    },
    {
      "rowNum": 100,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์ วิธีการ เงื่อนไขและการพิจารณาต่อเวลาราชการ และต่อการจ้างของบุคลากรสายวิชาการที่จะเกษียณอายุเมื่อมีอายุครบหกสิบปีบริบูรณ์ พ.ศ. 2561",
      "LinkURL": "https://drive.google.com/file/d/1DAeKnt43JwOW-aVKsLJCmy5gqG3cfX1w/view?usp=drive_link"
    },
    {
      "rowNum": 101,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "ข้อบังคับมหาวิทยาลัยศิลปากรว่าด้วยหลักเกณฑ์ วิธีการ เงื่อนไขและการพิจารณาต่อเวลาราชการ และต่อการจ้างของบุคลากรสายวิชาการที่จะเกษียณอายุเมื่อมีอายุครบหกสิบปีบริบูรณ์ (ฉบับที่ 2) พ.ศ. 2566",
      "LinkURL": "https://drive.google.com/file/d/1HDHogEgfVze_UqSL3fOgLJY5-5YG1zOn/view?usp=drive_link"
    },
    {
      "rowNum": 102,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "หลักเกณฑ์",
      "Level3": "",
      "Title": "หนังสือตอบข้อหารือเรื่องงานบริการวิชาการของคณาจารย์ในสถาบันอุดมศึกษา กรณีต่อเวลาราชการ/ต่อการจ้าง",
      "LinkURL": "https://drive.google.com/file/d/1PD1YeE-T8uI3bigPgWJOnPAwGnjPSiG8/view?usp=drive_link"
    },
    {
      "rowNum": 103,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "แบบฟอร์ม",
      "Level3": "",
      "Title": "แบบ Check List",
      "LinkURL": "https://docs.google.com/document/d/16oZ5NBIRc8e4LyLF7uqEKotWJ41MxD6S/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 104,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "แบบฟอร์ม",
      "Level3": "แบบตรวจสอบคุณสมบัติ",
      "Title": "ข้าราชการฯ",
      "LinkURL": "https://docs.google.com/document/d/1L8KrEmSnQKq0eGRcmRLWotNA2q340rdU/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 105,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "แบบฟอร์ม",
      "Level3": "แบบตรวจสอบคุณสมบัติ",
      "Title": "พนักงานฯ",
      "LinkURL": "https://docs.google.com/document/d/1zNWqnaK9pNgBhN4MhAlsKlYRTTVopsRY/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 106,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "แบบฟอร์ม",
      "Level3": "แบบต่อเวลาราชการ หมายเลข 1-4 และแบบรายงานภาระงานย้อนหลัง 3 ปี (ในแต่ละปีกองทรัพยากรมนุษย์จะระบุปีภาคการศึกษาให้กับผู้เสนอขอต่อเวลาราชการ/ต่อการจ้างในปีนั้น ๆ)",
      "Title": "แบบต่อเวลาราชการ หมายเลข 1",
      "LinkURL": "https://docs.google.com/document/d/1GKt5E2dIHaqxec68kVQjnMXWXZ2QFrDx/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 107,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "แบบฟอร์ม",
      "Level3": "แบบต่อเวลาราชการ หมายเลข 1-4 และแบบรายงานภาระงานย้อนหลัง 3 ปี (ในแต่ละปีกองทรัพยากรมนุษย์จะระบุปีภาคการศึกษาให้กับผู้เสนอขอต่อเวลาราชการ/ต่อการจ้างในปีนั้น ๆ)",
      "Title": "แบบต่อเวลาราชการ หมายเลข 2",
      "LinkURL": "https://docs.google.com/document/d/15eWuiVYqVD3DqH4p3VYg3fhlheP28fqZ/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 108,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "แบบฟอร์ม",
      "Level3": "แบบต่อเวลาราชการ หมายเลข 1-4 และแบบรายงานภาระงานย้อนหลัง 3 ปี (ในแต่ละปีกองทรัพยากรมนุษย์จะระบุปีภาคการศึกษาให้กับผู้เสนอขอต่อเวลาราชการ/ต่อการจ้างในปีนั้น ๆ)",
      "Title": "แบบต่อเวลาราชการ หมายเลข 3",
      "LinkURL": "https://docs.google.com/document/d/1RCD7-5ba3nQ4uZWBobyHr7fN3r9cqrpN/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 109,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "แบบฟอร์ม",
      "Level3": "แบบต่อเวลาราชการ หมายเลข 1-4 และแบบรายงานภาระงานย้อนหลัง 3 ปี (ในแต่ละปีกองทรัพยากรมนุษย์จะระบุปีภาคการศึกษาให้กับผู้เสนอขอต่อเวลาราชการ/ต่อการจ้างในปีนั้น ๆ)",
      "Title": "แบบต่อเวลาราชการ หมายเลข 4",
      "LinkURL": "https://docs.google.com/document/d/1_ReoZ37aMuZY6ZSNyZjJNhl01DMilJLW/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    },
    {
      "rowNum": 110,
      "Level1": "การต่อเวลาราชการ/ต่อการจ้างบุคลากรสายวิชาการที่มีอายุครบ 60 ปีบริบูรณ์",
      "Level2": "แบบฟอร์ม",
      "Level3": "แบบต่อเวลาราชการ หมายเลข 1-4 และแบบรายงานภาระงานย้อนหลัง 3 ปี (ในแต่ละปีกองทรัพยากรมนุษย์จะระบุปีภาคการศึกษาให้กับผู้เสนอขอต่อเวลาราชการ/ต่อการจ้างในปีนั้น ๆ)",
      "Title": "แบบรายงานภาระงานย้อนหลัง 3 ปีงบประมาณ",
      "LinkURL": "https://docs.google.com/document/d/1mb7iqtyuP6kPVQpS38rCl_dPqU4f5s_J/edit?usp=drive_link&ouid=100702716237747511186&rtpof=true&sd=true"
    }
  ],
  "formCatsMeta": [
    {
      "rowNum": 2,
      "Name": "การขอกำหนดตำแหน่งทางวิชาการ (พนักงานมหาวิทยาลัย ประเภทพนักงานประจำ สายวิชาการ)",
      "Description": "สามารถศึกษาหลักเกณฑ์ได้ตามสรุปหลักเกณฑ์การเสนอขอกำหนดตำแหน่งทางวิชาการลิงก์ด้านล่างนี้",
      "ImageURL": "",
      "ExternalLink": "https://drive.google.com/file/d/1oOwfiXBod43GAZTK-o2VV13XoLpvwLxF/view?usp=drive_link"
    },
    {
      "rowNum": 3,
      "Name": "การประเมินการสอน",
      "Description": "สามารถศึกษาหลักเกณฑ์ได้ตามสรุปหลักเกณฑ์การประเมินการสอนตามลิงก์ด้านล่างนี้",
      "ImageURL": "",
      "ExternalLink": "https://drive.google.com/file/d/1jAwbJujgeg6rJfkKuGEABW_31MlCO-QC/view?usp=drive_link"
    },
    {
      "rowNum": 4,
      "Name": "สาขาวิชาในการเสนอขอกำหนดตำแหน่งทางวิชาการ",
      "Description": "สามารถค้นหาสาขาวิชาได้ในเมนู \"สาขาวิชาที่ ก.พ.อ. กำหนด\"",
      "ImageURL": "",
      "ExternalLink": "https://su-academicranking.github.io/Guideline/"
    },
    {
      "rowNum": 5,
      "Name": "การขอตำแหน่งผู้ช่วยศาสตราจารย์พิเศษ รองศาสตราจารย์พิเศษ และศาสตราจารย์พิเศษ",
      "Description": "สำหรับอาจารย์พิเศษ / อาจารย์ผู้มีความรู้ความสามารถ / พนักงานชั่วคราว ตำแหน่งอาจารย์ ซึ่งสอนในมหาวิทยาลัยศิลปากรรวมไม่น้อยกว่า 3 ปี",
      "ImageURL": "",
      "ExternalLink": "https://drive.google.com/file/d/1AY8m7BvvEolCtTbv1HpS2x0oRGAEOKYn/view?usp=drive_link"
    }
  ],
  "branches": [
    {
      "rowNum": 2,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0101 คณิตศาสตร์ทั่วไป (General Mathematics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 3,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0102 ตรรกศาสตร์เชิงคณิตศาสตร์ และพื้นฐาน (Mathematical Logic and Foundation)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 4,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0103 ศาสตร์เชิงการจัด (Combinatorics)",
      "Subfield": "010301 ทฤษฎีกราฟ (Graph Theory)",
      "Branch": "-"
    },
    {
      "rowNum": 5,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010401 พีชคณิต (Algebra)",
      "Branch": "-"
    },
    {
      "rowNum": 6,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010402 ฟังก์ชันจริง (Real Functions)",
      "Branch": "-"
    },
    {
      "rowNum": 7,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010403 ฟังก์ชันของตัวแปรเชิงซ้อน (Functions of a Complex Variable)",
      "Branch": "-"
    },
    {
      "rowNum": 8,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010404 สมการเชิงอนุพันธุ์สำมัญ (Ordinary Differential Equations)",
      "Branch": "-"
    },
    {
      "rowNum": 9,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010405 สมการเชิงอนุพันธุ์ย่อย (Partial Differential Equations)",
      "Branch": "-"
    },
    {
      "rowNum": 10,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010406 ระบบเชิงพลวัต (Dynamical Systems and Ergodic Theory)",
      "Branch": "-"
    },
    {
      "rowNum": 11,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010407 สมการเชิงผลต่างและเชิงฟังก์ชัน (Difference and Functional Equations)",
      "Branch": "-"
    },
    {
      "rowNum": 12,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010408 การประมาณและการขยาย (Approximations and Expansions)",
      "Branch": "-"
    },
    {
      "rowNum": 13,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010409 สมการเชิงปริพันธุ์ (Integral Equations)",
      "Branch": "-"
    },
    {
      "rowNum": 14,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010410 การวิเคราะห์เชิงฟังก์ชัน (Functional Analysis)",
      "Branch": "-"
    },
    {
      "rowNum": 15,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010411 แคลคูลัสการแปรผันและการควบคุมเหมาะที่สุด (Calculus of Variations and Optimal Control) หรือ การหาค่าเหมาะที่สุด (Optimization)",
      "Branch": "-"
    },
    {
      "rowNum": 16,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010412 เรขาคณิต (Geometry)",
      "Branch": "-"
    },
    {
      "rowNum": 17,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0104 คณิตศาสตร์",
      "Subfield": "010413 แมนิโฟลด์ความน่าจะเป็นและระบบเชิงสุ่ม (Probability Theory and Stochastic Processes)",
      "Branch": "-"
    },
    {
      "rowNum": 18,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0105 โทโพโลยี (Topology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 19,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0106 การวิเคราะห์เชิงตัวเลข (Numerical Analysis)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 20,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0107 วิทยาศาสตร์คอมพิวเตอร์ หรือ วิทยาการคอมพิวเตอร์ (Computer Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 21,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0108 การวิจัยดำเนินการ (Operations Research) หรือ กำหนดการเชิงคณิตศาสตร์ (Mathematical Programming)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 22,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0109 ทฤษฎีเกมส์ (Game Theory)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 23,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0110 ทฤษฎีระบบ (Systems Theory) หรือ ทฤษฎีการควบคุม (Control Theory)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 24,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0111 คณิตศาสตร์ศึกษา (Mathe matics Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 25,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0112 คณิตศาสตร์ประยุกต์ (Applied Mathematics)",
      "Subfield": "011201 คณิตศาสตร์การเงิน (Financial Mathematics)",
      "Branch": "-"
    },
    {
      "rowNum": 26,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0112 คณิตศาสตร์ประยุกต์ (Applied Mathematics)",
      "Subfield": "011202 คณิตศาสตร์ประกันภัย (Actuarial Mathematics)",
      "Branch": "-"
    },
    {
      "rowNum": 27,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0112 คณิตศาสตร์ประยุกต์ (Applied Mathematics)",
      "Subfield": "011203 การจำลองแบบเชิงคณิตศาสตร์ (Mathematical Modelling)",
      "Branch": "-"
    },
    {
      "rowNum": 28,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0112 คณิตศาสตร์ประยุกต์ (Applied Mathematics)",
      "Subfield": "011204 การจำลองสถานการณ์ (Simulation Modelling)",
      "Branch": "-"
    },
    {
      "rowNum": 29,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0113 สถิติศาสตร์ (Statistics)",
      "Subfield": "011301 สถิติ (Statistics)",
      "Branch": "-"
    },
    {
      "rowNum": 30,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0113 สถิติศาสตร์ (Statistics)",
      "Subfield": "011302 สถิติประยุกต์ (Applied Statistics)",
      "Branch": "-"
    },
    {
      "rowNum": 31,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0113 สถิติศาสตร์ (Statistics)",
      "Subfield": "011303 ชีวสถิติ (Biostatistics)",
      "Branch": "-"
    },
    {
      "rowNum": 32,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0131 เคมีอินทรีย์ (Organic Chemistry)",
      "Subfield": "013101 เคมีผลิตภัณฑ์ธรรมชาติ (Natural Products Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 33,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0131 เคมีอินทรีย์ (Organic Chemistry)",
      "Subfield": "013102 เคมีสังเคราะห์ (Synthetic Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 34,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0131 เคมีอินทรีย์ (Organic Chemistry)",
      "Subfield": "013103 เคมีการแพทย์ (Medicinal Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 35,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0131 เคมีอินทรีย์ (Organic Chemistry)",
      "Subfield": "013104 เคมีนาโน (Nano Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 36,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0131 เคมีอินทรีย์ (Organic Chemistry)",
      "Subfield": "013105 เคมีซุปราโมเลคิวลาร์ (Supramolecular Chemistry",
      "Branch": "-"
    },
    {
      "rowNum": 37,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0132 เคมีวิเคราะห์ (Analytical Chemistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 38,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0133 เคมีอนินทรีย์ (Inorganic Chemistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 39,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0134 เคมีเชิงฟิสิกส์ (Physical Chemistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 40,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0135 เคมีโลหอินทรีย์ (Organometallic Chemistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 41,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0136 เคมีสิ่งแวดล้อม (Environmental Chemistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 42,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0137 เคมีทฤษฎี (Theoretical Chemistry)",
      "Subfield": "013701 เคมีคอมพิวเตอร์ (Computational Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 43,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0137 เคมีทฤษฎี (Theoretical Chemistry)",
      "Subfield": "013702 เคมีควอนตัม (Quantum Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 44,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0137 เคมีทฤษฎี (Theoretical Chemistry)",
      "Subfield": "013703 เคมีนิวเคลียร์ (Nuclear Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 45,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0138 ชีวเคมี (Biochemistry) หรือ เคมีชีววิทยา (Chemical Biology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 46,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0139 เคมีอุตสาหกรรม (Industrial Chemistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 47,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0140 ปิโตรเคมี (Petrochemistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 48,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0141 ชีววิทยา (Biology)",
      "Subfield": "014101 ชีววิทยาการอนุรักษ์ (Conservation Biology)",
      "Branch": "-"
    },
    {
      "rowNum": 49,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0141 ชีววิทยา (Biology)",
      "Subfield": "014102 การเพาะเลี้ยงเนื้อเยื่อ (Tissue Culture)",
      "Branch": "-"
    },
    {
      "rowNum": 50,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0142 พฤกษศาสตร์ (Botany)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 51,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0143 สัตววิทยา (Zoology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 52,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0144 กายวิภาคศาสตร์ (Anatomy)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 53,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0145 เทคโนโลยีชีวภาพ (Biotechnology)",
      "Subfield": "014501 วิทยาเชื้อรา (Mycology)",
      "Branch": "-"
    },
    {
      "rowNum": 54,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0145 เทคโนโลยีชีวภาพ (Biotechnology)",
      "Subfield": "014502 เทคโนโลยีการหมัก (Fermentation Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 55,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0145 เทคโนโลยีชีวภาพ (Biotechnology)",
      "Subfield": "014503 เทคโนโลยีชีวภาพของแมลง (Insect Biotechnology)",
      "Branch": "-"
    },
    {
      "rowNum": 56,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0145 เทคโนโลยีชีวภาพ (Biotechnology)",
      "Subfield": "014504 พันธุวิศวกรรมแบคทีเรีย (Bacterial Genetic Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 57,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0145 เทคโนโลยีชีวภาพ (Biotechnology)",
      "Subfield": "014505 เทคโนโลยีชีวภาพอาหาร (Food Biotechnology)",
      "Branch": "-"
    },
    {
      "rowNum": 58,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0146 จุลชีววิทยา (Microbiology)",
      "Subfield": "014601 ไวรัสวิทยา (Virology)",
      "Branch": "-"
    },
    {
      "rowNum": 59,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0146 จุลชีววิทยา (Microbiology)",
      "Subfield": "014602 แบคทีเรียวิทยา (Bacteriology)",
      "Branch": "-"
    },
    {
      "rowNum": 60,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0146 จุลชีววิทยา (Microbiology)",
      "Subfield": "014603 เห็ดราวิทยา (Mycology)",
      "Branch": "-"
    },
    {
      "rowNum": 61,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0146 จุลชีววิทยา (Microbiology)",
      "Subfield": "014604 ภูมิคุ้มกันวิทยา (Immunology)",
      "Branch": "-"
    },
    {
      "rowNum": 62,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0147 พันธุศาสตร์ (Genetics)",
      "Subfield": "014701 พันธุศาสตร์พืช (Plant Genetics)",
      "Branch": "-"
    },
    {
      "rowNum": 63,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0147 พันธุศาสตร์ (Genetics)",
      "Subfield": "014702 พันธุศาสตร์สัตว์ (Animal Genetics)",
      "Branch": "-"
    },
    {
      "rowNum": 64,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0147 พันธุศาสตร์ (Genetics)",
      "Subfield": "014703 พันธุศาสตร์จุลินทรีย์ (Microbial Genetics)",
      "Branch": "-"
    },
    {
      "rowNum": 65,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0148 ชีววิทยาระบบ (Systems Biology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 66,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0151 ฟิสิกส์ (Physics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 67,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0152 ฟิสิกส์เชิงเคมี (Chemical Physics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 68,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0153 ชีวฟิสิกส์ (Biophysics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 69,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0154 ดาราศาสตร์ฟิสิกส์ (Astrophysics and Space Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 70,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0155 ทัศนศาสตร์ (Optics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 71,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0156 ธรณีฟิสิกส์ (Geophysics)",
      "Subfield": "015601 วิทยาแผ่นดินไหว (Seismology)",
      "Branch": "-"
    },
    {
      "rowNum": 72,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0157 ฟิสิกส์เชิงทฤษฎี (Theoretical Physics)",
      "Subfield": "015701 ฟิสิกส์นิวเคลียร์ (Nuclear Physics)",
      "Branch": "-"
    },
    {
      "rowNum": 73,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0157 ฟิสิกส์เชิงทฤษฎี (Theoretical Physics)",
      "Subfield": "015702 ฟิสิกส์พลาสมา (Plasma Physics)",
      "Branch": "-"
    },
    {
      "rowNum": 74,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0157 ฟิสิกส์เชิงทฤษฎี (Theoretical Physics)",
      "Subfield": "015703 ฟิสิกส์อนุภาค (Particle Physics)",
      "Branch": "-"
    },
    {
      "rowNum": 75,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0157 ฟิสิกส์เชิงทฤษฎี (Theoretical Physics)",
      "Subfield": "015704 ฟิสิกส์ควอนตัม (Quantum Physics)",
      "Branch": "-"
    },
    {
      "rowNum": 76,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0158 ฟิสิกส์เสียง (Sound Physics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 77,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0161 วัสดุศาสตร์ (Material Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 78,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0162 โลหะวิทยา (Metallurgy)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 79,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0163 วิทยาการเซรามิกส์ (Ceramics Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 80,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0164 วิทยาการคอมโพสิต (Composites Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 81,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0165 วิทยาการพอลิเมอร์ หรือ วิทยาศาสตร์พอลิเมอร์ (Polymer Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 82,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0166 วิทยาการและเทคโนโลยีสิ่งทอ (Textile Sciences and Technology)",
      "Subfield": "016601 วิทยาการสิ่งทอ (Textile Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 83,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0166 วิทยาการและเทคโนโลยีสิ่งทอ (Textile Sciences and Technology)",
      "Subfield": "016602 เทคโนโลยีสิ่งทอ (Textile Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 84,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0166 วิทยาการและเทคโนโลยีสิ่งทอ (Textile Sciences and Technology)",
      "Subfield": "016603 การพัฒนาผลิตภัณฑ์สิ่งทอ (Development of Textile Product)",
      "Branch": "-"
    },
    {
      "rowNum": 85,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0171 วิทยาศาสตร์โลก หรือ โลกศาสตร์ (Earth Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 86,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0172 ธรณีวิทยา (Geology)",
      "Subfield": "017201 ปฐพีวิทยา (Pedology)",
      "Branch": "-"
    },
    {
      "rowNum": 87,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0172 ธรณีวิทยา (Geology)",
      "Subfield": "017202 อัญมณีวิทยา (Gemology)",
      "Branch": "-"
    },
    {
      "rowNum": 88,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0173 สมุทรศาสตร์ (Oceanography)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 89,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0174 อุทกศาสตร์ (Hydrography)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 90,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0175 อุตุนิยมวิทยา (Meteorology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 91,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0176 ดาราศาสตร์ (Astronomy)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 92,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0181 ชีวสารสนเทศ (Bioinformatics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 93,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0182 นิเวศวิทยา (Ecology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 94,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0183 วิทยาศาสตร์สิ่งแวดล้อม หรือ วิทยาการสิ่งแวดล้อม (Environmental Sciences)",
      "Subfield": "018301 การจัดการสิ่งแวดล้อมและภัยพิบัติ (Environment and Disaster Management)",
      "Branch": "-"
    },
    {
      "rowNum": 95,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0183 วิทยาศาสตร์สิ่งแวดล้อม หรือ วิทยาการสิ่งแวดล้อม (Environmental Sciences)",
      "Subfield": "018302 การจัดการขยะและของเสียอันตราย (Waste and Hazardous Waste Management)",
      "Branch": "-"
    },
    {
      "rowNum": 96,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0183 วิทยาศาสตร์สิ่งแวดล้อม หรือ วิทยาการสิ่งแวดล้อม (Environmental Sciences)",
      "Subfield": "018303 วิทยาศาสตร์อนามัยสิ่งแวดล้อม (Environmental Health Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 97,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0184 วิทยาศาสตร์การทะเล (Marine Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 98,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0185 มาตรวิทยา (Metrology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 99,
      "Group": "วิทยาศาสตร์ธรรมชาติ",
      "Field": "0186 นิติวิทยาศาสตร์ (Forensic Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 100,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1101 วิศวกรรมเคมี (Chemical Engineering)",
      "Subfield": "110101 เคมีวิศวกรรม หรือ วิศวกรรมเคมี (Chemical Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 101,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1101 วิศวกรรมเคมี (Chemical Engineering)",
      "Subfield": "110102 เคมีเทคนิค (Chemical Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 102,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1101 วิศวกรรมเคมี (Chemical Engineering)",
      "Subfield": "110103 เคมีอุตสาหกรรม (Industrial Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 103,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1101 วิศวกรรมเคมี (Chemical Engineering)",
      "Subfield": "110104 วิศวกรรมกระบวนการเคมี (Chemical Process Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 104,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1101 วิศวกรรมเคมี (Chemical Engineering)",
      "Subfield": "110105 วิศวกรรมปิโตรเคมี (Petrochemical Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 105,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1102 วิศวกรรมชีวภาพ (Biological Engineering)",
      "Subfield": "110201 วิศวกรรมเคมีและชีวภาพ (Chemical and Biological Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 106,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1103 วิศวกรรมชีวการแพทย์ (Biomedical Engineering)",
      "Subfield": "110301 วิศวกรรมเนื้อเยื่อ (Tissue Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 107,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1103 วิศวกรรมชีวการแพทย์ (Biomedical Engineering)",
      "Subfield": "110302 วิศวกรรมประสาท (Neural Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 108,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1103 วิศวกรรมชีวการแพทย์ (Biomedical Engineering)",
      "Subfield": "110303 วิศวกรรมหัวใจและหลอดเลือด (Cardiovascular Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 109,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1103 วิศวกรรมชีวการแพทย์ (Biomedical Engineering)",
      "Subfield": "110304 วิศวกรรมอวัยวะประดิษฐ์ (Artificial Organs Engine ering)",
      "Branch": "-"
    },
    {
      "rowNum": 110,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1104 วิศวกรรมโยธา (Civil Engineering)",
      "Subfield": "110401 ก่อสร้าง (Construction)",
      "Branch": "-"
    },
    {
      "rowNum": 111,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1104 วิศวกรรมโยธา (Civil Engineering)",
      "Subfield": "110402 วิศวกรรมโครงสร้าง (Structural Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 112,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1104 วิศวกรรมโยธา (Civil Engineering)",
      "Subfield": "110403 วิศวกรรมโยธาและการบริหารการก่อสร้าง (Civil Engineering and Construction Management)",
      "Branch": "-"
    },
    {
      "rowNum": 113,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1104 วิศวกรรมโยธา (Civil Engineering)",
      "Subfield": "110404 วิศวกรรมโยธาและโครงสร้างพื้นฐาน (Civil and Infrastructure Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 114,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1105 วิศวกรรมสิ่งแวดล้อม (Environmental Engineering)",
      "Subfield": "110501 วิศวกรรมโยธา - ชลประทาน (Civil Engineering - Irrigation)",
      "Branch": "-"
    },
    {
      "rowNum": 115,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1105 วิศวกรรมสิ่งแวดล้อม (Environmental Engineering)",
      "Subfield": "110502 วิศวกรรมทรัพยากรน้ำ (Water Resources Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 116,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1105 วิศวกรรมสิ่งแวดล้อม (Environmental Engineering)",
      "Subfield": "110503 วิศวกรรมการจัดการของเสีย (Waste Management Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 117,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1106 วิศวกรรมทรัพยากรธรณีและเหมืองแร่ (Georesources and Mining Engineering)",
      "Subfield": "110601 วิศวกรรมทรัพยากรธรณี (Georesources Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 118,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1106 วิศวกรรมทรัพยากรธรณีและเหมืองแร่ (Georesources and Mining Engineering)",
      "Subfield": "110602 วิศวกรรมเหมืองแร่ (Mining Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 119,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1107 วิศวกรรมสำรวจและขนส่ง (Survey and Transportation Engineering)",
      "Subfield": "110701 วิศวกรรมสำรวจ (Survey Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 120,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1107 วิศวกรรมสำรวจและขนส่ง (Survey and Transportation Engineering)",
      "Subfield": "110702 วิศวกรรมขนส่ง (Transportation Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 121,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1107 วิศวกรรมสำรวจและขนส่ง (Survey and Transportation Engineering)",
      "Subfield": "110703 วิศวกรรมสำรวจและชนบท (Survey and Rural Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 122,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1107 วิศวกรรมสำรวจและขนส่ง (Survey and Transportation Engineering)",
      "Subfield": "110704 วิศวกรรมสำรวจและสารสนเทศภูมิศาสตร์ (Survey Engineering and Geographic Information)",
      "Branch": "-"
    },
    {
      "rowNum": 123,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1108 วิศวกรรมการผลิต (Production Engineering)",
      "Subfield": "110801 วิศวกรรมและการออกแบบการผลิต (Manufacturing Design and Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 124,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1109 วิศวกรรมอุตสาหการ (Industrial Engineering)",
      "Subfield": "110901 วิศวกรรมอุตสาหการและระบบ (Industrial and Systems Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 125,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1109 วิศวกรรมอุตสาหการ (Industrial Engineering)",
      "Subfield": "110902 วิศวกรรมอุตสาหการและโลจิสติกส์ (Industrial and Logistics Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 126,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1109 วิศวกรรมอุตสาหการ (Industrial Engineering)",
      "Subfield": "110903 วิศวกรรมบรรจุภัณฑ์ (Packaging Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 127,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1110 วิศวกรรมเครื่องกล (Mechanical Engineering)",
      "Subfield": "111001 วิศวกรรมยานยนต์ (Automotive Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 128,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1110 วิศวกรรมเครื่องกล (Mechanical Engineering)",
      "Subfield": "111002 วิศวกรรมเครื่องกลและการออกแบบ (Mechanical and Design Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 129,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1110 วิศวกรรมเครื่องกล (Mechanical Engineering)",
      "Subfield": "111003 วิศวกรรมเครื่องจักรกลเกษตร (Agricultural Machinery Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 130,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1111 วิศวกรรมการบินและอวกาศ หรือ วิศวกรรมอากาศยาน (Aerospace Engineering)",
      "Subfield": "111101 วิศวกรรมดาวเทียม (Satellite Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 131,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1112 วิศวกรรมการทะเล (Marine Engineering)",
      "Subfield": "111201 วิศวกรรมเรือ (Naval Architecture) หรือ วิศวกรรมต่อเรือ (Marine Engineering) หรือ วิศวกรรมเครื่องกลเรือ (Naval Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 132,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1113 วิศวกรรมไฟฟ้า (Electrical Engineering)",
      "Subfield": "111301 วิศวกรรมไฟฟ้าสื่อสาร (Electrical Communication Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 133,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1113 วิศวกรรมไฟฟ้า (Electrical Engineering)",
      "Subfield": "111302 วิศวกรรมไฟฟ้ากำลัง (Electrical Power Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 134,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1113 วิศวกรรมไฟฟ้า (Electrical Engineering)",
      "Subfield": "111303 เทคโนโลยีสมาร์ตกริด (Smart Grid Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 135,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1113 วิศวกรรมไฟฟ้า (Electrical Engineering)",
      "Subfield": "111304 วิศวกรรมควบคุมอัตโนมัติ (Automation Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 136,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1113 วิศวกรรมไฟฟ้า (Electrical Engineering)",
      "Subfield": "111305 วิศวกรรมควบคุมและเครื่องมือวัด (Control and Instrumentation Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 137,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1114 วิศวกรรมอิเล็กทรอนิกส์ (Electronics Engineering)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 138,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1115 วิศวกรรมคอมพิวเตอร์ (Computer Engineering)",
      "Subfield": "111501 วิศวกรรมซอฟต์แวร์ (Software Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 139,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1116 วิศวกรรมโทรคมนาคมและการสื่อสาร (Telecommunication and Communication Engineering)",
      "Subfield": "111601 วิศวกรรมโทรคมนาคม (Telecommunication Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 140,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1116 วิศวกรรมโทรคมนาคมและการสื่อสาร (Telecommunication and Communication Engineering)",
      "Subfield": "111602 วิศวกรรมการสื่อสาร (Communication Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 141,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1117 วิศวกรรมมาตรวิทยา (Metrology Engineering)",
      "Subfield": "111701 วิศวกรรมเครื่องมือวัด (Instrumentation Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 142,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1117 วิศวกรรมมาตรวิทยา (Metrology Engineering)",
      "Subfield": "111702 วิศวกรรมควบคุมอัตโนมัติ (Automation Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 143,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1117 วิศวกรรมมาตรวิทยา (Metrology Engineering)",
      "Subfield": "111703 วิศวกรรมเครื่องมือ (Tool Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 144,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1117 วิศวกรรมมาตรวิทยา (Metrology Engineering)",
      "Subfield": "111704 วิศวกรรมควบคุมและเครื่องมือวัด (Control and Instrumentation Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 145,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1117 วิศวกรรมมาตรวิทยา (Metrology Engineering)",
      "Subfield": "111705 วิศวกรรมแมคคาทรอนิกส์ (Mechatronics Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 146,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1118 วิศวกรรมเกษตรและจักรกลเกษตร (Agricultural and Agro - Industry Engineering)",
      "Subfield": "111801 วิศวกรรมเกษตร (Agricultural Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 147,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1118 วิศวกรรมเกษตรและจักรกลเกษตร (Agricultural and Agro - Industry Engineering)",
      "Subfield": "111802 วิศวกรรมเครื่องจักรกลเกษตร (Agricultural Machinery Enginee ring)",
      "Branch": "-"
    },
    {
      "rowNum": 148,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1118 วิศวกรรมเกษตรและจักรกลเกษตร (Agricultural and Agro - Industry Engineering)",
      "Subfield": "111803 วิศวกรรมหลังการเก็บเกี่ยวและแปรสภาพ (Post - Harvest and Processing Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 149,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1119 วิศวกรรมอาหาร (Food Engineering)",
      "Subfield": "111901 วิศวกรรมเกษตรและอาหาร (Agricultural and Food Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 150,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1120 วิศวกรรมวัสดุ (Materials Engine ering)",
      "Subfield": "112001 วิศวกรรมวัสดุและกระบวนการผลิต (Materials and Process Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 151,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1120 วิศวกรรมวัสดุ (Materials Engine ering)",
      "Subfield": "112002 วิศวกรรมขนถ่ายวัสดุ (Materials Handling Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 152,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1120 วิศวกรรมวัสดุ (Materials Engine ering)",
      "Subfield": "112003 วิศวกรรมโลหการ (Metallurgical Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 153,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1120 วิศวกรรมวัสดุ (Materials Engine ering)",
      "Subfield": "112004 วิศวกรรมพอลิเมอร์ (Polymer Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 154,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1120 วิศวกรรมวัสดุ (Materials Engine ering)",
      "Subfield": "112005 วิศวกรรมเซรามิก (Ceramic Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 155,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1121 วิศวกรรมสิ่งทอ (Textile Engineering)",
      "Subfield": "112101 วิศวกรรมเส้นใย (Fiber Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 156,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1122 วิศวกรรมชีวสารสนเทศ (Bio-informatics Engineering)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 157,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1123 วิศวกรรมพลังงาน (Energy Engineering)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 158,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1124 วิศวกรรมนิวเคลียร์ (Nuclear Engineering)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 159,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1125 วิศวกรรมหุ่นยนต์ (Robotics Engineering) หรือ วิทยาการหุ่นยนต์ (Robotics Engineering)",
      "Subfield": "112501 หุ่นยนต์ (Robotics)",
      "Branch": "-"
    },
    {
      "rowNum": 160,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1125 วิศวกรรมหุ่นยนต์ (Robotics Engineering) หรือ วิทยาการหุ่นยนต์ (Robotics Engineering)",
      "Subfield": "112502 หุ่นยนต์ทางการแพทย์ (Medical Robotics)",
      "Branch": "-"
    },
    {
      "rowNum": 161,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1125 วิศวกรรมหุ่นยนต์ (Robotics Engineering) หรือ วิทยาการหุ่นยนต์ (Robotics Engineering)",
      "Subfield": "112503 ระบบอัตโนมัติ (Automation)",
      "Branch": "-"
    },
    {
      "rowNum": 162,
      "Group": "วิศวกรรมศาสตร์",
      "Field": "1126 วิศวกรรมระบบควบคุมและเครื่องมือวัด (Control Systems and Instrumentation Engineering)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 163,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1501 สถาปัตยกรรมศาสตร์ (Architecture)",
      "Subfield": "150101 สถาปัตยกรรม (Architecture)",
      "Branch": "-"
    },
    {
      "rowNum": 164,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1501 สถาปัตยกรรมศาสตร์ (Architecture)",
      "Subfield": "150102 สถาปัตยกรรมไทย (Thai Architecture)",
      "Branch": "-"
    },
    {
      "rowNum": 165,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1501 สถาปัตยกรรมศาสตร์ (Architecture)",
      "Subfield": "150103 สถาปัตยกรรมภายใน (Interior Architecture)",
      "Branch": "-"
    },
    {
      "rowNum": 166,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1501 สถาปัตยกรรมศาสตร์ (Architecture)",
      "Subfield": "150104 ภูมิสถาปัตยกรรม (Landscape Architecture)",
      "Branch": "-"
    },
    {
      "rowNum": 167,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1501 สถาปัตยกรรมศาสตร์ (Architecture)",
      "Subfield": "150105 สถาปัตยกรรมผังเมือง (Urban Architecture)",
      "Branch": "-"
    },
    {
      "rowNum": 168,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1501 สถาปัตยกรรมศาสตร์ (Architecture)",
      "Subfield": "150106 เคหการ (Housing Development)",
      "Branch": "-"
    },
    {
      "rowNum": 169,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1502 การออกแบบ (Design)",
      "Subfield": "150201 การออกแบบนิเทศศิลป์ (Communication Design)",
      "Branch": "-"
    },
    {
      "rowNum": 170,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1502 การออกแบบ (Design)",
      "Subfield": "150202 การออกแบบอุตสาหกรรม (Industrial Design)",
      "Branch": "-"
    },
    {
      "rowNum": 171,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1503 การผังเมือง (Urban Planning)",
      "Subfield": "150301 การออกแบบชุมชนเมือง (Urban Design)",
      "Branch": "-"
    },
    {
      "rowNum": 172,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1503 การผังเมือง (Urban Planning)",
      "Subfield": "150302 นครศึกษา (Urban Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 173,
      "Group": "สถาปัตยกรรมศาสตร์",
      "Field": "1503 การผังเมือง (Urban Planning)",
      "Subfield": "150303 ภูมิภาคศึกษา (Regional Studies) (หมายถึง ภูมิภาคภายในประเทศ)",
      "Branch": "-"
    },
    {
      "rowNum": 174,
      "Group": "เทคโนโลยี",
      "Field": "1801 เทคโนโลยีชีวภาพ (Biotechnology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 175,
      "Group": "เทคโนโลยี",
      "Field": "1802 สิ่งแวดล้อมสร้างสรรค์และเทคโนโลยี (Built Environment and Technology)",
      "Subfield": "180201 สิ่งแวดล้อมสร้างสรรค์ (Built Environment)",
      "Branch": "-"
    },
    {
      "rowNum": 176,
      "Group": "เทคโนโลยี",
      "Field": "1802 สิ่งแวดล้อมสร้างสรรค์และเทคโนโลยี (Built Environment and Technology)",
      "Subfield": "180202 เทคโนโลยีอาคาร (Building Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 177,
      "Group": "เทคโนโลยี",
      "Field": "1803 เทคโนโลยีพลังงาน (Energy Technology)",
      "Subfield": "180301 เทคโนโลยีอุณหภาพ (Thermal Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 178,
      "Group": "เทคโนโลยี",
      "Field": "1803 เทคโนโลยีพลังงาน (Energy Technology)",
      "Subfield": "180302 การจัดการพลังงาน (Energy Management)",
      "Branch": "-"
    },
    {
      "rowNum": 179,
      "Group": "เทคโนโลยี",
      "Field": "1803 เทคโนโลยีพลังงาน (Energy Technology)",
      "Subfield": "180303 พลังงานทดแทน (Renewable Energy)",
      "Branch": "-"
    },
    {
      "rowNum": 180,
      "Group": "เทคโนโลยี",
      "Field": "1804 เทคโนโลยีสิ่งแวดล้อม (Environmental Technology)",
      "Subfield": "180401 เทคโนโลยีการจัดการมลพิษ (Pollution Management Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 181,
      "Group": "เทคโนโลยี",
      "Field": "1804 เทคโนโลยีสิ่งแวดล้อม (Environmental Technology)",
      "Subfield": "180402 การจัดการสิ่งแวดล้อมและภัยพิบัติ (Environmental and Disaster Management)",
      "Branch": "-"
    },
    {
      "rowNum": 182,
      "Group": "เทคโนโลยี",
      "Field": "1804 เทคโนโลยีสิ่งแวดล้อม (Environmental Technology)",
      "Subfield": "180403 วิศวกรรมสุขาภิบาล (Sanitary Engineering)",
      "Branch": "-"
    },
    {
      "rowNum": 183,
      "Group": "เทคโนโลยี",
      "Field": "1804 เทคโนโลยีสิ่งแวดล้อม (Environmental Technology)",
      "Subfield": "180404 เทคโนโลยีสะอาด (Clean Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 184,
      "Group": "เทคโนโลยี",
      "Field": "1805 นิเวศวิทยา (Ecological science)",
      "Subfield": "180501 ระบบนิเวศ (Ecosystem)",
      "Branch": "-"
    },
    {
      "rowNum": 185,
      "Group": "เทคโนโลยี",
      "Field": "1806 เทคโนโลยีสารสนเทศ (Information Technology)",
      "Subfield": "180601 สารสนเทศและการสื่อสาร (Information and Communication)",
      "Branch": "-"
    },
    {
      "rowNum": 186,
      "Group": "เทคโนโลยี",
      "Field": "1806 เทคโนโลยีสารสนเทศ (Information Technology)",
      "Subfield": "180602 โทรคมนาคมและเครือข่ายคอมพิวเตอร์ (Telecommunication and Computer Network)",
      "Branch": "-"
    },
    {
      "rowNum": 187,
      "Group": "เทคโนโลยี",
      "Field": "1806 เทคโนโลยีสารสนเทศ (Information Technology)",
      "Subfield": "180603 วิทยาการคอมพิวเตอร์ (Computer Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 188,
      "Group": "เทคโนโลยี",
      "Field": "1806 เทคโนโลยีสารสนเทศ (Information Technology)",
      "Subfield": "180604 การพัฒนาซอฟต์แวร์ (Software Development) หรือ การพัฒนาระบบ (System Development)",
      "Branch": "-"
    },
    {
      "rowNum": 189,
      "Group": "เทคโนโลยี",
      "Field": "1806 เทคโนโลยีสารสนเทศ (Information Technology)",
      "Subfield": "180605 วิทยาการข้อมูล (Data Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 190,
      "Group": "เทคโนโลยี",
      "Field": "1806 เทคโนโลยีสารสนเทศ (Information Technology)",
      "Subfield": "180606 ปฏิสัมพันธ์ระหว่างมนุษย์และคอมพิวเตอร์ (Human-Computer Interaction)",
      "Branch": "-"
    },
    {
      "rowNum": 191,
      "Group": "เทคโนโลยี",
      "Field": "1806 เทคโนโลยีสารสนเทศ (Information Technology)",
      "Subfield": "180607 ระบบสารสนเทศ (Information System)",
      "Branch": "-"
    },
    {
      "rowNum": 192,
      "Group": "เทคโนโลยี",
      "Field": "1806 เทคโนโลยีสารสนเทศ (Information Technology)",
      "Subfield": "180608 ความมั่นคงของระบบคอมพิวเตอร์ (Computer Security)",
      "Branch": "-"
    },
    {
      "rowNum": 193,
      "Group": "เทคโนโลยี",
      "Field": "1807 เทคโนโลยีการจัดการ (Management Technology)",
      "Subfield": "180701 โลจิสติกส์ (Logistics)",
      "Branch": "-"
    },
    {
      "rowNum": 194,
      "Group": "เทคโนโลยี",
      "Field": "1807 เทคโนโลยีการจัดการ (Management Technology)",
      "Subfield": "180702 การจัดการและโลจิสติกส์ (Management and Logistics)",
      "Branch": "-"
    },
    {
      "rowNum": 195,
      "Group": "เทคโนโลยี",
      "Field": "1807 เทคโนโลยีการจัดการ (Management Technology)",
      "Subfield": "180703 เทคโนโลยีการจัดการนวัตกรรม (Innovation Management Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 196,
      "Group": "เทคโนโลยี",
      "Field": "1808 เทคโนโลยีวัสดุ (Materials Technology)",
      "Subfield": "180801 โลหการและวัสดุ (Metallurgical and Materials)",
      "Branch": "-"
    },
    {
      "rowNum": 197,
      "Group": "เทคโนโลยี",
      "Field": "1808 เทคโนโลยีวัสดุ (Materials Technology)",
      "Subfield": "180802 เทคโนโลยีพลาสติก (Plastic Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 198,
      "Group": "เทคโนโลยี",
      "Field": "1808 เทคโนโลยีวัสดุ (Materials Technology)",
      "Subfield": "180803 เทคโนโลยีเซรามิกส์ (Ceramics Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 199,
      "Group": "เทคโนโลยี",
      "Field": "1808 เทคโนโลยีวัสดุ (Materials Technology)",
      "Subfield": "180804 เหมืองแร่และธรณีวิทยาเหมืองแร่ (Mine and Mining Geology)",
      "Branch": "-"
    },
    {
      "rowNum": 200,
      "Group": "เทคโนโลยี",
      "Field": "1809 วิทยาศาสตร์และเทคโนโลยีอาหาร (Food Sciences and Technology)",
      "Subfield": "180901 วิทยาศาสตร์การอาหาร (Food Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 201,
      "Group": "เทคโนโลยี",
      "Field": "1809 วิทยาศาสตร์และเทคโนโลยีอาหาร (Food Sciences and Technology)",
      "Subfield": "180902 เทคโนโลยีอาหาร (Food Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 202,
      "Group": "เทคโนโลยี",
      "Field": "1809 วิทยาศาสตร์และเทคโนโลยีอาหาร (Food Sciences and Technology)",
      "Subfield": "180903 การพัฒนาผลิตภัณฑ์อาหาร (Food Product Development)",
      "Branch": "-"
    },
    {
      "rowNum": 203,
      "Group": "เทคโนโลยี",
      "Field": "1809 วิทยาศาสตร์และเทคโนโลยีอาหาร (Food Sciences and Technology)",
      "Subfield": "180904 ความปลอดภัยทางอาหาร (Food Safety)",
      "Branch": "-"
    },
    {
      "rowNum": 204,
      "Group": "เทคโนโลยี",
      "Field": "1810 เทคโนโลยีบรรจุภัณฑ์ (Packaging Technology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 205,
      "Group": "เทคโนโลยี",
      "Field": "1811 นาโนเทคโนโลยี (Nano Technology)",
      "Subfield": "181101 วิทยาศาสตร์นาโน (Nanos cience)",
      "Branch": "-"
    },
    {
      "rowNum": 206,
      "Group": "เทคโนโลยี",
      "Field": "1812 เทคโนโลยีทางภาพและการพิมพ์ (Imaging and Printing Technology)",
      "Subfield": "181201 เทคโนโลยีการพิมพ์ (Printing Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 207,
      "Group": "เทคโนโลยี",
      "Field": "1813 เทคโนโลยีปิโตรเลียมและปิโตรเคมี (Petroleum and Petrochemical Technology)",
      "Subfield": "181301 เทคโนโลยีปิโตรเลียม (Petroleum Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 208,
      "Group": "เทคโนโลยี",
      "Field": "1813 เทคโนโลยีปิโตรเลียมและปิโตรเคมี (Petroleum and Petrochemical Technology)",
      "Subfield": "181302 เทคโนโลยีปิโตรเคมี (Petrochemical Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 209,
      "Group": "เทคโนโลยี",
      "Field": "1814 เทคโนโลยีอุตสาหกรรมเกษตร (Agro-Industry Technology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 210,
      "Group": "เทคโนโลยี",
      "Field": "1815 เทคโนโลยีนิวเคลียร์ (Nuclear Technology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 211,
      "Group": "เทคโนโลยี",
      "Field": "1816 เทคโนโลยีอุตสาหกรรม (Industrial Technology)",
      "Subfield": "181601 เทคโนโลยีไฟฟ้า (Electrical Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 212,
      "Group": "เทคโนโลยี",
      "Field": "1816 เทคโนโลยีอุตสาหกรรม (Industrial Technology)",
      "Subfield": "181602 เทคโนโลยีก่อสร้าง (Construction Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 213,
      "Group": "เทคโนโลยี",
      "Field": "1816 เทคโนโลยีอุตสาหกรรม (Industrial Technology)",
      "Subfield": "181603 คอมพิวเตอร์อุตสาหกรรม (Industrial Computer)",
      "Branch": "-"
    },
    {
      "rowNum": 214,
      "Group": "เทคโนโลยี",
      "Field": "1816 เทคโนโลยีอุตสาหกรรม (Industrial Technology)",
      "Subfield": "181604 การออกแบบผลิตภัณฑ์อุตสาหกรรม (Industrial Product Design)",
      "Branch": "-"
    },
    {
      "rowNum": 215,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2101 กายวิภาคศาสตร์ (Anatomy)",
      "Subfield": "210101 วิทยาฮีสโต (Histology)",
      "Branch": "-"
    },
    {
      "rowNum": 216,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2101 กายวิภาคศาสตร์ (Anatomy)",
      "Subfield": "210102 มหกายวิภาคศาสตร์ (Gross Anatomy)",
      "Branch": "-"
    },
    {
      "rowNum": 217,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2102 จุลชีววิทยา (Microbiology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 218,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2103 ชีววิทยาโมเลกุล หรือ อณูชีววิทยา (Molecular Biology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 219,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2104 ประสาทวิทยาศาสตร์ (Neuroscience)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 220,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2105 ปรสิตวิทยา (Parasitology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 221,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2106 พยาธิวิทยา (Pathology)",
      "Subfield": "210601 พยาธิวิทยากายวิภาค (Anatomical Pathology)",
      "Branch": "-"
    },
    {
      "rowNum": 222,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2107 พยาธิวิทยาคลินิก (Clinical Pathology)",
      "Subfield": "210701 เวชศาสตร์การธนาคารเลือด (Transfusion Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 223,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2108 พิษวิทยา (Toxicology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 224,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2109 พันธุเวชศาสตร์ (Medical Genetics)",
      "Subfield": "210901 พันธุศาสตร์ หรือ พันธุกรรมศาสตร์ (Genetics)",
      "Branch": "-"
    },
    {
      "rowNum": 225,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2110 ภูมิคุ้มกันวิทยา (Immunology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 226,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2111 ระบาดวิทยา (Epidemiology)",
      "Subfield": "211101 ระบาดวิทยาคลินิก (Clinical Epidemiology)",
      "Branch": "-"
    },
    {
      "rowNum": 227,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2112 วิทยาเอมบริโอ (Embryology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 228,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2113 เวชศาสตร์ครอบครัว (Family Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 229,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2114 เวชศาสตร์ชุมชน (Community Medicine)",
      "Subfield": "211401 อนามัยสิ่งแวดล้อม (Environmental Health)",
      "Branch": "-"
    },
    {
      "rowNum": 230,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2114 เวชศาสตร์ชุมชน (Community Medicine)",
      "Subfield": "211402 สาธารณสุขชุมชน (Community - Public Health)",
      "Branch": "-"
    },
    {
      "rowNum": 231,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2115 เวชศาสตร์ป้องกันคลินิก (Clinical Preventive Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 232,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2116 ไวรัสวิทยา (Virology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 233,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2117 สรีรวิทยา (Physiology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 234,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2118 อาชีวเวชศาสตร์ (Occupational Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 235,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2119 ชีวเคมี (Biochemistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 236,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2120 เภสัชวิทยา (Pharmacology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 237,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2131 อายุรศาสตร์ (Internal Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 238,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2132 อายุรศาสตร์โรคหัวใจ (Cardiology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 239,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2133 อายุรศาสตร์โรคระบบทางเดินอาหาร (Gastrointestinal Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 240,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2134 อายุรศาสตร์โรคไต หรือ วักกะวิทยา (Nephrology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 241,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2135 อายุรศาสตร์โรคติดเชื้อ (Infectious Diseases)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 242,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2136 ประสาทวิทยา (Neurology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 243,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2137 โลหิตวิทยา (Hematology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 244,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2138 โรคต่อมไร้ท่อและเมตาบอลิสม (Endocrinology and Metabolism)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 245,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2139 อายุรศาสตร์โรคมะเร็ง หรือ มะเร็งวิทยา (Oncology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 246,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2140 ตจวิทยา (Dermatology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 247,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2141 โรคระบบการหายใจ (Pulmonology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 248,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2142 โรคข้อและรูมาติสซั่ม (Rheumatology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 249,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2143 โรคภูมิแพ้และภูมิคุ้มกันทางคลินิก (Allergy and Clinical Immunology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 250,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2144 เวชพันธุศาสตร์ (Medical Genetics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 251,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2145 เวชศาสตร์ผู้สูงอายุ (Geriatrics)",
      "Subfield": "214501 เวชศาสตร์ชะลอวัยและฟื้นฟูสภาพ (Anti-aging Regenerative Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 252,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2151 ศัลยศาสตร์ (Surgery) หรือ ศัลยศาสตร์ทั่วไป (General Surgery)",
      "Subfield": "215101 ศัลยศาสตร์ศีรษะ คอ และเต้านม (Head, Neck and Breast Surgery)",
      "Branch": "-"
    },
    {
      "rowNum": 253,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2151 ศัลยศาสตร์ (Surgery) หรือ ศัลยศาสตร์ทั่วไป (General Surgery)",
      "Subfield": "215102 ศัลยศาสตร์โรคตับและทางเดินน้ำดี (Hepatobiliary Surgery)",
      "Branch": "-"
    },
    {
      "rowNum": 254,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2151 ศัลยศาสตร์ (Surgery) หรือ ศัลยศาสตร์ทั่วไป (General Surgery)",
      "Subfield": "215103 ศัลยศาสตร์มะเร็งวิทยา (Surgical Oncology)",
      "Branch": "-"
    },
    {
      "rowNum": 255,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2151 ศัลยศาสตร์ (Surgery) หรือ ศัลยศาสตร์ทั่วไป (General Surgery)",
      "Subfield": "215104 ศัลยศาสตร์อุบัติเหตุ (Trauma Surgery)",
      "Branch": "-"
    },
    {
      "rowNum": 256,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2151 ศัลยศาสตร์ (Surgery) หรือ ศัลยศาสตร์ทั่วไป (General Surgery)",
      "Subfield": "215105 ศัลยศาสตร์ปลูกถ่ายอวัยวะ (Transplant surgery)",
      "Branch": "-"
    },
    {
      "rowNum": 257,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2152 กุมารศัลยศาสตร์ (Pediatric Surgery)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 258,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2153 ประสาทศัลยศาสตร์ (Neurological Surgery)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 259,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2154 ศัลยศาสตร์ตกแต่ง (Plastic and Reconstructive Surgery)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 260,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2155 ศัลยศาสตร์ทรวงอกและหัวใจ (Cardiovascular and Thoracic Surgery)",
      "Subfield": "215501 ศัลยศาสตร์ทรวงอก (Thoracic Surgery)",
      "Branch": "-"
    },
    {
      "rowNum": 261,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2155 ศัลยศาสตร์ทรวงอกและหัวใจ (Cardiovascular and Thoracic Surgery)",
      "Subfield": "215502 ศัลยศาสตร์หัวใจและหลอดเลือด (Card iovascular Surgery)",
      "Branch": "-"
    },
    {
      "rowNum": 262,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2156 ศัลยศาสตร์ยูโร (Urology)",
      "Subfield": "215601 ศัลยศาสตร์ระบบทางเดินปัสสาวะ",
      "Branch": "-"
    },
    {
      "rowNum": 263,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2157 ศัลยศาสตร์ลำไส้ใหญ่และทวารหนัก (Colorectal Surgery)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 264,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2158 ศัลยศาสตร์หลอดเลือด (Vascular Surgery)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 265,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2166 ออร์โธปิดิกส์ (Orthopedics) หรือ ศัลยศาสตร์ออร์โธปิดิกส์ (Orthopedics Surgery)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 266,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2167 เวชศาสตร์การกีฬา (Sports Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 267,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2168 เวชศาสตร์ฟื้นฟู (Rehabilitation Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 268,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2171 สูติศาสตร์-นรีเวชวิทยา (Obstetrics and Gynecology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 269,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2172 มะเร็งนรีเวชวิทยา (Gynecologic Oncology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 270,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2173 เวชศาสตร์การเจริญพันธุ์ (Reproductive Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 271,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2174 เวชศาสตร์มารดาและทารกในครรภ์ (Maternal and Fetal Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 272,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2176 รังสีวินิจฉัย (Diagnostic Radiology)",
      "Subfield": "217601 รังสีวิทยาวินิจฉัย",
      "Branch": "-"
    },
    {
      "rowNum": 273,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2177 รังสีรักษาและเวชศาสตร์นิวเคลียร์ (Therapeutic Radiology and Nuclear Medicine)",
      "Subfield": "217701 รังสีรักษา (Radiotherapy)",
      "Branch": "-"
    },
    {
      "rowNum": 274,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2177 รังสีรักษาและเวชศาสตร์นิวเคลียร์ (Therapeutic Radiology and Nuclear Medicine)",
      "Subfield": "217702 เวชศาสตร์นิวเคลียร์ (Nuclear Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 275,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2178 รังสีร่วมรักษา (Interventional Radiology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 276,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2181 กุมารเวชศาสตร์ (Pediatrics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 277,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2186 จิตเวชศาสตร์ (Psychiatry)",
      "Subfield": "218601 จิตเวชศาสตร์เด็กและวัยรุ่น (Child and Adolescent Psychiatry)",
      "Branch": "-"
    },
    {
      "rowNum": 278,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2187 จักษุวิทยา (Ophthalmology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 279,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2188 นิติเวชศาสตร์ (Forensic Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 280,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2189 วิสัญญีวิทยา (Anesthesiology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 281,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2190 โสต ศอ นาสิก ลาริงซ์วิทยา (Ear Nose Throat and Laryngology)",
      "Subfield": "219001 โสต ศอ นาสิก",
      "Branch": "-"
    },
    {
      "rowNum": 282,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2190 โสต ศอ นาสิก ลาริงซ์วิทยา (Ear Nose Throat and Laryngology)",
      "Subfield": "219002 โสต นาสิก ลาริงซ์วิทยา",
      "Branch": "-"
    },
    {
      "rowNum": 283,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2191 โภชนศาสตร์ (Nutrition)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 284,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2195 เวชศาสตร์ฉุกเฉิน (Emergency Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 285,
      "Group": "แพทยศาสตร์และวิทยาศาสตร์การแพทย์",
      "Field": "2196 เวชบำบัดวิกฤต (Critical Care Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 286,
      "Group": "การแพทย์อื่น",
      "Field": "2501 แพทย์แผนไทย (Thai Traditional Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 287,
      "Group": "การแพทย์อื่น",
      "Field": "2502 แพทย์แผนไทยประยุกต์ (Applied Thai Traditional Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 288,
      "Group": "การแพทย์อื่น",
      "Field": "2503 แพทย์แผนจีน (Chinese Traditional Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 289,
      "Group": "การแพทย์อื่น",
      "Field": "2504 แพทย์แผนตะวันออก (Eastern Traditional Medicine)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 290,
      "Group": "การแพทย์อื่น",
      "Field": "2511 วิทยาศาสตร์การกีฬา (Sport Science)",
      "Subfield": "251101 สุขศึกษา (Health Education)",
      "Branch": "-"
    },
    {
      "rowNum": 291,
      "Group": "การแพทย์อื่น",
      "Field": "2511 วิทยาศาสตร์การกีฬา (Sport Science)",
      "Subfield": "251102 พลศึกษา (Physical Education)",
      "Branch": "-"
    },
    {
      "rowNum": 292,
      "Group": "การแพทย์อื่น",
      "Field": "2511 วิทยาศาสตร์การกีฬา (Sport Science)",
      "Subfield": "251103 นันทนาการ (Recreation)",
      "Branch": "-"
    },
    {
      "rowNum": 293,
      "Group": "การแพทย์อื่น",
      "Field": "2512 ชีวสารสนเทศ (Bioinformatics)",
      "Subfield": "251201 เวชสารสนเทศ (Medical Informatics)",
      "Branch": "-"
    },
    {
      "rowNum": 294,
      "Group": "การแพทย์อื่น",
      "Field": "2512 ชีวสารสนเทศ (Bioinformatics)",
      "Subfield": "251202 ชีวเวชสารสนเทศ (Biomedical Informatics)",
      "Branch": "-"
    },
    {
      "rowNum": 295,
      "Group": "การแพทย์อื่น",
      "Field": "2513 ทัศนมาตรศาสตร์ (Optometry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 296,
      "Group": "การแพทย์อื่น",
      "Field": "2514 สารสนเทศสุขภาพ (Health Informatics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 297,
      "Group": "การแพทย์อื่น",
      "Field": "2520 แพทยศาสตรศึกษา (Medical Education)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 298,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3101 ชีววิทยาช่องปาก (Oral Biology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 299,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3102 เวชศาสตร์ช่องปาก (Oral Medicine)",
      "Subfield": "310201 ทันตเวชศาสตร์การนอน (Dental Sleep Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 300,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3103 ปริทันตวิทยา (Periodontology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 301,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3104 ศัลยศาสตร์ช่องปากและแม็กซิลโลเฟเชียล (Oral and Maxillofacial Surgery)",
      "Subfield": "310401 ทันตกรรมรากเทียม (Dental Implantology)",
      "Branch": "-"
    },
    {
      "rowNum": 302,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3104 ศัลยศาสตร์ช่องปากและแม็กซิลโลเฟเชียล (Oral and Maxillofacial Surgery)",
      "Subfield": "310402 เลเซอร์วิทยาทางทันตแพทยศาสตร์ (Lasers in Dentistry)",
      "Branch": "-"
    },
    {
      "rowNum": 303,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3105 พยาธิวิทยาช่องปาก (Oral Pathology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 304,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3106 ทันตวัสดุศาสตร์ (Dental Material Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 305,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3107 รังสีวิทยาช่องปากและแม็กซิลโลเฟเชียล (Oral and Maxillofacial Radiology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 306,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3108 ทันตกรรมสำหรับเด็ก (Pediatric Dentistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 307,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3109 ทันตกรรมจัดฟัน (Orthodontics)",
      "Subfield": "310901 ทันตเวชศาสตร์การนอน (Dental Sleep Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 308,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3110 ทันตกรรมบดเคี้ยวและความเจ็บปวดใบหน้า (Occlusion and Orofacial Pain)",
      "Subfield": "311001 ทันตกรรมบดเคี้ยวและความเจ็บปวดช่องปากใบหน้า (Occlusion and Orofacial Pain)",
      "Branch": "-"
    },
    {
      "rowNum": 309,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3110 ทันตกรรมบดเคี้ยวและความเจ็บปวดใบหน้า (Occlusion and Orofacial Pain)",
      "Subfield": "311002 ทันตเวชศาสตร์การนอน (Dental Sleep Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 310,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3111 ทันตกรรมประดิษฐ์ (Prosthodontics)",
      "Subfield": "311101 ทันตกรรมรากเทียม (Dental Implantology)",
      "Branch": "-"
    },
    {
      "rowNum": 311,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3111 ทันตกรรมประดิษฐ์ (Prosthodontics)",
      "Subfield": "311102 การประดิษฐ์ใบหน้าขากรรไกร (Maxillofacial Prosthetics)",
      "Branch": "-"
    },
    {
      "rowNum": 312,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3111 ทันตกรรมประดิษฐ์ (Prosthodontics)",
      "Subfield": "311103 ทันตกรรมสวยงาม (Esthetic Dentistry)",
      "Branch": "-"
    },
    {
      "rowNum": 313,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3112 ทันตกรรมหัตถการ (Operative Dentistry)",
      "Subfield": "311201 ทันตกรรมสวยงาม (Esthetic Dentistry)",
      "Branch": "-"
    },
    {
      "rowNum": 314,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3113 วิทยาเอ็นโดดอนต์ (Endo dontics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 315,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3114 ทันตสาธารณสุข (Dental Public Health)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 316,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3115 ทันตกรรมทั่วไป (General Dentistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 317,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3116 ทันตแพทยศาสตร์ศึกษา (Dental Education)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 318,
      "Group": "ทันตแพทยศาสตร์",
      "Field": "3117 นิติทันตวิทยา (Forensic Odontology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 319,
      "Group": "เภสัชศาสตร์",
      "Field": "3301 เภสัชวิทยา (Pharmacology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 320,
      "Group": "เภสัชศาสตร์",
      "Field": "3302 เภสัชศาสตร์และเทคโนโลยี (Pharmaceutical Sciences and Technology)",
      "Subfield": "330201 เภสัชกรรม หรือ เภสัชการ (Pharmaceutics)",
      "Branch": "-"
    },
    {
      "rowNum": 321,
      "Group": "เภสัชศาสตร์",
      "Field": "3302 เภสัชศาสตร์และเทคโนโลยี (Pharmaceutical Sciences and Technology)",
      "Subfield": "330202 เภสัชอุตสาหกรรม (Industrial Pharmacy)",
      "Branch": "-"
    },
    {
      "rowNum": 322,
      "Group": "เภสัชศาสตร์",
      "Field": "3302 เภสัชศาสตร์และเทคโนโลยี (Pharmaceutical Sciences and Technology)",
      "Subfield": "330203 เภสัชเคมี (Pharmaceutical Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 323,
      "Group": "เภสัชศาสตร์",
      "Field": "3302 เภสัชศาสตร์และเทคโนโลยี (Pharmaceutical Sciences and Technology)",
      "Subfield": "330204 เภสัชเวท หรือ เภสัชวินิจฉัย (Pharmacognosy)",
      "Branch": "-"
    },
    {
      "rowNum": 324,
      "Group": "เภสัชศาสตร์",
      "Field": "3302 เภสัชศาสตร์และเทคโนโลยี (Pharmaceutical Sciences and Technology)",
      "Subfield": "330205 เภสัชพฤกษศาสตร์ (Pharmaceutical Botany)",
      "Branch": "-"
    },
    {
      "rowNum": 325,
      "Group": "เภสัชศาสตร์",
      "Field": "3302 เภสัชศาสตร์และเทคโนโลยี (Pharmaceutical Sciences and Technology)",
      "Subfield": "330206 อาหารเคมี (Food Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 326,
      "Group": "เภสัชศาสตร์",
      "Field": "3302 เภสัชศาสตร์และเทคโนโลยี (Pharmaceutical Sciences and Technology)",
      "Subfield": "330207 เภสัชศาสตร์ชีวภาพ (Biopharmaceutical Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 327,
      "Group": "เภสัชศาสตร์",
      "Field": "3303 เภสัชกรรมคลินิก (Clinical Pharmacy)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 328,
      "Group": "เภสัชศาสตร์",
      "Field": "3304 เภสัชศาสตร์สังคมและการบริหาร (Social and Administrative Pharmacy)",
      "Subfield": "330401 เภสัชศาสตร์สังคม (Social Pharmacy)",
      "Branch": "-"
    },
    {
      "rowNum": 329,
      "Group": "เภสัชศาสตร์",
      "Field": "3304 เภสัชศาสตร์สังคมและการบริหาร (Social and Administrative Pharmacy)",
      "Subfield": "330402 บริหารเภสัชกิจ (Administrative Pharmacy)",
      "Branch": "-"
    },
    {
      "rowNum": 330,
      "Group": "เภสัชศาสตร์",
      "Field": "3304 เภสัชศาสตร์สังคมและการบริหาร (Social and Administrative Pharmacy)",
      "Subfield": "330403 เภสัชเศรษฐศาสตร์ (Pharmaco-economics)",
      "Branch": "-"
    },
    {
      "rowNum": 331,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3501 สาธารณสุขศาสตร์ (Public Health)",
      "Subfield": "350101 การพยาบาลสาธารณสุข (Public Health Nursing)",
      "Branch": "-"
    },
    {
      "rowNum": 332,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3501 สาธารณสุขศาสตร์ (Public Health)",
      "Subfield": "350102 บริหารงานสาธารณสุข (Public Health Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 333,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3501 สาธารณสุขศาสตร์ (Public Health)",
      "Subfield": "350103 ปรสิตวิทยา (Parasitology)",
      "Branch": "-"
    },
    {
      "rowNum": 334,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3501 สาธารณสุขศาสตร์ (Public Health)",
      "Subfield": "350104 วิทยาศาสตร์อนามัยสิ่งแวดล้อม (Environmental Health Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 335,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3501 สาธารณสุขศาสตร์ (Public Health)",
      "Subfield": "350105 การสื่อสารและส่งเสริมสุขภาพ (Health Communication and Promotion)",
      "Branch": "-"
    },
    {
      "rowNum": 336,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3501 สาธารณสุขศาสตร์ (Public Health)",
      "Subfield": "350106 อนามัยชุมชน (Community Health)",
      "Branch": "-"
    },
    {
      "rowNum": 337,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3502 เศรษฐศาสตร์สาธารณสุข (Health Economics)",
      "Subfield": "350201 ระบบสุขภาพและการบริหารจัดการ (Health System and Management)",
      "Branch": "-"
    },
    {
      "rowNum": 338,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3503 โภชนศาสตร์หรือโภชนาการ (Nutrition)",
      "Subfield": "350301 โภชนาการชุมชน (Community Nutrition)",
      "Branch": "-"
    },
    {
      "rowNum": 339,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3503 โภชนศาสตร์หรือโภชนาการ (Nutrition)",
      "Subfield": "350302 โภชนาการวัยเด็ก (Child Nutrition)",
      "Branch": "-"
    },
    {
      "rowNum": 340,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3503 โภชนศาสตร์หรือโภชนาการ (Nutrition)",
      "Subfield": "350303 โภชนาการผู้สูงอายุ (Old Age Nutrition)",
      "Branch": "-"
    },
    {
      "rowNum": 341,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3503 โภชนศาสตร์หรือโภชนาการ (Nutrition)",
      "Subfield": "350304 โภชนาการเชิงทดลองและชีวเคมี (Experiment Nutrition and Biochemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 342,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3504 อาชีวอนามัยและความปลอดภัย (Occupational Health and Safety)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 343,
      "Group": "สาธารณสุขศาสตร์",
      "Field": "3505 อนามัยสิ่งแวดล้อม (Environmental Health)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 344,
      "Group": "พยาบาลศาสตร์",
      "Field": "3701 พยาบาลศาสตร์ (Nursing)",
      "Subfield": "370101 การพยาบาลเด็กและวัยรุ่น (Children and Adolescent Nursing)",
      "Branch": "-"
    },
    {
      "rowNum": 345,
      "Group": "พยาบาลศาสตร์",
      "Field": "3701 พยาบาลศาสตร์ (Nursing)",
      "Subfield": "370102 การพยาบาลผู้ใหญ่และผู้สูงอายุ (Adult and Gerontological Nursing)",
      "Branch": "-"
    },
    {
      "rowNum": 346,
      "Group": "พยาบาลศาสตร์",
      "Field": "3701 พยาบาลศาสตร์ (Nursing)",
      "Subfield": "370103 การพยาบาลมารดา ทารก และการผดุงครรภ์ (Mother-Newborn Nursing and Midwifery)",
      "Branch": "-"
    },
    {
      "rowNum": 347,
      "Group": "พยาบาลศาสตร์",
      "Field": "3701 พยาบาลศาสตร์ (Nursing)",
      "Subfield": "370104 การพยาบาลสุขภาพชุมชน (Community Health Nursing)",
      "Branch": "-"
    },
    {
      "rowNum": 348,
      "Group": "พยาบาลศาสตร์",
      "Field": "3701 พยาบาลศาสตร์ (Nursing)",
      "Subfield": "370105 การพยาบาลจิตเวชและสุขภาพจิต (Psychiatric Nursing and Mental Health)",
      "Branch": "-"
    },
    {
      "rowNum": 349,
      "Group": "พยาบาลศาสตร์",
      "Field": "3701 พยาบาลศาสตร์ (Nursing)",
      "Subfield": "370106 การบริหารการพยาบาล (Nursing Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 350,
      "Group": "พยาบาลศาสตร์",
      "Field": "3702 พยาบาลศาสตร์ศึกษา (Nursing Education)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 351,
      "Group": "สหเวชศาสตร์ / เทคนิคการเเพทย์",
      "Field": "3901 เทคนิคการเเพทย์ (Medical Technology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 352,
      "Group": "สหเวชศาสตร์ / เทคนิคการเเพทย์",
      "Field": "3902 รังสีเทคนิค (Radiation Technology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 353,
      "Group": "สหเวชศาสตร์ / เทคนิคการเเพทย์",
      "Field": "3903 กายภาพบำบัด (Physical Therapy)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 354,
      "Group": "สหเวชศาสตร์ / เทคนิคการเเพทย์",
      "Field": "3904 เทคโนโลยีหัวใจและทรวงอก (Heart and Lung Technology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 355,
      "Group": "สหเวชศาสตร์ / เทคนิคการเเพทย์",
      "Field": "3905 กายอุปกรณ์ (Orthotics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 356,
      "Group": "สหเวชศาสตร์ / เทคนิคการเเพทย์",
      "Field": "3906 กิจกรรมบำบัด (Occupational Therapy)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 357,
      "Group": "สหเวชศาสตร์ / เทคนิคการเเพทย์",
      "Field": "3907 ความผิดปกติของการสื่อความหมาย (Communication Sciences and Disorders)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 358,
      "Group": "สหเวชศาสตร์ / เทคนิคการเเพทย์",
      "Field": "3908 วิทยาการฟื้นฟูสมรรถภาพคนพิการ (Rehabilitation Science for Disabilities)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 359,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4101 กายวิภาคศาสตร์ (Anatomy)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 360,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4102 สรีรวิทยา (Physiology)",
      "Subfield": "410201 พฤติกรรมสัตว์ (Animal Behavior)",
      "Branch": "-"
    },
    {
      "rowNum": 361,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4103 ชีวเคมี (Biochemistry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 362,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4104 ชีวเวชศาสตร์ (Biomedical Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 363,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4105 เภสัชวิทยา (Pharmacology)",
      "Subfield": "410501 พิษวิทยา (Toxicology)",
      "Branch": "-"
    },
    {
      "rowNum": 364,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4105 เภสัชวิทยา (Pharmacology)",
      "Subfield": "410502 เภสัชพันธุศาสตร์ (Pharmacogenomics)",
      "Branch": "-"
    },
    {
      "rowNum": 365,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4106 พยาธิชีววิทยา (Pathobiology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 366,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4107 พยาธิวิทยา (Pathology)",
      "Subfield": "410701 พยาธิวิทยาคลินิก (Clinical Pathology)",
      "Branch": "-"
    },
    {
      "rowNum": 367,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4107 พยาธิวิทยา (Pathology)",
      "Subfield": "410702 มะเร็งวิทยา (Oncology)",
      "Branch": "-"
    },
    {
      "rowNum": 368,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4107 พยาธิวิทยา (Pathology)",
      "Subfield": "410703 เภสัชพันธุศาสตร์ (Pharmacogenomics)",
      "Branch": "-"
    },
    {
      "rowNum": 369,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4108 จุลชีววิทยา (Microbiology)",
      "Subfield": "410801 แบคทีเรียวิทยา (Bacteriology)",
      "Branch": "-"
    },
    {
      "rowNum": 370,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4108 จุลชีววิทยา (Microbiology)",
      "Subfield": "410802 ไวรัสวิทยา (Virology)",
      "Branch": "-"
    },
    {
      "rowNum": 371,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4108 จุลชีววิทยา (Microbiology)",
      "Subfield": "410803 กิณวิทยา (Mycology)",
      "Branch": "-"
    },
    {
      "rowNum": 372,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4109 ปรสิตวิทยา (Parasitology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 373,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4110 ภูมิคุ้มกันวิทยา (Immunology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 374,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4121 เวชศาสตร์คลินิกทางสัตวแพทย์ (Veterinary Clinical Sciences)",
      "Subfield": "412101 เวชศาสตร์คลินิกฉุกเฉิน (Emergency Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 375,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4121 เวชศาสตร์คลินิกทางสัตวแพทย์ (Veterinary Clinical Sciences)",
      "Subfield": "412102 มะเร็งวิทยา (Oncology)",
      "Branch": "-"
    },
    {
      "rowNum": 376,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4121 เวชศาสตร์คลินิกทางสัตวแพทย์ (Veterinary Clinical Sciences)",
      "Subfield": "412103 ตจวิทยา (Dermatology)",
      "Branch": "-"
    },
    {
      "rowNum": 377,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4121 เวชศาสตร์คลินิกทางสัตวแพทย์ (Veterinary Clinical Sciences)",
      "Subfield": "412104 วักกะวิทยา (Nephrology)",
      "Branch": "-"
    },
    {
      "rowNum": 378,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4121 เวชศาสตร์คลินิกทางสัตวแพทย์ (Veterinary Clinical Sciences)",
      "Subfield": "412105 ประสาทวิทยา (Neurology)",
      "Branch": "-"
    },
    {
      "rowNum": 379,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4121 เวชศาสตร์คลินิกทางสัตวแพทย์ (Veterinary Clinical Sciences)",
      "Subfield": "412106 โรคต่อมไร้ท่อและเมตาบอลิสม (Endocrinology and Metabolism)",
      "Branch": "-"
    },
    {
      "rowNum": 380,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4121 เวชศาสตร์คลินิกทางสัตวแพทย์ (Veterinary Clinical Sciences)",
      "Subfield": "412107 จักษุวิทยา (Ophtalmology)",
      "Branch": "-"
    },
    {
      "rowNum": 381,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4121 เวชศาสตร์คลินิกทางสัตวแพทย์ (Veterinary Clinical Sciences)",
      "Subfield": "412108 หทัยวิทยา (Cardiology)",
      "Branch": "-"
    },
    {
      "rowNum": 382,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4122 อายุรศาสตร์ทางสัตวแพทย์ (Veterinary Medicine)",
      "Subfield": "412201 อายุรศาสตร์สัตว์เลี้ยงเป็นเพื่อน (Companion Animal Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 383,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4122 อายุรศาสตร์ทางสัตวแพทย์ (Veterinary Medicine)",
      "Subfield": "412202 อายุรศาสตร์สัตว์เลี้ยงเป็นอาหาร (Food Animal Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 384,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4122 อายุรศาสตร์ทางสัตวแพทย์ (Veterinary Medicine)",
      "Subfield": "412203 อายุรศาสตร์สัตว์ป่า สัตว์ต่างถิ่น และสัตว์สวนสัตว์ (Zoo, Exotics and Wildlife Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 385,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4122 อายุรศาสตร์ทางสัตวแพทย์ (Veterinary Medicine)",
      "Subfield": "412204 อายุรศาสตร์สัตว์น้ำ (Aquatic Animal Medicine)",
      "Branch": "-"
    },
    {
      "rowNum": 386,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4123 ศัลยศาสตร์ (Surgery)",
      "Subfield": "412301 วิสัญญีวิทยา (Anesthesiology)",
      "Branch": "-"
    },
    {
      "rowNum": 387,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4123 ศัลยศาสตร์ (Surgery)",
      "Subfield": "412302 ภาพวินิจฉัย (Diagnostic Imaging)",
      "Branch": "-"
    },
    {
      "rowNum": 388,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4124 วิทยาการสืบพันธุ์สัตว์ (Theriogenology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 389,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4125 สัตวแพทย์สาธารณสุข (Veterinary Public Health)",
      "Subfield": "412501 สุขศาสตร์การอาหารสัตว์ (Veterinary Food Hygiene)",
      "Branch": "-"
    },
    {
      "rowNum": 390,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4125 สัตวแพทย์สาธารณสุข (Veterinary Public Health)",
      "Subfield": "412502 ระบาดวิทยา (Epidemiology)",
      "Branch": "-"
    },
    {
      "rowNum": 391,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4126 สัตวแพทยศาสตร์ศึกษา (Veterinary Medical Education)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 392,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4127 สัตวบาล (Animal Husbandry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 393,
      "Group": "สัตวแพทยศาสตร์",
      "Field": "4128 เทคโนโลยีการสัตวแพทย์ (Veterinary Technology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 394,
      "Group": "เกษตรศาสตร์",
      "Field": "5101 การปรับปรุงพันธุ์พืช (Plant Breeding)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 395,
      "Group": "เกษตรศาสตร์",
      "Field": "5102 พืชไร่ (Agronomy)",
      "Subfield": "510201 ระบบการปลูกพืช (Cropping Systems)",
      "Branch": "-"
    },
    {
      "rowNum": 396,
      "Group": "เกษตรศาสตร์",
      "Field": "5102 พืชไร่ (Agronomy)",
      "Subfield": "510202 การผลิตพืชไร่ (Field Crop Production)",
      "Branch": "-"
    },
    {
      "rowNum": 397,
      "Group": "เกษตรศาสตร์",
      "Field": "5102 พืชไร่ (Agronomy)",
      "Subfield": "510203 สรีรวิทยาการผลิตพืชไร่ (Crop Production Physiology)",
      "Branch": "-"
    },
    {
      "rowNum": 398,
      "Group": "เกษตรศาสตร์",
      "Field": "5102 พืชไร่ (Agronomy)",
      "Subfield": "510204 พืชอาหารสัตว์ (Forage Crops)",
      "Branch": "-"
    },
    {
      "rowNum": 399,
      "Group": "เกษตรศาสตร์",
      "Field": "5103 พืชศาสตร์ (Plant Sciences)",
      "Subfield": "510301 การจัดการการผลิตพืช (Plant Production Management)",
      "Branch": "-"
    },
    {
      "rowNum": 400,
      "Group": "เกษตรศาสตร์",
      "Field": "5104 พืชสวน (Horticulture)",
      "Subfield": "510401 การปรับปรุงพันธุ์พืชสวน (Horticultural Crop Improvement)",
      "Branch": "-"
    },
    {
      "rowNum": 401,
      "Group": "เกษตรศาสตร์",
      "Field": "5104 พืชสวน (Horticulture)",
      "Subfield": "510402 การออกแบบภูมิทัศน์ (Landscape Design)",
      "Branch": "-"
    },
    {
      "rowNum": 402,
      "Group": "เกษตรศาสตร์",
      "Field": "5105 โรคพืชวิทยา (Plant Pathology)",
      "Subfield": "510501 จุลชีววิทยาการเกษตร (Agricultural Microbiology)",
      "Branch": "-"
    },
    {
      "rowNum": 403,
      "Group": "เกษตรศาสตร์",
      "Field": "5106 กีฏวิทยา (Entomology)",
      "Subfield": "510601 พิษวิทยาของแมลง (Insect Toxicology)",
      "Branch": "-"
    },
    {
      "rowNum": 404,
      "Group": "เกษตรศาสตร์",
      "Field": "5106 กีฏวิทยา (Entomology)",
      "Subfield": "510602 อนุกรมวิธานของแมลง (Insect Ta xonomy)",
      "Branch": "-"
    },
    {
      "rowNum": 405,
      "Group": "เกษตรศาสตร์",
      "Field": "5106 กีฏวิทยา (Entomology)",
      "Subfield": "510603 โรควิทยาของแมลง (Insect Pathology)",
      "Branch": "-"
    },
    {
      "rowNum": 406,
      "Group": "เกษตรศาสตร์",
      "Field": "5106 กีฏวิทยา (Entomology)",
      "Subfield": "510604 กีฎวิทยาสิ่งแวดล้อม (Environmental Entomology)",
      "Branch": "-"
    },
    {
      "rowNum": 407,
      "Group": "เกษตรศาสตร์",
      "Field": "5108 เกษตรเชิงระบบ (Farming Systems)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 408,
      "Group": "เกษตรศาสตร์",
      "Field": "5111 การปรับปรุงพันธุ์สัตว์ (Animal Breeding)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 409,
      "Group": "เกษตรศาสตร์",
      "Field": "5112 โภชนศาสตร์สัตว์ (Animal Nutrition)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 410,
      "Group": "เกษตรศาสตร์",
      "Field": "5113 สัตวบาล (Animal Husbandry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 411,
      "Group": "เกษตรศาสตร์",
      "Field": "5114 สัตวศาสตร์ (Animal Sciences)",
      "Subfield": "511401 พฤติกรรมสัตว์ (Animal Behavior)",
      "Branch": "-"
    },
    {
      "rowNum": 412,
      "Group": "เกษตรศาสตร์",
      "Field": "5121 เทคโนโลยีการผลิตสัตว์ (Animal Production Technology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 413,
      "Group": "เกษตรศาสตร์",
      "Field": "5123 เทคโนโลยีชีวภาพเกษตร (Agricultural Biotechnology)",
      "Subfield": "512301 เทคโนโลยีชีวภาพพืช (Plant Biotechnology)",
      "Branch": "-"
    },
    {
      "rowNum": 414,
      "Group": "เกษตรศาสตร์",
      "Field": "5123 เทคโนโลยีชีวภาพเกษตร (Agricultural Biotechnology)",
      "Subfield": "512302 เทคโนโลยีชีวภาพสัตว์ (Animal Biotechnology)",
      "Branch": "-"
    },
    {
      "rowNum": 415,
      "Group": "เกษตรศาสตร์",
      "Field": "5124 เกษตรกลวิธาน (Farm Machinery)",
      "Subfield": "",
      "Branch": "-"
    },
    {
      "rowNum": 416,
      "Group": "เกษตรศาสตร์",
      "Field": "5125 เทคโนโลยีหลังการเก็บเกี่ยว (Post - Harvest Technology)",
      "Subfield": "",
      "Branch": "-"
    },
    {
      "rowNum": 417,
      "Group": "เกษตรศาสตร์",
      "Field": "5131 การส่งเสริมการเกษตร (Agricultural Extension)",
      "Subfield": "513101 นิเทศศาสตร์เกษตร (Agricultural Communication)",
      "Branch": "-"
    },
    {
      "rowNum": 418,
      "Group": "เกษตรศาสตร์",
      "Field": "5131 การส่งเสริมการเกษตร (Agricultural Extension)",
      "Subfield": "513102 พัฒนาการเกษตร (Agricultural Development)",
      "Branch": "-"
    },
    {
      "rowNum": 419,
      "Group": "เกษตรศาสตร์",
      "Field": "5132 อุตสาหกรรมเกษตร (Agro-Industry)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 420,
      "Group": "เกษตรศาสตร์",
      "Field": "5133 นิเวศวิทยาการเกษตร (Agricultural Ecology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 421,
      "Group": "เกษตรศาสตร์",
      "Field": "5134 เทคโนโลยีภูมิสารสนเทศทางการเกษตร (Agricultural Geo-Information Technology)",
      "Subfield": "513401 เทคโนโลยีสารสนเทศการเกษตร (Agricultural Information Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 422,
      "Group": "เกษตรศาสตร์",
      "Field": "5141 ธรณีวิทยา (Geology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 423,
      "Group": "เกษตรศาสตร์",
      "Field": "5142 ปฐพีวิทยา (Pedology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 424,
      "Group": "เกษตรศาสตร์",
      "Field": "5143 ปฐพีศาสตร์ (Soil Sciences)",
      "Subfield": "514301 ความอุดมสมบูรณ์ของดิน (Soil Fertility)",
      "Branch": "-"
    },
    {
      "rowNum": 425,
      "Group": "เกษตรศาสตร์",
      "Field": "5143 ปฐพีศาสตร์ (Soil Sciences)",
      "Subfield": "514302 จุลินทรีย์ดิน (Soil Microbiology)",
      "Branch": "-"
    },
    {
      "rowNum": 426,
      "Group": "เกษตรศาสตร์",
      "Field": "5143 ปฐพีศาสตร์ (Soil Sciences)",
      "Subfield": "514303 การสำรวจดิน (S oil Survey)",
      "Branch": "-"
    },
    {
      "rowNum": 427,
      "Group": "เกษตรศาสตร์",
      "Field": "5143 ปฐพีศาสตร์ (Soil Sciences)",
      "Subfield": "514304 การอนุรักษ์ดิน (Soil Conservation)",
      "Branch": "-"
    },
    {
      "rowNum": 428,
      "Group": "เกษตรศาสตร์",
      "Field": "5143 ปฐพีศาสตร์ (Soil Sciences)",
      "Subfield": "514305 ฟิสิกส์ของดิน (Soil Physics)",
      "Branch": "-"
    },
    {
      "rowNum": 429,
      "Group": "เกษตรศาสตร์",
      "Field": "5143 ปฐพีศาสตร์ (Soil Sciences)",
      "Subfield": "514306 โภชนาการของพืช (Plant Nutrition)",
      "Branch": "-"
    },
    {
      "rowNum": 430,
      "Group": "เกษตรศาสตร์",
      "Field": "5143 ปฐพีศาสตร์ (Soil Sciences)",
      "Subfield": "514307 การจัดการดิน (Soil Management)",
      "Branch": "-"
    },
    {
      "rowNum": 431,
      "Group": "เกษตรศาสตร์",
      "Field": "5143 ปฐพีศาสตร์ (Soil Sciences)",
      "Subfield": "514308 เคมีของดิน (Soil Chemistry)",
      "Branch": "-"
    },
    {
      "rowNum": 432,
      "Group": "วนศาสตร์",
      "Field": "5301 การจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม (Natural Resource and Environmental Management)",
      "Subfield": "530101 การจัดการป่าไม้ (Forest Management)",
      "Branch": "-"
    },
    {
      "rowNum": 433,
      "Group": "วนศาสตร์",
      "Field": "5301 การจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม (Natural Resource and Environmental Management)",
      "Subfield": "530102 การจัดการลุ่มน้ำ (Watershed Management)",
      "Branch": "-"
    },
    {
      "rowNum": 434,
      "Group": "วนศาสตร์",
      "Field": "5301 การจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม (Natural Resource and Environmental Management)",
      "Subfield": "530103 อุทยาน นันทนาการและการท่องเที่ยว (Park, Recreation and Tourism)",
      "Branch": "-"
    },
    {
      "rowNum": 435,
      "Group": "วนศาสตร์",
      "Field": "5301 การจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม (Natural Resource and Environmental Management)",
      "Subfield": "530104 การจัดการทรัพยากรทางทะเลและชายฝั่ง (Marine and Coastal Resource Management)",
      "Branch": "-"
    },
    {
      "rowNum": 436,
      "Group": "วนศาสตร์",
      "Field": "5301 การจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม (Natural Resource and Environmental Management)",
      "Subfield": "530105 การจัดการทรัพยากรป่าไม้และสิ่งแวดล้อม (Forest Resource and Environmental Management)",
      "Branch": "-"
    },
    {
      "rowNum": 437,
      "Group": "วนศาสตร์",
      "Field": "5301 การจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม (Natural Resource and Environmental Management)",
      "Subfield": "530106 การจัดการสิ่งแวดล้อม (Environmental Management)",
      "Branch": "-"
    },
    {
      "rowNum": 438,
      "Group": "วนศาสตร์",
      "Field": "5301 การจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม (Natural Resource and Environmental Management)",
      "Subfield": "530107 การจัดการทรัพยากรธรรมชาติ (Natural Resource Management)",
      "Branch": "-"
    },
    {
      "rowNum": 439,
      "Group": "วนศาสตร์",
      "Field": "5303 ชีววิทยาป่าไม้ (Forest Biology)",
      "Subfield": "530301 ความหลากหลายทางชีวภาพ (Biodiversity)",
      "Branch": "-"
    },
    {
      "rowNum": 440,
      "Group": "วนศาสตร์",
      "Field": "5303 ชีววิทยาป่าไม้ (Forest Biology)",
      "Subfield": "530302 นิเวศวิทยาป่าไม้ (Forest Ecology)",
      "Branch": "-"
    },
    {
      "rowNum": 441,
      "Group": "วนศาสตร์",
      "Field": "5303 ชีววิทยาป่าไม้ (Forest Biology)",
      "Subfield": "530303 วิทยาศาสตร์ชีวภาพป่าไม้ (Forest Biological Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 442,
      "Group": "วนศาสตร์",
      "Field": "5304 พิษวิทยาสิ่งแวดล้อม (Environmental Toxicology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 443,
      "Group": "วนศาสตร์",
      "Field": "5305 วนวัฒนวิทยา (Silviculture)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 444,
      "Group": "วนศาสตร์",
      "Field": "5306 วิทยาศาสตร์สิ่งแวดล้อม หรือ วิทยาการสิ่งแวดล้อม (Environmental Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 445,
      "Group": "วนศาสตร์",
      "Field": "5307 วนผลิตภัณฑ์ (Forest Product)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 446,
      "Group": "วนศาสตร์",
      "Field": "5308 วิศวกรรมป่าไม้ (Forest Engineering)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 447,
      "Group": "สิ่งแวดล้อมศึกษา",
      "Field": "5401 สิ่งแวดล้อมศึกษา (Environmental Studies)",
      "Subfield": "540101 เศรษฐศาสตร์สิ่งแวดล้อม (Environmental Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 448,
      "Group": "สิ่งแวดล้อมศึกษา",
      "Field": "5401 สิ่งแวดล้อมศึกษา (Environmental Studies)",
      "Subfield": "540102 สังคมวิทยาสิ่งแวดล้อม (Environmental Sociology)",
      "Branch": "-"
    },
    {
      "rowNum": 449,
      "Group": "สิ่งแวดล้อมศึกษา",
      "Field": "5401 สิ่งแวดล้อมศึกษา (Environmental Studies)",
      "Subfield": "540103 จิตวิทยาสิ่งแวดล้อม (Environmental Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 450,
      "Group": "สิ่งแวดล้อมศึกษา",
      "Field": "5401 สิ่งแวดล้อมศึกษา (Environmental Studies)",
      "Subfield": "540104 กฎหมายสิ่งแวดล้อม (Environmental Law)",
      "Branch": "-"
    },
    {
      "rowNum": 451,
      "Group": "สิ่งแวดล้อมศึกษา",
      "Field": "5401 สิ่งแวดล้อมศึกษา (Environmental Studies)",
      "Subfield": "540105 สังคมศาสตร์สิ่งแวดล้อม (Environmental Social Science)",
      "Branch": "-"
    },
    {
      "rowNum": 452,
      "Group": "สิ่งแวดล้อมศึกษา",
      "Field": "5401 สิ่งแวดล้อมศึกษา (Environmental Studies)",
      "Subfield": "540106 การเมืองและนโยบายสิ่งแวดล้อม (Polities and Environmental Policies)",
      "Branch": "-"
    },
    {
      "rowNum": 453,
      "Group": "ประมง",
      "Field": "5501 การเพาะเลี้ยงสัตว์น้ำ (Aquaculture)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 454,
      "Group": "ประมง",
      "Field": "5502 เทคโนโลยีการประมง (Fishery Technology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 455,
      "Group": "ประมง",
      "Field": "5503 ชีววิทยาประมง (Fishery Biology)",
      "Subfield": "550301 อนุกรมวิธานสัตว์น้ำ (Fishery Taxonomy)",
      "Branch": "-"
    },
    {
      "rowNum": 456,
      "Group": "ประมง",
      "Field": "5504 เทคโนโลยีชีวภาพสัตว์น้ำ (Fishery Biotechnology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 457,
      "Group": "ประมง",
      "Field": "5505 วาริชศาสตร์ (Aquatic Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 458,
      "Group": "ประมง",
      "Field": "5507 ผลิตภัณฑ์ประมง (Fishe ry Products)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 459,
      "Group": "ประมง",
      "Field": "5508 การจัดการประมง (Fishery Management)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 460,
      "Group": "ประมง",
      "Field": "5509 วิทยาศาสตร์การทะเล (Marine Sciences)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 461,
      "Group": "สังคมศาสตร์",
      "Field": "6101 รัฐศาสตร์ (Political Science)",
      "Subfield": "610101 การเมืองการปกครอง (Government)",
      "Branch": "-"
    },
    {
      "rowNum": 462,
      "Group": "สังคมศาสตร์",
      "Field": "6101 รัฐศาสตร์ (Political Science)",
      "Subfield": "610102 ปรัชญาและทฤษฎีการเมือง (Political Philosophy and Theory)",
      "Branch": "-"
    },
    {
      "rowNum": 463,
      "Group": "สังคมศาสตร์",
      "Field": "6101 รัฐศาสตร์ (Political Science)",
      "Subfield": "610103 การเมืองการปกครองเปรียบเทียบ (Comparative Politics)",
      "Branch": "-"
    },
    {
      "rowNum": 464,
      "Group": "สังคมศาสตร์",
      "Field": "6101 รัฐศาสตร์ (Political Science)",
      "Subfield": "610104 การปกครองท้องถิ่น (Local Government)",
      "Branch": "-"
    },
    {
      "rowNum": 465,
      "Group": "สังคมศาสตร์",
      "Field": "6101 รัฐศาสตร์ (Political Science)",
      "Subfield": "610105 การเมืองระหว่างประเทศ (International Politics)",
      "Branch": "-"
    },
    {
      "rowNum": 466,
      "Group": "สังคมศาสตร์",
      "Field": "6101 รัฐศาสตร์ (Political Science)",
      "Subfield": "610106 ความสัมพันธ์ระหว่างประเทศ (International Relations)",
      "Branch": "-"
    },
    {
      "rowNum": 467,
      "Group": "สังคมศาสตร์",
      "Field": "6101 รัฐศาสตร์ (Political Science)",
      "Subfield": "610107 เศรษฐศาสตร์การเมือง (Political Economy)",
      "Branch": "-"
    },
    {
      "rowNum": 468,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610201 การบริหารรัฐกิจ (Public Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 469,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610202 การบริหารทรัพยากรมนุษย์ (Human Resource Management)",
      "Branch": "-"
    },
    {
      "rowNum": 470,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610203 การบริหารองค์การ (Organization Management)",
      "Branch": "-"
    },
    {
      "rowNum": 471,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610204 การคลังสาธารณะ (Public Finance)",
      "Branch": "-"
    },
    {
      "rowNum": 472,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610205 นโยบายสาธารณะ (Public Policies)",
      "Branch": "-"
    },
    {
      "rowNum": 473,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610206 การบริหารงานท้องถิ่น (Local Government Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 474,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610207 การบริหารเปรียบเทียบ (Comparative Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 475,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610208 บริหารรัฐกิจและบริหารธุรกิจ (Public and Business Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 476,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610209 การบริหารการพัฒนา (Development Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 477,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610210 การบริหารจัดการที่ดี หรือ ธรรมาภิบาล (Governance)",
      "Branch": "-"
    },
    {
      "rowNum": 478,
      "Group": "สังคมศาสตร์",
      "Field": "6102 รัฐประศาสนศาสตร์ (Public Administration)",
      "Subfield": "610211 อาชญาวิทยาและการบริหารกระบวนการยุติธรรม (Criminology and Criminal Justice Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 479,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610301 เศรษฐศาสตร์ทฤษฎี (Economic Theory)",
      "Branch": "-"
    },
    {
      "rowNum": 480,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610302 เศรษฐศาสตร์ปริมาณวิเคราะห์ (Quantitative Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 481,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610303 เศรษฐมิติ (Econometrics)",
      "Branch": "-"
    },
    {
      "rowNum": 482,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610304 เศรษฐศาสตร์ระหว่างประเทศ (International Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 483,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610305 การเงินระหว่างประเทศ (Internati onal Finance)",
      "Branch": "-"
    },
    {
      "rowNum": 484,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610306 การค้าระหว่างประเทศ (International Trade)",
      "Branch": "-"
    },
    {
      "rowNum": 485,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610307 การรวมกลุ่มทางเศรษฐกิจ (Economic Integration)",
      "Branch": "-"
    },
    {
      "rowNum": 486,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610308 เศรษฐศาสตร์การคลัง (Financial Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 487,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610309 การคลังสาธารณะ (Public Finance)",
      "Branch": "-"
    },
    {
      "rowNum": 488,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610310 เศรษฐศาสตร์สาธารณะ (Public Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 489,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610311 เศรษฐศาสตร์การเงิน (Monetary Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 490,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610312 เศรษฐศาสตร์แรงงาน (Labor Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 491,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610313 เศรษฐศาสตร์ทรัพยากรมนุษย์ (Human Resource Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 492,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610314 เศรษฐศาสตร์การศึกษา (Economics of Education)",
      "Branch": "-"
    },
    {
      "rowNum": 493,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610315 เศรษฐศาสตร์สาธารณสุข (Economics of Public Health หรือ Health Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 494,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610316 เศรษฐศาสตร์สิ่งแวดล้อมและทรัพยากรธรรมชาติ (Economics of Environment and Natural Resources)",
      "Branch": "-"
    },
    {
      "rowNum": 495,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610317 เศรษฐศาสตร์สิ่งแวดล้อม (Environment Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 496,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610318 เศรษฐศาสตร์ทรัพยากรธรรมชาติ (Natural Resources Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 497,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610319 เศรษฐศาสตร์ที่ดิน (Land Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 498,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610320 เศรษฐศาสตร์เกษตร (Agricultural Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 499,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610321 เศรษฐศาสตร์ประชากร (Demographic Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 500,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610322 เศรษฐศาสตร์พฤติกรรมและเศรษฐศาสตร์เชิงทดลอง (Behavioral and Experimental Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 501,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610323 เศรษฐศาสตร์ขนส่ง (Transportation Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 502,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610324 เศรษฐศาสตร์การเมือง (Political Economy)",
      "Branch": "-"
    },
    {
      "rowNum": 503,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610325 เศรษฐศาสตร์อุตสาหกรรม (Industrial Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 504,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610326 เศรษฐศาสตร์ธุรกิจ (Business Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 505,
      "Group": "สังคมศาสตร์",
      "Field": "6103 เศรษฐศาสตร์ (Economics)",
      "Subfield": "610327 เศรษฐศาสตร์สหกรณ์ (Cooperative Economics)",
      "Branch": "-"
    },
    {
      "rowNum": 506,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610401 จิตวิทยาการทดลอง (Experimental Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 507,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610402 จิตวิทยาการศึกษา (Educational Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 508,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610403 จิตวิทยาองค์การ (Organizational Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 509,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610404 จิตวิทยาอุตสาหกรรม (Industrial Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 510,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610405 จิตวิทยาการเรียนรู้ (Learning Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 511,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610406 วิธีวิทยาการวิจัยทางจิตวิทยา (Research Methodology in Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 512,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610407 จิตวิทยาชุมชน (Community Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 513,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610408 จิตวิทยาเด็กพิเศษ (Psychology for Exceptional Children)",
      "Branch": "-"
    },
    {
      "rowNum": 514,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610409 จิตวิทยาผู้สูงอายุ (Aging Ps ychology)",
      "Branch": "-"
    },
    {
      "rowNum": 515,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610410 จิตวิทยาพัฒนาการ (Cognitive Development)",
      "Branch": "-"
    },
    {
      "rowNum": 516,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610411 จิตวิทยาสังคม (Social Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 517,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610412 จิตวิทยาคลินิก (Clinical Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 518,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610413 จิตวิทยาการปรึกษา (Counseling Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 519,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610414 จิตวิทยาทางปัญญา (Cognitive Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 520,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610415 จิตวิทยาสุขภาพ (Health Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 521,
      "Group": "สังคมศาสตร์",
      "Field": "6104 จิตวิทยา (Psychology)",
      "Subfield": "610416 ประสาทจิตวิทยา (Neuropsychology)",
      "Branch": "-"
    },
    {
      "rowNum": 522,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610501 การสื่อสารมวลชน (Mass Communication)",
      "Branch": "-"
    },
    {
      "rowNum": 523,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610502 การสื่อสาร (Communication)",
      "Branch": "-"
    },
    {
      "rowNum": 524,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610503 วารสารศาสตร์ (Journalism)",
      "Branch": "-"
    },
    {
      "rowNum": 525,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610504 การประชาสัมพันธ์ (Public Relations)",
      "Branch": "-"
    },
    {
      "rowNum": 526,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610505 ภาพยนตร์และภาพถ่าย (Motion Picture and Photograph)",
      "Branch": "-"
    },
    {
      "rowNum": 527,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610506 วิทยุกระจายเสียงและวิทยุโทรทัศน์ (Radio and Television)",
      "Branch": "-"
    },
    {
      "rowNum": 528,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610507 วาทวิทยา (Speech Communication)",
      "Branch": "-"
    },
    {
      "rowNum": 529,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610508 วิธีวิทยาการวิจัยทางการสื่อสาร (Research Methodology in Communication)",
      "Branch": "-"
    },
    {
      "rowNum": 530,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610509 การสื่อสารการแสดง (Acting Communication)",
      "Branch": "-"
    },
    {
      "rowNum": 531,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610510 การโฆษณา (Advertising)",
      "Branch": "-"
    },
    {
      "rowNum": 532,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610511 นิเทศศาสตร์พัฒนาการ (Communication Development)",
      "Branch": "-"
    },
    {
      "rowNum": 533,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610512 การสื่อสารสิ่งแวดล้อม (Environmental communication)",
      "Branch": "-"
    },
    {
      "rowNum": 534,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610513 ภาพยนตร์ศึกษา (Film Studies / Scre en Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 535,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610514 สื่อใหม่ (New media)",
      "Branch": "-"
    },
    {
      "rowNum": 536,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610515 การสื่อสารชุมชน (Communication for Community)",
      "Branch": "-"
    },
    {
      "rowNum": 537,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610516 การสื่อสารการเมือง (Political Communication)",
      "Branch": "-"
    },
    {
      "rowNum": 538,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610517 การบริหารกิจการสื่อ (Media Management)",
      "Branch": "-"
    },
    {
      "rowNum": 539,
      "Group": "สังคมศาสตร์",
      "Field": "6105 นิเทศศาสตร์ (Communication Arts)",
      "Subfield": "610518 การสื่อสารการตลาด (Marketing Communication)",
      "Branch": "-"
    },
    {
      "rowNum": 540,
      "Group": "สังคมศาสตร์",
      "Field": "6106 พฤติกรรมศาสตร์ (Behavioral Sciences)",
      "Subfield": "610601 จิตวิทยาการศึกษา (Educational Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 541,
      "Group": "สังคมศาสตร์",
      "Field": "6106 พฤติกรรมศาสตร์ (Behavioral Sciences)",
      "Subfield": "610602 ระบาดวิทยาสังคม (Social Epidemiology)",
      "Branch": "-"
    },
    {
      "rowNum": 542,
      "Group": "สังคมศาสตร์",
      "Field": "6106 พฤติกรรมศาสตร์ (Behavioral Sciences)",
      "Subfield": "610603 วิธีวิทยาการวิจัยทางพฤติกรรมศาสตร์ (Research Methodology in Behavioral Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 543,
      "Group": "สังคมศาสตร์",
      "Field": "6106 พฤติกรรมศาสตร์ (Behavioral Sciences)",
      "Subfield": "610604 จิตพฤติกรรมศาสตร์ (Behavioral Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 544,
      "Group": "สังคมศาสตร์",
      "Field": "6106 พฤติกรรมศาสตร์ (Behavioral Sciences)",
      "Subfield": "610605 พฤติกรรมศาสตร์เพื่อการเปลี่ยนแปลงและการพัฒนา (Behavioral Sciences for Change and Development)",
      "Branch": "-"
    },
    {
      "rowNum": 545,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610701 วิธีวิทยาการวิจัยทางประชากรศาสตร์ (Research Methodology in Demography / Population Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 546,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610702 ประชากรกับการพัฒนา (Population and Development)",
      "Branch": "-"
    },
    {
      "rowNum": 547,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610703 เศรษฐศาสตร์ประชากร (Economic Demography)",
      "Branch": "-"
    },
    {
      "rowNum": 548,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610704 ประชากรและสุขภาพ (Population and Health)",
      "Branch": "-"
    },
    {
      "rowNum": 549,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610705 การวิจัยประชากรและสังคม (Population and Social Research)",
      "Branch": "-"
    },
    {
      "rowNum": 550,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610706 การย้ายถิ่น (Migration)",
      "Branch": "-"
    },
    {
      "rowNum": 551,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610707 การอนามัยการเจริญพันธุ์ (Reproductive Health)",
      "Branch": "-"
    },
    {
      "rowNum": 552,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610708 ผู้สูงอายุ (Elderly)",
      "Branch": "-"
    },
    {
      "rowNum": 553,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610709 การสมรส (Nuptiality)",
      "Branch": "-"
    },
    {
      "rowNum": 554,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610710 การเจ็บป่วยและตาย (Morbidity and Mortality)",
      "Branch": "-"
    },
    {
      "rowNum": 555,
      "Group": "สังคมศาสตร์",
      "Field": "6107 ประชากรศาสตร์ (Demography)",
      "Subfield": "610711 สตรีและเด็ก (Female and Children)",
      "Branch": "-"
    },
    {
      "rowNum": 556,
      "Group": "สังคมศาสตร์",
      "Field": "6108 สังคมสงเคราะห์ศาสตร์ (Social Welfare)",
      "Subfield": "610801 สังคมสงเคราะห์ (Social Welfare)",
      "Branch": "-"
    },
    {
      "rowNum": 557,
      "Group": "สังคมศาสตร์",
      "Field": "6108 สังคมสงเคราะห์ศาสตร์ (Social Welfare)",
      "Subfield": "610802 สังคมสงเคราะห์ศาสตร์คลินิก (Clinical Social Welfare)",
      "Branch": "-"
    },
    {
      "rowNum": 558,
      "Group": "สังคมศาสตร์",
      "Field": "6108 สังคมสงเคราะห์ศาสตร์ (Social Welfare)",
      "Subfield": "610803 สวัสดิการสังคม (Social Services)",
      "Branch": "-"
    },
    {
      "rowNum": 559,
      "Group": "สังคมศาสตร์",
      "Field": "6108 สังคมสงเคราะห์ศาสตร์ (Social Welfare)",
      "Subfield": "610804 สวัสดิการชุมชน (Community Services)",
      "Branch": "-"
    },
    {
      "rowNum": 560,
      "Group": "สังคมศาสตร์",
      "Field": "6108 สังคมสงเคราะห์ศาสตร์ (Social Welfare)",
      "Subfield": "610805 การบริหารและนโยบายสวัสดิการสังคม (Social Welfare Administration and Policy)",
      "Branch": "-"
    },
    {
      "rowNum": 561,
      "Group": "สังคมศาสตร์",
      "Field": "6108 สังคมสงเคราะห์ศาสตร์ (Social Welfare)",
      "Subfield": "610806 ทฤษฎีการสังคมสงเคราะห์ (Social Welfare Theory)",
      "Branch": "-"
    },
    {
      "rowNum": 562,
      "Group": "สังคมศาสตร์",
      "Field": "6108 สังคมสงเคราะห์ศาสตร์ (Social Welfare)",
      "Subfield": "610807 สังคมสงเคราะห์ทางการแพทย์ (Medical Social Welfare)",
      "Branch": "-"
    },
    {
      "rowNum": 563,
      "Group": "สังคมศาสตร์",
      "Field": "6108 สังคมสงเคราะห์ศาสตร์ (Social Welfare)",
      "Subfield": "610808 สังคมสงเคราะห์ทางการศึกษา (Educational Social Welfare)",
      "Branch": "-"
    },
    {
      "rowNum": 564,
      "Group": "สังคมศาสตร์",
      "Field": "6108 สังคมสงเคราะห์ศาสตร์ (Social Welfare)",
      "Subfield": "610809 แรงงานและการพัฒนานโยบายสังคม (Labor and Social Policy Development)",
      "Branch": "-"
    },
    {
      "rowNum": 565,
      "Group": "สังคมศาสตร์",
      "Field": "6109 มานุษยวิทยา (Anthropology)",
      "Subfield": "610901 มานุษยวิทยาวัฒนธรรม (Cultural Anthropology)",
      "Branch": "-"
    },
    {
      "rowNum": 566,
      "Group": "สังคมศาสตร์",
      "Field": "6109 มานุษยวิทยา (Anthropology)",
      "Subfield": "610902 มานุษยวิทยากายภาพ (Physical Anthropology)",
      "Branch": "-"
    },
    {
      "rowNum": 567,
      "Group": "สังคมศาสตร์",
      "Field": "6109 มานุษยวิทยา (Anthropology)",
      "Subfield": "610903 มานุษยวิทยาประยุกต์ (Applied Anthropology)",
      "Branch": "-"
    },
    {
      "rowNum": 568,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611001 มนุษย์กับสังคม (Man and Society)",
      "Branch": "-"
    },
    {
      "rowNum": 569,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611002 สังคมกับพุทธศาสนา (Society and Buddhism)",
      "Branch": "-"
    },
    {
      "rowNum": 570,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611003 การเปลี่ยนแปลงทางสังคมวัฒนธรรม (Social and Cultural Changes)",
      "Branch": "-"
    },
    {
      "rowNum": 571,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611004 ทฤษฎีสังคมวิทยา (Theory of Sociology)",
      "Branch": "-"
    },
    {
      "rowNum": 572,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611005 การพัฒนาสังคม (Social Devel opment)",
      "Branch": "-"
    },
    {
      "rowNum": 573,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611006 การพัฒนาชุมชน (Community Development)",
      "Branch": "-"
    },
    {
      "rowNum": 574,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611007 การพัฒนาชนบท (Rural Development)",
      "Branch": "-"
    },
    {
      "rowNum": 575,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611008 เพศสภาพศึกษา หรือ เพศสถานะศึกษา (Gender Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 576,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611009 สตรีศึกษา (Women’s Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 577,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611010 วิธีวิทยาการวิจัยทางสังคม (Social Research Methodology)",
      "Branch": "-"
    },
    {
      "rowNum": 578,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611011 นวัตกรรมสังคม (Social Innovation)",
      "Branch": "-"
    },
    {
      "rowNum": 579,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611012 การจัดการชุมชน (Community Management)",
      "Branch": "-"
    },
    {
      "rowNum": 580,
      "Group": "สังคมศาสตร์",
      "Field": "6110 สังคมวิทยา (Sociology)",
      "Subfield": "611013 สังคมวิทยาการคณนา (Computational Sociology)",
      "Branch": "-"
    },
    {
      "rowNum": 581,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611101 ภูมิศาสตร์เกษตร (Agricultural Geography)",
      "Branch": "-"
    },
    {
      "rowNum": 582,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611102 ภูมิศาสตร์เมือง (Urban Geography)",
      "Branch": "-"
    },
    {
      "rowNum": 583,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611103 ภูมิศาสตร์การเมือง (Political Geography)",
      "Branch": "-"
    },
    {
      "rowNum": 584,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611104 ภูมิศาสตร์กายภาพ (Physical Geography)",
      "Branch": "-"
    },
    {
      "rowNum": 585,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611105 ภูมิศาสตร์เศรษฐกิจ (Economic Geography)",
      "Branch": "-"
    },
    {
      "rowNum": 586,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611106 ภูมิศาสตร์มนุษย์ (Human Geography)",
      "Branch": "-"
    },
    {
      "rowNum": 587,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611107 สถิติทางภูมิศาสตร์ (Statistics for Geography)",
      "Branch": "-"
    },
    {
      "rowNum": 588,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611108 เทคโนโลยีทางภูมิศาสตร์ (Technical Geography /Technique in Geography)",
      "Branch": "-"
    },
    {
      "rowNum": 589,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611109 การวิเคราะห์เชิงปริมาณทางภูมิศาสตร์ (Quantitative Analysis Geography)",
      "Branch": "-"
    },
    {
      "rowNum": 590,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611110 ภูมิอากาศวิทยา (Climatology)",
      "Branch": "-"
    },
    {
      "rowNum": 591,
      "Group": "สังคมศาสตร์",
      "Field": "6111 ภูมิศาสตร์ (Geography)",
      "Subfield": "611111 สารสนเทศภูมิศาสตร์ (Geographic Information System)",
      "Branch": "-"
    },
    {
      "rowNum": 592,
      "Group": "สังคมศาสตร์",
      "Field": "6112 วิทยาการประกันภัย (Actuarial Sciences)",
      "Subfield": "611201 คณิตศาสตร์ประกันภัย (Mathematics of Insurance)",
      "Branch": "-"
    },
    {
      "rowNum": 593,
      "Group": "สังคมศาสตร์",
      "Field": "6112 วิทยาการประกันภัย (Actuarial Sciences)",
      "Subfield": "611202 การจัดการการเสี่ยงภัยและการประกันภัย (Risk Management and Insurance)",
      "Branch": "-"
    },
    {
      "rowNum": 594,
      "Group": "สังคมศาสตร์",
      "Field": "6112 วิทยาการประกันภัย (Actuarial Sciences)",
      "Subfield": "611203 เศรษฐศาสตร์ประกันภัย (Economics of Insurance)",
      "Branch": "-"
    },
    {
      "rowNum": 595,
      "Group": "สังคมศาสตร์",
      "Field": "6113 สถิติศาสตร์ (Statistics)",
      "Subfield": "611301 สถิติ (Statistics)",
      "Branch": "-"
    },
    {
      "rowNum": 596,
      "Group": "สังคมศาสตร์",
      "Field": "6113 สถิติศาสตร์ (Statistics)",
      "Subfield": "611302 สถิติประยุกต์ (Applied Statistics)",
      "Branch": "-"
    },
    {
      "rowNum": 597,
      "Group": "สังคมศาสตร์",
      "Field": "6113 สถิติศาสตร์ (Statistics)",
      "Subfield": "611303 ชีวสถิติ (Biostatistics)",
      "Branch": "-"
    },
    {
      "rowNum": 598,
      "Group": "สังคมศาสตร์",
      "Field": "6113 สถิติศาสตร์ (Statistics)",
      "Subfield": "611304 คณิตศาสตร์สถิติ (Mathematical Statistics)",
      "Branch": "-"
    },
    {
      "rowNum": 599,
      "Group": "สังคมศาสตร์",
      "Field": "6113 สถิติศาสตร์ (Statistics)",
      "Subfield": "611305 การวิเคราะห์สถิติ (Statistical Analysis)",
      "Branch": "-"
    },
    {
      "rowNum": 600,
      "Group": "สังคมศาสตร์",
      "Field": "6113 สถิติศาสตร์ (Statistics)",
      "Subfield": "611306 วิทยาการข้อมูล (Data Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 601,
      "Group": "สังคมศาสตร์",
      "Field": "6113 สถิติศาสตร์ (Statistics)",
      "Subfield": "611307 วิทยาการประกันภัย (Actuarial Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 602,
      "Group": "สังคมศาสตร์",
      "Field": "6114 เศรษฐศาสตร์การพัฒนา (Development Economics)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 603,
      "Group": "บรรณารักษศาสตร์",
      "Field": "6301 บรรณารักษศาสตร์ (Library Science) หรือ สารสนเทศศึกษา (Information Studies) หรือ สารสนเทศศาสตร์ (Information Science)",
      "Subfield": "630101 การจัดการทรัพยากรห้องสมุดและบริการ (Library Collection and Service Management)",
      "Branch": "-"
    },
    {
      "rowNum": 604,
      "Group": "บรรณารักษศาสตร์",
      "Field": "6301 บรรณารักษศาสตร์ (Library Science) หรือ สารสนเทศศึกษา (Information Studies) หรือ สารสนเทศศาสตร์ (Information Science)",
      "Subfield": "630102 พฤติกรรมสารสนเทศของมนุษย์ (Human Information Behavior)",
      "Branch": "-"
    },
    {
      "rowNum": 605,
      "Group": "บรรณารักษศาสตร์",
      "Field": "6301 บรรณารักษศาสตร์ (Library Science) หรือ สารสนเทศศึกษา (Information Studies) หรือ สารสนเทศศาสตร์ (Information Science)",
      "Subfield": "630103 การจัดการข้อมูลสารสนเทศและความรู้ (Data, Information and Knowledge Management)",
      "Branch": "-"
    },
    {
      "rowNum": 606,
      "Group": "บรรณารักษศาสตร์",
      "Field": "6301 บรรณารักษศาสตร์ (Library Science) หรือ สารสนเทศศึกษา (Information Studies) หรือ สารสนเทศศาสตร์ (Information Science)",
      "Subfield": "630104 การจัดการเอกสารและจดหมายเหตุ (Records and Archives Management)",
      "Branch": "-"
    },
    {
      "rowNum": 607,
      "Group": "บรรณารักษศาสตร์",
      "Field": "6301 บรรณารักษศาสตร์ (Library Science) หรือ สารสนเทศศึกษา (Information Studies) หรือ สารสนเทศศาสตร์ (Information Science)",
      "Subfield": "630105 การจัดการองค์กรสารสนเทศ (Management of Information Organizations)",
      "Branch": "-"
    },
    {
      "rowNum": 608,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650101 สถิติ วิจัย การวัด และการประเมินผลทางการศึกษา (Education Statistics, Research, Measurement and Evaluation)",
      "Branch": "-"
    },
    {
      "rowNum": 609,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650102 การวิจัยทางการศึกษา (Educational Research)",
      "Branch": "-"
    },
    {
      "rowNum": 610,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650103 การวัดและประเมินผลทางการศึกษา (Educational Measurement and Evaluation)",
      "Branch": "-"
    },
    {
      "rowNum": 611,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650104 การแนะแนว (Guidance)",
      "Branch": "-"
    },
    {
      "rowNum": 612,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650105 การแนะแนวและให้คำปรึกษา (Guidance and Counseling)",
      "Branch": "-"
    },
    {
      "rowNum": 613,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650106 จิตวิทยาการศึกษา (Educational Psychology)",
      "Branch": "-"
    },
    {
      "rowNum": 614,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650107 หลักสูตรและการสอน (Curriculum and Instruction)",
      "Branch": "-"
    },
    {
      "rowNum": 615,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650108 หลักสูตรศึกษา (Curriculum Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 616,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650109 การพัฒนาหลักสูตร (Curriculum Development)",
      "Branch": "-"
    },
    {
      "rowNum": 617,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650110 การวิจัยและการพัฒนาหลักสูตร (Research and Curriculum Development)",
      "Branch": "-"
    },
    {
      "rowNum": 618,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650121 การสอนคณิตศาสตร์ (Teaching Mathematics)",
      "Branch": "-"
    },
    {
      "rowNum": 619,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650122 การสอนวิทยาศาสตร์ (Teaching Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 620,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650123 การสอนสังคมศึกษา (Teaching Social Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 621,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650124 การสอนภาษาต่างประเทศ (Teaching Foreign Language)",
      "Branch": "-"
    },
    {
      "rowNum": 622,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650125 การสอนภาษาอังกฤษ (Teaching English)",
      "Branch": "-"
    },
    {
      "rowNum": 623,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650126 การสอนภาษาฝรั่งเศส (Teaching French)",
      "Branch": "-"
    },
    {
      "rowNum": 624,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650127 การสอนภาษาไทย (Teaching Thai)",
      "Branch": "-"
    },
    {
      "rowNum": 625,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650141 สังคมศึกษา (Social Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 626,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650142 วิทยาศาสตร์ศึกษา (Science Education)",
      "Branch": "-"
    },
    {
      "rowNum": 627,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650143 สิ่งแวดล้อมศึกษา (Environmental Education)",
      "Branch": "-"
    },
    {
      "rowNum": 628,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650144 คณิตศาสตร์ศึกษา (Mathematics Education)",
      "Branch": "-"
    },
    {
      "rowNum": 629,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650145 คอมพิวเตอร์ศึกษา (Computer Education)",
      "Branch": "-"
    },
    {
      "rowNum": 630,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650146 เทคโนโลยีการศึกษา (Educational Technology)",
      "Branch": "-"
    },
    {
      "rowNum": 631,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650147 ธุรกิจศึกษา (Business Education)",
      "Branch": "-"
    },
    {
      "rowNum": 632,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650148 สุขศึกษา (Health Education)",
      "Branch": "-"
    },
    {
      "rowNum": 633,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650149 พลศึกษา (Physical Education)",
      "Branch": "-"
    },
    {
      "rowNum": 634,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650150 เศรษฐศาสตร์การศึกษา (Economics of Education)",
      "Branch": "-"
    },
    {
      "rowNum": 635,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650151 ศิลปศึกษา (Art Education)",
      "Branch": "-"
    },
    {
      "rowNum": 636,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650152 ดนตรีศึกษา (Music Education)",
      "Branch": "-"
    },
    {
      "rowNum": 637,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650153 นาฏศิลป์ศึกษา (Dance Education)",
      "Branch": "-"
    },
    {
      "rowNum": 638,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650161 การศึกษาปฐมวัย (Early Childhood Education)",
      "Branch": "-"
    },
    {
      "rowNum": 639,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650162 การประถมศึกษา (Primary Education หรือ Elementary Education)",
      "Branch": "-"
    },
    {
      "rowNum": 640,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650163 การมัธยมศึกษา (Secondary Education)",
      "Branch": "-"
    },
    {
      "rowNum": 641,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650164 การอุดมศึกษา (Higher Education)",
      "Branch": "-"
    },
    {
      "rowNum": 642,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650165 การบริหารการศึกษา (Education al Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 643,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650166 การนิเทศการศึกษา (Education al Supervision)",
      "Branch": "-"
    },
    {
      "rowNum": 644,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650171 ครุศาสตร์เกษตร (Agricultural Education)",
      "Branch": "-"
    },
    {
      "rowNum": 645,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650172 ครุศาสตร์ไฟฟ้า (Electrical Education)",
      "Branch": "-"
    },
    {
      "rowNum": 646,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650173 ครุศาสตร์เครื่องกล (Mechanical Education)",
      "Branch": "-"
    },
    {
      "rowNum": 647,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650174 ครุศาสตร์อุตสาหกรรม (Industrial Education)",
      "Branch": "-"
    },
    {
      "rowNum": 648,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650175 ครุศาสตร์เทคโนโลยี (Technology Education)",
      "Branch": "-"
    },
    {
      "rowNum": 649,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650176 อุตสาหกรรมศึกษา (Industrial Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 650,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650177 การฝึกหัดครู (Teacher Education)",
      "Branch": "-"
    },
    {
      "rowNum": 651,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650178 ครุศึกษา (Teacher Education)",
      "Branch": "-"
    },
    {
      "rowNum": 652,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650179 การอาชีวศึกษา (Vocational Education)",
      "Branch": "-"
    },
    {
      "rowNum": 653,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650180 การอาชีวศึกษาและเทคนิคศึกษา (Vocational and Technical Education)",
      "Branch": "-"
    },
    {
      "rowNum": 654,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650181 การศึกษาผู้ใหญ่ (Adult Education)",
      "Branch": "-"
    },
    {
      "rowNum": 655,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650182 การศึกษานอกระบบ หรือ การศึกษานอกโรงเรียน (Non-Formal Education)",
      "Branch": "-"
    },
    {
      "rowNum": 656,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650183 การศึกษาทางไกล (Distance Education)",
      "Branch": "-"
    },
    {
      "rowNum": 657,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650184 การศึกษาพิเศษ (Special Education) (ครอบคลุม Gifted Child, Autistic, และการศึกษาเด็กพิการ (Disabilities Education) และการศึกษาแบบเรียนรวม (Inclusive Education)",
      "Branch": "-"
    },
    {
      "rowNum": 658,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650185 พัฒนศึกษา (Development Education)",
      "Branch": "-"
    },
    {
      "rowNum": 659,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650186 สารัตถศึกษาหรือพื้นฐานการศึกษา (Foundation of Education)",
      "Branch": "-"
    },
    {
      "rowNum": 660,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650187 การศึกษาเปรียบเทียบ (Comparative Education)",
      "Branch": "-"
    },
    {
      "rowNum": 661,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650188 การศึกษาต่อเนื่อง (Continuing Education)",
      "Branch": "-"
    },
    {
      "rowNum": 662,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650189 คหกรรมศึกษา (Home Economics Education)",
      "Branch": "-"
    },
    {
      "rowNum": 663,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650190 เกษตรและสิ่งแวดล้อมศึกษา (Agricultural and Environmental Education)",
      "Branch": "-"
    },
    {
      "rowNum": 664,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650191 การออกแบบสื่อการเรียนรู้ (Educational Media Design)",
      "Branch": "-"
    },
    {
      "rowNum": 665,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650192 นันทนาการ (Recreation)",
      "Branch": "-"
    },
    {
      "rowNum": 666,
      "Group": "ศึกษาศาสตร์",
      "Field": "6501 ศึกษาศาสตร์ หรือ การศึกษา หรือ ครุศาสตร์ (Education)",
      "Subfield": "650193 ครุศาสตร์โยธา (Civil Technolohy Education)",
      "Branch": "-"
    },
    {
      "rowNum": 667,
      "Group": "นิติศาสตร์",
      "Field": "6701 กฎหมายเอกชน (Private Law)",
      "Subfield": "670101 กฎหมายแพ่ง (Civil Law)",
      "Branch": "-"
    },
    {
      "rowNum": 668,
      "Group": "นิติศาสตร์",
      "Field": "6701 กฎหมายเอกชน (Private Law)",
      "Subfield": "670102 กฎหมายพาณิชย์ (Commercial Law)",
      "Branch": "-"
    },
    {
      "rowNum": 669,
      "Group": "นิติศาสตร์",
      "Field": "6702 กฎหมายมหาชน (Public Law)",
      "Subfield": "670201 กฎหมายรัฐธรรมนูญ (Constitutional Law)",
      "Branch": "-"
    },
    {
      "rowNum": 670,
      "Group": "นิติศาสตร์",
      "Field": "6702 กฎหมายมหาชน (Public Law)",
      "Subfield": "670202 กฎหมายปกครอง (Administrative Law)",
      "Branch": "-"
    },
    {
      "rowNum": 671,
      "Group": "นิติศาสตร์",
      "Field": "6702 กฎหมายมหาชน (Public Law)",
      "Subfield": "670203 กฎหมายการคลังและการภาษีอากร (Public Finance and Taxation)",
      "Branch": "-"
    },
    {
      "rowNum": 672,
      "Group": "นิติศาสตร์",
      "Field": "6702 กฎหมายมหาชน (Public Law)",
      "Subfield": "670204 กฎหมายสิ่งแวดล้อม (Environment Law)",
      "Branch": "-"
    },
    {
      "rowNum": 673,
      "Group": "นิติศาสตร์",
      "Field": "6703 กฎหมายระหว่างประเทศ (International Law)",
      "Subfield": "670301 กฎหมายเอกชนระหว่างประเทศ (Private International Law)",
      "Branch": "-"
    },
    {
      "rowNum": 674,
      "Group": "นิติศาสตร์",
      "Field": "6703 กฎหมายระหว่างประเทศ (International Law)",
      "Subfield": "670302 กฎหมายมหาชนระหว่างประเทศ (Pubic International Law)",
      "Branch": "-"
    },
    {
      "rowNum": 675,
      "Group": "นิติศาสตร์",
      "Field": "6703 กฎหมายระหว่างประเทศ (International Law)",
      "Subfield": "670303 กฎหมายอาญาระหว่างประเทศ (International Criminal Law)",
      "Branch": "-"
    },
    {
      "rowNum": 676,
      "Group": "นิติศาสตร์",
      "Field": "6703 กฎหมายระหว่างประเทศ (International Law)",
      "Subfield": "670304 กฎหมายเศรษฐกิจระหว่างประเทศ (International Economic Law)",
      "Branch": "-"
    },
    {
      "rowNum": 677,
      "Group": "นิติศาสตร์",
      "Field": "6704 กฎหมายสังคม (Social Law)",
      "Subfield": "670401 กฎหมายแรงงาน (Labour Law)",
      "Branch": "-"
    },
    {
      "rowNum": 678,
      "Group": "นิติศาสตร์",
      "Field": "6705 กฎหมายเศรษฐกิจ (Economic Law)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 679,
      "Group": "นิติศาสตร์",
      "Field": "6706 กฎหมายเปรียบเทียบ (Comparative Law)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 680,
      "Group": "นิติศาสตร์",
      "Field": "6707 นิติปรัชญา (Philosophy of Law)",
      "Subfield": "670701 นิติศึกษา (Legal Stud ies)",
      "Branch": "-"
    },
    {
      "rowNum": 681,
      "Group": "นิติศาสตร์",
      "Field": "6708 กฎหมายธุรกิจ (Business Law)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 682,
      "Group": "นิติศาสตร์",
      "Field": "6709 กฎหมายอาญา (Criminal Law)",
      "Subfield": "670901 กฎหมายอาญาและกระบวนการยุติธรรม (Criminal Law and Justice Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 683,
      "Group": "นิติศาสตร์",
      "Field": "6709 กฎหมายอาญา (Criminal Law)",
      "Subfield": "670902 กฎหมายอาญาและอาชญาวิทยา (Criminal Law and Criminology)",
      "Branch": "-"
    },
    {
      "rowNum": 684,
      "Group": "นิติศาสตร์",
      "Field": "6710 กฎหมายสิ่งแวดล้อม (Environmental Law)",
      "Subfield": "670902 กฎหมายอาญาและอาชญาวิทยา (Criminal Law and Criminology)",
      "Branch": "-"
    },
    {
      "rowNum": 685,
      "Group": "นิติศาสตร์",
      "Field": "6711 นิติศาสตร์ (Law)",
      "Subfield": "670902 กฎหมายอาญาและอาชญาวิทยา (Criminal Law and Criminology)",
      "Branch": "-"
    },
    {
      "rowNum": 686,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6801 การบัญชี (Accounting)",
      "Subfield": "680101 การบัญชีการเงิน (Financial Accounting)",
      "Branch": "-"
    },
    {
      "rowNum": 687,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6801 การบัญชี (Accounting)",
      "Subfield": "680102 การบัญชีบริหาร (Managerial Accounting)",
      "Branch": "-"
    },
    {
      "rowNum": 688,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6801 การบัญชี (Accounting)",
      "Subfield": "680103 การบัญชีต้นทุน (Cost Accounting)",
      "Branch": "-"
    },
    {
      "rowNum": 689,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6801 การบัญชี (Accounting)",
      "Subfield": "680104 ระบบสารสนเทศทางการบัญชี (Accounting Information System)",
      "Branch": "-"
    },
    {
      "rowNum": 690,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6801 การบัญชี (Accounting)",
      "Subfield": "680105 การสอบบัญชี (Auditing)",
      "Branch": "-"
    },
    {
      "rowNum": 691,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6801 การบัญชี (Accounting)",
      "Subfield": "680106 การภาษีอากร (Taxation)",
      "Branch": "-"
    },
    {
      "rowNum": 692,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680201 การจัดการ (Management)",
      "Branch": "-"
    },
    {
      "rowNum": 693,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680202 การจัดการทรัพยากรมนุษย์ (Human Resource Management)",
      "Branch": "-"
    },
    {
      "rowNum": 694,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680203 การจัดการเชิงกลยุทธ์ (Strategic Management)",
      "Branch": "-"
    },
    {
      "rowNum": 695,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680204 การจัดการข้อมูลสารสนเทศ หรือ ระบบสารสนเทศเพื่อการจัดการ (Management Information System)",
      "Branch": "-"
    },
    {
      "rowNum": 696,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680205 การจัดการการดำเนินงาน (Operations Management)",
      "Branch": "-"
    },
    {
      "rowNum": 697,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680206 การจัดการผู้ประกอบการ (Entrepreneurial Management)",
      "Branch": "-"
    },
    {
      "rowNum": 698,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680207 การจัดการธุรกิจระหว่างประเทศ (International BusinessM anagement)",
      "Branch": "-"
    },
    {
      "rowNum": 699,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680208 การจัดการห่วงโซ่อุปทานและโลจิสติกส์ (Supply Chain and Logistics Management)",
      "Branch": "-"
    },
    {
      "rowNum": 700,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680209 ภาวะผู้นำและพฤติกรรมองค์กร (Leadership and Organizational Behaviors)",
      "Branch": "-"
    },
    {
      "rowNum": 701,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680210 การวิเคราะห์ธุรกิจเชิงปริมาณ (Quantitative Business Analysis)",
      "Branch": "-"
    },
    {
      "rowNum": 702,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680211 การจัดการเทคโนโลยีและนวัตกรรม (Management of Technology and Innovation)",
      "Branch": "-"
    },
    {
      "rowNum": 703,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680212 การจัดการการท่องเที่ยวและบริการ (Hospitality and Tourism Management)",
      "Branch": "-"
    },
    {
      "rowNum": 704,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680213 การจัดการความรู้ (Knowledge Management)",
      "Branch": "-"
    },
    {
      "rowNum": 705,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680214 การตลาด (Marketing)",
      "Branch": "-"
    },
    {
      "rowNum": 706,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680215 การเงิน (Fin ance)",
      "Branch": "-"
    },
    {
      "rowNum": 707,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680216 การบริหารการขนส่งระหว่างประเทศ หรือ การจัดการขนส่งระหว่างประเทศ (International Transportation Management)",
      "Branch": "-"
    },
    {
      "rowNum": 708,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680217 การวิจัยธุรกิจและการวิเคราะห์เชิงปริมาณ (Business Research and Quantitative Analysis)",
      "Branch": "-"
    },
    {
      "rowNum": 709,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680218 การเงินและตลาดหลักทรัพย์ (Finance and Security Market)",
      "Branch": "-"
    },
    {
      "rowNum": 710,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680219 การจัดการการผลิต (Production Management)",
      "Branch": "-"
    },
    {
      "rowNum": 711,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680220 การจัดการอุตสาหกรรม (Industrial Management)",
      "Branch": "-"
    },
    {
      "rowNum": 712,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680221 ธุรกิจอสังหาริมทรัพย์ (Property Business)",
      "Branch": "-"
    },
    {
      "rowNum": 713,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680222 ธุรกิจการเกษตร (Agribusiness)",
      "Branch": "-"
    },
    {
      "rowNum": 714,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680223 บริหารธุรกิจและบริหารรัฐกิจ (Business and Public Administration)",
      "Branch": "-"
    },
    {
      "rowNum": 715,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680224 วิทยาการการตัดสินใจ (Decision Sciences)",
      "Branch": "-"
    },
    {
      "rowNum": 716,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680225 คอมพิวเตอร์ธุรกิจ (Business Computer)",
      "Branch": "-"
    },
    {
      "rowNum": 717,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680226 การจัดการงานก่อสร้าง (Construction Management)",
      "Branch": "-"
    },
    {
      "rowNum": 718,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680227 การจัดการธุรกิจบันเทิง (Entertainment BusinessM anagement)",
      "Branch": "-"
    },
    {
      "rowNum": 719,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680228 การจัดการธุรกิจดนตรี (Music Business Management)",
      "Branch": "-"
    },
    {
      "rowNum": 720,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680229 การจัดการสหกรณ์ (Co-Operative Management)",
      "Branch": "-"
    },
    {
      "rowNum": 721,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680230 การจัดการบริการ (Service Management)",
      "Branch": "-"
    },
    {
      "rowNum": 722,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6802 บริหารธุรกิจ (Business Administration) หรือ พาณิชยศาสตร์ (Commerce)",
      "Subfield": "680231 การจัดการการกีฬา (Sports Management)",
      "Branch": "-"
    },
    {
      "rowNum": 723,
      "Group": "การบัญชีและบริหารธุรกิจ",
      "Field": "6803 โลจิสติกส์และการจัดการโซ่อุปทาน (Logistics and Supply Chain Management)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 724,
      "Group": "มนุษยศาสตร์",
      "Field": "7101 ภาษาไทย (Thai Language)",
      "Subfield": "710101 การศึกษาภาษาไทยในฐานะภาษาแม่ (Thai Language)",
      "Branch": "การศึกษาภาษาไทยตามแนวภาษาศาสตร์ (Linguistic Study of Thai)"
    },
    {
      "rowNum": 725,
      "Group": "มนุษยศาสตร์",
      "Field": "7101 ภาษาไทย (Thai Language)",
      "Subfield": "710101 การศึกษาภาษาไทยในฐานะภาษาแม่ (Thai Language)",
      "Branch": "ไวยากรณ์ไทย/หลักภาษาไทย (Thai Grammar)"
    },
    {
      "rowNum": 726,
      "Group": "มนุษยศาสตร์",
      "Field": "7101 ภาษาไทย (Thai Language)",
      "Subfield": "710102 ภาษาถิ่นไทย (Thai Dialects)",
      "Branch": "-"
    },
    {
      "rowNum": 727,
      "Group": "มนุษยศาสตร์",
      "Field": "7101 ภาษาไทย (Thai Language)",
      "Subfield": "710103 ภาษากับสังคม / วัฒนธรรมไทย (Thai Lang uage and Society / Culture)",
      "Branch": "-"
    },
    {
      "rowNum": 728,
      "Group": "มนุษยศาสตร์",
      "Field": "7101 ภาษาไทย (Thai Language)",
      "Subfield": "710104 ภาษาไทยในฐานะภาษาต่างประเทศ (Thai as a Foreign Language)",
      "Branch": "-"
    },
    {
      "rowNum": 729,
      "Group": "มนุษยศาสตร์",
      "Field": "7101 ภาษาไทย (Thai Language)",
      "Subfield": "710105 คติชนวิทยา (Thai Folklore)",
      "Branch": "-"
    },
    {
      "rowNum": 730,
      "Group": "มนุษยศาสตร์",
      "Field": "7101 ภาษาไทย (Thai Language)",
      "Subfield": "710106 การอ่านจารึก (Thai Epigraphy)",
      "Branch": "ภาษาไทยสมัยเก่า (Old Thai)"
    },
    {
      "rowNum": 731,
      "Group": "มนุษยศาสตร์",
      "Field": "7102 ภาษาเขมร (Cambodian Language)",
      "Subfield": "710201 ภาษาเขมรในฐานะภาษาต่างประเทศ (Cambodian Language)",
      "Branch": "ภาษาเขมรตามแนวภาษาศาสตร์ (Linguistic Study of Khmer)"
    },
    {
      "rowNum": 732,
      "Group": "มนุษยศาสตร์",
      "Field": "7102 ภาษาเขมร (Cambodian Language)",
      "Subfield": "710202 การแปลและล่าม (Cambodian : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 733,
      "Group": "มนุษยศาสตร์",
      "Field": "7102 ภาษาเขมร (Cambodian Language)",
      "Subfield": "710203 คติชนวิทยา (Cambodian Folklore)",
      "Branch": "-"
    },
    {
      "rowNum": 734,
      "Group": "มนุษยศาสตร์",
      "Field": "7102 ภาษาเขมร (Cambodian Language)",
      "Subfield": "710204 จารึกภาษาเขมร (Cambodian Inscription)",
      "Branch": "-"
    },
    {
      "rowNum": 735,
      "Group": "มนุษยศาสตร์",
      "Field": "7102 ภาษาเขมร (Cambodian Language)",
      "Subfield": "710205 วรรณคดีเขมร (Cambodian Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 736,
      "Group": "มนุษยศาสตร์",
      "Field": "7102 ภาษาเขมร (Cambodian Language)",
      "Subfield": "710206 ภาษากับสังคม/วัฒนธรรมเขมร (Cambodian Language and Society / Culture)",
      "Branch": "-"
    },
    {
      "rowNum": 737,
      "Group": "มนุษยศาสตร์",
      "Field": "7103 ภาษาลาว (Lao Language)",
      "Subfield": "710301 ภาษาลาวในฐานะภาษาต่างประเทศ (Lao Language)",
      "Branch": "-"
    },
    {
      "rowNum": 738,
      "Group": "มนุษยศาสตร์",
      "Field": "7103 ภาษาลาว (Lao Language)",
      "Subfield": "710302 การแปลและล่าม (Lao : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 739,
      "Group": "มนุษยศาสตร์",
      "Field": "7103 ภาษาลาว (Lao Language)",
      "Subfield": "710303 วรรณคดีลาว (Lao Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 740,
      "Group": "มนุษยศาสตร์",
      "Field": "7103 ภาษาลาว (Lao Language)",
      "Subfield": "710304 คติชนวิทยา (Lao Folklore)",
      "Branch": "-"
    },
    {
      "rowNum": 741,
      "Group": "มนุษยศาสตร์",
      "Field": "7103 ภาษาลาว (Lao Language)",
      "Subfield": "710305 ภาษากับสังคม/วัฒนธรรมลาว (Lao Language and Society / Culture)",
      "Branch": "-"
    },
    {
      "rowNum": 742,
      "Group": "มนุษยศาสตร์",
      "Field": "7104 ภาษาอังกฤษ (English Language)",
      "Subfield": "710401 ภาษาอังกฤษในฐานะภาษาต่างประเทศ (English Language)",
      "Branch": "-"
    },
    {
      "rowNum": 743,
      "Group": "มนุษยศาสตร์",
      "Field": "7104 ภาษาอังกฤษ (English Language)",
      "Subfield": "710402 การแปลและล่าม (English : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 744,
      "Group": "มนุษยศาสตร์",
      "Field": "7104 ภาษาอังกฤษ (English Language)",
      "Subfield": "710403 อังกฤษศึกษา (English Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 745,
      "Group": "มนุษยศาสตร์",
      "Field": "7105 ภาษาฝรั่งเศส (French Language)",
      "Subfield": "710501 ภาษาฝรั่งเศสในฐานะภาษาต่างประเทศ (French Language)",
      "Branch": "-"
    },
    {
      "rowNum": 746,
      "Group": "มนุษยศาสตร์",
      "Field": "7105 ภาษาฝรั่งเศส (French Language)",
      "Subfield": "710502 การแปลและล่าม (French : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 747,
      "Group": "มนุษยศาสตร์",
      "Field": "7105 ภาษาฝรั่งเศส (French Language)",
      "Subfield": "710503 ฝรั่งเศสศึกษา (French Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 748,
      "Group": "มนุษยศาสตร์",
      "Field": "7106 ภาษาเยอรมัน (German Language)",
      "Subfield": "710601 ภาษาเยอรมันในฐานะภาษาต่างประเทศ (German Language)",
      "Branch": "-"
    },
    {
      "rowNum": 749,
      "Group": "มนุษยศาสตร์",
      "Field": "7106 ภาษาเยอรมัน (German Language)",
      "Subfield": "710602 การแปลและล่าม (German : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 750,
      "Group": "มนุษยศาสตร์",
      "Field": "7106 ภาษาเยอรมัน (German Language)",
      "Subfield": "710603 เยอรมันศึกษา (German Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 751,
      "Group": "มนุษยศาสตร์",
      "Field": "7106 ภาษาเยอรมัน (German Language)",
      "Subfield": "710604 วรรณคดีเยอรมัน (German Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 752,
      "Group": "มนุษยศาสตร์",
      "Field": "7107 ภาษาสเปน (Spanish Language)",
      "Subfield": "710701 ภาษาสเปนในฐานะภาษาต่างประเทศ (Spanish Language)",
      "Branch": "-"
    },
    {
      "rowNum": 753,
      "Group": "มนุษยศาสตร์",
      "Field": "7107 ภาษาสเปน (Spanish Language)",
      "Subfield": "710702 การแปลและล่าม (Spanish : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 754,
      "Group": "มนุษยศาสตร์",
      "Field": "7107 ภาษาสเปน (Spanish Language)",
      "Subfield": "710703 วรรณคดีสเปน (Spanish Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 755,
      "Group": "มนุษยศาสตร์",
      "Field": "7107 ภาษาสเปน (Spanish Language)",
      "Subfield": "710704 สเปนและละตินอเมริกันศึกษา (Spanish and Latin American Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 756,
      "Group": "มนุษยศาสตร์",
      "Field": "7108 ภาษาอิตาเลียน (Italian Language)",
      "Subfield": "710801 ภาษาอิตาเลียนในฐานะภาษาต่างประเทศ (Italian Language)",
      "Branch": "-"
    },
    {
      "rowNum": 757,
      "Group": "มนุษยศาสตร์",
      "Field": "7108 ภาษาอิตาเลียน (Italian Language)",
      "Subfield": "710802 การแปลและล่าม (Italian : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 758,
      "Group": "มนุษยศาสตร์",
      "Field": "7108 ภาษาอิตาเลียน (Italian Language)",
      "Subfield": "710803 อิตาเลียนศึกษา (Italian Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 759,
      "Group": "มนุษยศาสตร์",
      "Field": "7108 ภาษาอิตาเลียน (Italian Language)",
      "Subfield": "710804 วรรณคดีอิตาเลียน (Italian Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 760,
      "Group": "มนุษยศาสตร์",
      "Field": "7109 ภาษารัสเซีย (Russian Language)",
      "Subfield": "710901 ภาษารัสเซียในฐานะภาษาต่างประเทศ (Russian Language)",
      "Branch": "-"
    },
    {
      "rowNum": 761,
      "Group": "มนุษยศาสตร์",
      "Field": "7109 ภาษารัสเซีย (Russian Language)",
      "Subfield": "710902 การแปลและล่าม (Russian : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 762,
      "Group": "มนุษยศาสตร์",
      "Field": "7109 ภาษารัสเซีย (Russian Language)",
      "Subfield": "710903 รัสเซียศึกษา (Russian Stu dies)",
      "Branch": "-"
    },
    {
      "rowNum": 763,
      "Group": "มนุษยศาสตร์",
      "Field": "7109 ภาษารัสเซีย (Russian Language)",
      "Subfield": "710904 วรรณคดีรัสเซีย (Russian Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 764,
      "Group": "มนุษยศาสตร์",
      "Field": "7110 ภาษาโปรตุเกส (Portuguese Language)",
      "Subfield": "711001 ภาษาโปรตุเกสในฐานะภาษาต่างประเทศ (Portuguese Language)",
      "Branch": "-"
    },
    {
      "rowNum": 765,
      "Group": "มนุษยศาสตร์",
      "Field": "7110 ภาษาโปรตุเกส (Portuguese Language)",
      "Subfield": "711002 การแปลและล่าม (Portuguese : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 766,
      "Group": "มนุษยศาสตร์",
      "Field": "7110 ภาษาโปรตุเกส (Portuguese Language)",
      "Subfield": "711003 โปรตุเกสศึกษา (Portug uese Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 767,
      "Group": "มนุษยศาสตร์",
      "Field": "7110 ภาษาโปรตุเกส (Portuguese Language)",
      "Subfield": "711004 วรรณคดีโปรตุเกส (Portuguese Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 768,
      "Group": "มนุษยศาสตร์",
      "Field": "7111 ภาษาญี่ปุ่น (Japanese Language)",
      "Subfield": "711101 ภาษาญี่ปุ่นในฐานะภาษาต่างประเทศ (Japanese Language)",
      "Branch": "-"
    },
    {
      "rowNum": 769,
      "Group": "มนุษยศาสตร์",
      "Field": "7111 ภาษาญี่ปุ่น (Japanese Language)",
      "Subfield": "711102 การแปลและล่าม (Japanese : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 770,
      "Group": "มนุษยศาสตร์",
      "Field": "7111 ภาษาญี่ปุ่น (Japanese Language)",
      "Subfield": "711103 ญี่ปุ่นศึกษา (Jap anese Studies)",
      "Branch": "คติชนวิทยา (Japanese Folklore)"
    },
    {
      "rowNum": 771,
      "Group": "มนุษยศาสตร์",
      "Field": "7111 ภาษาญี่ปุ่น (Japanese Language)",
      "Subfield": "711104 วรรณคดีญี่ปุ่น (Japanese Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 772,
      "Group": "มนุษยศาสตร์",
      "Field": "7112 ภาษาบาลีและสันสกฤต (Pali and Sanskrit Language)",
      "Subfield": "711201 ภาษาบาลีและสันสกฤต (Pali and Sanskrit Language)",
      "Branch": "-"
    },
    {
      "rowNum": 773,
      "Group": "มนุษยศาสตร์",
      "Field": "7112 ภาษาบาลีและสันสกฤต (Pali and Sanskrit Language)",
      "Subfield": "711202 วรรณคดีบาลี - สันสกฤต (Pali and Sanskrit Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 774,
      "Group": "มนุษยศาสตร์",
      "Field": "7112 ภาษาบาลีและสันสกฤต (Pali and Sanskrit Language)",
      "Subfield": "711203 พุทธศาสน์ศึกษา (Buddhist Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 775,
      "Group": "มนุษยศาสตร์",
      "Field": "7113 ภาษาเวียดนาม (Vietnamese Language)",
      "Subfield": "711301 เวียดนามในฐานะภาษาต่างประเทศ (Vietnamese Language)",
      "Branch": "-"
    },
    {
      "rowNum": 776,
      "Group": "มนุษยศาสตร์",
      "Field": "7113 ภาษาเวียดนาม (Vietnamese Language)",
      "Subfield": "711302 การแปลและล่าม (Vietnamese : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 777,
      "Group": "มนุษยศาสตร์",
      "Field": "7113 ภาษาเวียดนาม (Vietnamese Language)",
      "Subfield": "711303 เวียดนามศึกษา (Vietnamese Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 778,
      "Group": "มนุษยศาสตร์",
      "Field": "7114 ภาษาเกาหลี (Korean Language)",
      "Subfield": "711401 ภาษาเกาหลีในฐานะภาษาต่างประเทศ (Korean Language)",
      "Branch": "-"
    },
    {
      "rowNum": 779,
      "Group": "มนุษยศาสตร์",
      "Field": "7114 ภาษาเกาหลี (Korean Language)",
      "Subfield": "711402 การแปลและล่าม (Korean : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 780,
      "Group": "มนุษยศาสตร์",
      "Field": "7114 ภาษาเกาหลี (Korean Language)",
      "Subfield": "711403 เกาหลีศึกษา (Korean Studies)",
      "Branch": "คติชนวิทยา (Korean Folklore)"
    },
    {
      "rowNum": 781,
      "Group": "มนุษยศาสตร์",
      "Field": "7114 ภาษาเกาหลี (Korean Language)",
      "Subfield": "711403 เกาหลีศึกษา (Korean Studies)",
      "Branch": "วรรณคดีเกาหลี (Korean Literature)"
    },
    {
      "rowNum": 782,
      "Group": "มนุษยศาสตร์",
      "Field": "7114 ภาษาเกาหลี (Korean Language)",
      "Subfield": "711403 เกาหลีศึกษา (Korean Studies)",
      "Branch": "ภาษากับสังคม/วัฒนธรรมเกาหลี (Korean Language and Society / Culture)"
    },
    {
      "rowNum": 783,
      "Group": "มนุษยศาสตร์",
      "Field": "7115 ภาษาจีน (Chinese Language)",
      "Subfield": "711501 ภาษาจีนในฐานะภาษาต่างประเทศ (Chinese Language)",
      "Branch": "-"
    },
    {
      "rowNum": 784,
      "Group": "มนุษยศาสตร์",
      "Field": "7115 ภาษาจีน (Chinese Language)",
      "Subfield": "711502 การแปลและล่าม (Chinese : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 785,
      "Group": "มนุษยศาสตร์",
      "Field": "7115 ภาษาจีน (Chinese Language)",
      "Subfield": "711503 จีนศึกษา (Chinese Studies)",
      "Branch": "คติชนวิทยา (Chinese Folklore)"
    },
    {
      "rowNum": 786,
      "Group": "มนุษยศาสตร์",
      "Field": "7115 ภาษาจีน (Chinese Language)",
      "Subfield": "711504 วรรณคดีจีน (Chinese Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 787,
      "Group": "มนุษยศาสตร์",
      "Field": "7116 ภาษาอาหรับ (Arabic Language)",
      "Subfield": "711601 ภาษาอาหรับในฐานะภาษาต่างประเทศ (Arabic Language)",
      "Branch": "-"
    },
    {
      "rowNum": 788,
      "Group": "มนุษยศาสตร์",
      "Field": "7116 ภาษาอาหรับ (Arabic Language)",
      "Subfield": "711602 การแปลและล่าม (Arabic : Translation and Int erpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 789,
      "Group": "มนุษยศาสตร์",
      "Field": "7116 ภาษาอาหรับ (Arabic Language)",
      "Subfield": "711603 อาหรับศึกษา (Arabic Studies)",
      "Branch": "คติชนวิทยา (Arabic Folklore)"
    },
    {
      "rowNum": 790,
      "Group": "มนุษยศาสตร์",
      "Field": "7116 ภาษาอาหรับ (Arabic Language)",
      "Subfield": "711603 อาหรับศึกษา (Arabic Studies)",
      "Branch": "วรรณคดีอาหรับ (Arabic Literature)"
    },
    {
      "rowNum": 791,
      "Group": "มนุษยศาสตร์",
      "Field": "7117 ภาษามาเลย์ (Malay Language)",
      "Subfield": "711701 ภาษามาเลย์ในฐานะภาษาต่างประเทศ (Malay Language)",
      "Branch": "-"
    },
    {
      "rowNum": 792,
      "Group": "มนุษยศาสตร์",
      "Field": "7117 ภาษามาเลย์ (Malay Language)",
      "Subfield": "711702 การแปลและล่าม (Malay : Translation and Interpretation)",
      "Branch": "-"
    },
    {
      "rowNum": 793,
      "Group": "มนุษยศาสตร์",
      "Field": "7117 ภาษามาเลย์ (Malay Language)",
      "Subfield": "711703 มาเลย์ศึกษา (Malay Studies)",
      "Branch": "คติชนวิทยา (Malay Folklore)"
    },
    {
      "rowNum": 794,
      "Group": "มนุษยศาสตร์",
      "Field": "7117 ภาษามาเลย์ (Malay Language)",
      "Subfield": "711703 มาเลย์ศึกษา (Malay Studies)",
      "Branch": "วรรณคดีมาเลย์ (Malay Literature)"
    },
    {
      "rowNum": 795,
      "Group": "มนุษยศาสตร์",
      "Field": "7118 ภาษาฮินดี (Hindi Language)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 796,
      "Group": "มนุษยศาสตร์",
      "Field": "7119 ภาษาพม่า (Myanmar Language)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 797,
      "Group": "มนุษยศาสตร์",
      "Field": "7201 วรรณคดีเปรียบเทียบ (Comparative Literature)",
      "Subfield": "720101 วรรณคดีตะวันตก (Western WorldL iterature)",
      "Branch": "-"
    },
    {
      "rowNum": 798,
      "Group": "มนุษยศาสตร์",
      "Field": "7201 วรรณคดีเปรียบเทียบ (Comparative Literature)",
      "Subfield": "720102 เพศสภาพศึกษา หรือ เพศสถานะศึกษา (Gender Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 799,
      "Group": "มนุษยศาสตร์",
      "Field": "7201 วรรณคดีเปรียบเทียบ (Comparative Literature)",
      "Subfield": "720103 วรรณคดีตะวันออก (Eastern World Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 800,
      "Group": "มนุษยศาสตร์",
      "Field": "7201 วรรณคดีเปรียบเทียบ (Comparative Literature)",
      "Subfield": "720104 สตรีศึกษา (Women’s Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 801,
      "Group": "มนุษยศาสตร์",
      "Field": "7201 วรรณคดีเปรียบเทียบ (Comparative Literature)",
      "Subfield": "720105 วรรณคดีวิจารณ์ (Literary Critique) หรือ วรรณคดีศึกษา (Literary Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 802,
      "Group": "มนุษยศาสตร์",
      "Field": "7202 วรรณคดีอังกฤษ (English Literature)",
      "Subfield": "720201 วรรณคดีอังกฤษ (Old and Contemporary English Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 803,
      "Group": "มนุษยศาสตร์",
      "Field": "7202 วรรณคดีอังกฤษ (English Literature)",
      "Subfield": "720202 วรรณคดีเปรียบเทียบ (Comparative Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 804,
      "Group": "มนุษยศาสตร์",
      "Field": "7202 วรรณคดีอังกฤษ (English Literature)",
      "Subfield": "720203 วรรณคดีอเมริกัน (American Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 805,
      "Group": "มนุษยศาสตร์",
      "Field": "7203 วรรณคดีฝรั่งเศส (French Literature)",
      "Subfield": "720301 วรรณคดีฝรั่งเศส (Old and Contemporary French Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 806,
      "Group": "มนุษยศาสตร์",
      "Field": "7203 วรรณคดีฝรั่งเศส (French Literature)",
      "Subfield": "720302 วรรณคดีเปรียบเทียบ (Comparative Literature)",
      "Branch": "-"
    },
    {
      "rowNum": 807,
      "Group": "มนุษยศาสตร์",
      "Field": "7204 วรรณคดีไทย (Thai Literature)",
      "Subfield": "720401 วรรณคดีร่วมสมัย (Contemporary Thai Literature)",
      "Branch": "วรรณคดีท้องถิ่น (Thai Local Literature)"
    },
    {
      "rowNum": 808,
      "Group": "มนุษยศาสตร์",
      "Field": "7204 วรรณคดีไทย (Thai Literature)",
      "Subfield": "720401 วรรณคดีร่วมสมัย (Contemporary Thai Literature)",
      "Branch": "วรรณคดีกับสังคม/วัฒนธรรมไทย (Thai Literature and Society / Culture)"
    },
    {
      "rowNum": 809,
      "Group": "มนุษยศาสตร์",
      "Field": "7204 วรรณคดีไทย (Thai Literature)",
      "Subfield": "720401 วรรณคดีร่วมสมัย (Contemporary Thai Literature)",
      "Branch": "วรรณคดีและภาษา (Literature and Language)"
    },
    {
      "rowNum": 810,
      "Group": "มนุษยศาสตร์",
      "Field": "7204 วรรณคดีไทย (Thai Literature)",
      "Subfield": "720402 คติชนวิทยา (Thai Folklore)",
      "Branch": "-"
    },
    {
      "rowNum": 811,
      "Group": "มนุษยศาสตร์",
      "Field": "7204 วรรณคดีไทย (Thai Literature)",
      "Subfield": "720403 วรรณคดีสมัยเก่า (Old Thai Literature)",
      "Branch": "วรรณคดีท้องถิ่น (Thai Local Literature)"
    },
    {
      "rowNum": 812,
      "Group": "มนุษยศาสตร์",
      "Field": "7204 วรรณคดีไทย (Thai Literature)",
      "Subfield": "720403 วรรณคดีสมัยเก่า (Old Thai Literature)",
      "Branch": "วรรณคดีกับสังคม/วัฒนธรรมไทย(Thai Literature and Society / Culture)"
    },
    {
      "rowNum": 813,
      "Group": "มนุษยศาสตร์",
      "Field": "7204 วรรณคดีไทย (Thai Literature)",
      "Subfield": "720403 วรรณคดีสมัยเก่า (Old Thai Literature)",
      "Branch": "วรรณคดีและภาษา (Literature and Language)"
    },
    {
      "rowNum": 814,
      "Group": "มนุษยศาสตร์",
      "Field": "7301 ไทยศึกษา (Thai Studies)",
      "Subfield": "730101 ชาติพันธุ์ศึกษา (Ethnic Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 815,
      "Group": "มนุษยศาสตร์",
      "Field": "7301 ไทยศึกษา (Thai Studies)",
      "Subfield": "730102 อาณาบริเวณศึกษา (Area Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 816,
      "Group": "มนุษยศาสตร์",
      "Field": "7301 ไทยศึกษา (Thai Studies)",
      "Subfield": "730103 ชุมชนศึกษา (Communities Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 817,
      "Group": "มนุษยศาสตร์",
      "Field": "7301 ไทยศึกษา (Thai Studies)",
      "Subfield": "730104 วัฒนธรรมศึกษา (Culture Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 818,
      "Group": "มนุษยศาสตร์",
      "Field": "7301 ไทยศึกษา (Thai Studies)",
      "Subfield": "730105 ศิลปวัฒนธรรมไทย (Thai Culture Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 819,
      "Group": "มนุษยศาสตร์",
      "Field": "7301 ไทยศึกษา (Thai Studies)",
      "Subfield": "730106 มานุษยวิทยา (Anthropology)",
      "Branch": "-"
    },
    {
      "rowNum": 820,
      "Group": "มนุษยศาสตร์",
      "Field": "7301 ไทยศึกษา (Thai Studies)",
      "Subfield": "730107 คติชนวิทยา (Thai Folklore)",
      "Branch": "-"
    },
    {
      "rowNum": 821,
      "Group": "มนุษยศาสตร์",
      "Field": "7301 ไทยศึกษา (Thai Studies)",
      "Subfield": "730108 สตรีศึกษา (Women’s Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 822,
      "Group": "มนุษยศาสตร์",
      "Field": "7301 ไทยศึกษา (Thai Studies)",
      "Subfield": "730109 สยามคดีศึกษา (Siamese Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 823,
      "Group": "มนุษยศาสตร์",
      "Field": "7302 ญี่ปุ่นศึกษา (Japanese Studies)",
      "Subfield": "730201 ชำติพันธุ์ศึกษา (Ethnic Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 824,
      "Group": "มนุษยศาสตร์",
      "Field": "7302 ญี่ปุ่นศึกษา (Japanese Studies)",
      "Subfield": "730202 อาณาบริเวณศึกษา (Area Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 825,
      "Group": "มนุษยศาสตร์",
      "Field": "7302 ญี่ปุ่นศึกษา (Japanese Studies)",
      "Subfield": "730203 ชุมชนศึกษา (Communities Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 826,
      "Group": "มนุษยศาสตร์",
      "Field": "7303 จีนศึกษา (Chinese Studies)",
      "Subfield": "730301 ชาติพันธุ์ศึกษา (Ethnic Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 827,
      "Group": "มนุษยศาสตร์",
      "Field": "7303 จีนศึกษา (Chinese Studies)",
      "Subfield": "730302 อาณาบริเวณศึกษา (Area Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 828,
      "Group": "มนุษยศาสตร์",
      "Field": "7303 จีนศึกษา (Chinese Studies)",
      "Subfield": "730303 ชุมชนศึกษา (Communities Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 829,
      "Group": "มนุษยศาสตร์",
      "Field": "7401 ภาษาศาสตร์ (Linguistics)",
      "Subfield": "740101 สัทศาสตร์และสัทวิทยา (Phonetics and Phonology)",
      "Branch": "-"
    },
    {
      "rowNum": 830,
      "Group": "มนุษยศาสตร์",
      "Field": "7401 ภาษาศาสตร์ (Linguistics)",
      "Subfield": "740102 วากยสัมพันธ์และอรรถศาสตร์ (Syntax and Semantics)",
      "Branch": "-"
    },
    {
      "rowNum": 831,
      "Group": "มนุษยศาสตร์",
      "Field": "7401 ภาษาศาสตร์ (Linguistics)",
      "Subfield": "740103 วัจนปฏิบัติศาสตร์และปริจเฉทวิเคราะห์ หรือ วัจนปฏิบัติศาสตร์และสัมพันธสารวิเคราะห์ (Pragmatics and Discourse Analysis)",
      "Branch": "-"
    },
    {
      "rowNum": 832,
      "Group": "มนุษยศาสตร์",
      "Field": "7401 ภาษาศาสตร์ (Linguistics)",
      "Subfield": "740104 ภาษาศาสตร์เชิงประวัติ (Historical Linguistics)",
      "Branch": "-"
    },
    {
      "rowNum": 833,
      "Group": "มนุษยศาสตร์",
      "Field": "7401 ภาษาศาสตร์ (Linguistics)",
      "Subfield": "740105 ภาษาศาสตร์สังคม (Sociolinguistics)",
      "Branch": "ภาษาถิ่น หรือ ภาษาศาสตร์ภาษาถิ่น (Dialectology)"
    },
    {
      "rowNum": 834,
      "Group": "มนุษยศาสตร์",
      "Field": "7401 ภาษาศาสตร์ (Linguistics)",
      "Subfield": "740106 ภาษาศาสตร์จิตวิทยาและการรับรู้ภาษา (Psycholin guistics and Language Acquisition)",
      "Branch": "-"
    },
    {
      "rowNum": 835,
      "Group": "มนุษยศาสตร์",
      "Field": "7401 ภาษาศาสตร์ (Linguistics)",
      "Subfield": "740107 ภาษาศาสตร์คลังข้อมูล (Corpus Linguistics)",
      "Branch": "-"
    },
    {
      "rowNum": 836,
      "Group": "มนุษยศาสตร์",
      "Field": "7401 ภาษาศาสตร์ (Linguistics)",
      "Subfield": "740108 ภาษาศาสตร์คอมพิวเตอร์ (Computational Linguistics)",
      "Branch": "การบันทึกและอนุรักษ์ภาษา (Language Documentation and Conservation)"
    },
    {
      "rowNum": 837,
      "Group": "มนุษยศาสตร์",
      "Field": "7401 ภาษาศาสตร์ (Linguistics)",
      "Subfield": "740109 ภาษาศาสตร์ชาติพันธุ์ (Ethnolinguistics)",
      "Branch": "-"
    },
    {
      "rowNum": 838,
      "Group": "มนุษยศาสตร์",
      "Field": "7501 ประวัติศาสตร์ (History)",
      "Subfield": "750101 ประวัติศาสตร์ไทย (Thai History)",
      "Branch": "-"
    },
    {
      "rowNum": 839,
      "Group": "มนุษยศาสตร์",
      "Field": "7501 ประวัติศาสตร์ (History)",
      "Subfield": "750102 ประวัติศาสตร์เอเชียตะวันออกเฉียงใต้ (Southeast Asia Histories)",
      "Branch": "-"
    },
    {
      "rowNum": 840,
      "Group": "มนุษยศาสตร์",
      "Field": "7501 ประวัติศาสตร์ (History)",
      "Subfield": "750103 ประวัติศาสตร์จีน (Chinese History)",
      "Branch": "-"
    },
    {
      "rowNum": 841,
      "Group": "มนุษยศาสตร์",
      "Field": "7501 ประวัติศาสตร์ (History)",
      "Subfield": "750104 ประวัติศาสตร์ญี่ปุ่น (Japanese History)",
      "Branch": "-"
    },
    {
      "rowNum": 842,
      "Group": "มนุษยศาสตร์",
      "Field": "7501 ประวัติศาสตร์ (History)",
      "Subfield": "750105 ประวัติศาสตร์ตะวันออกกลาง (Middle East History)",
      "Branch": "-"
    },
    {
      "rowNum": 843,
      "Group": "มนุษยศาสตร์",
      "Field": "7501 ประวัติศาสตร์ (History)",
      "Subfield": "750106 ประวัติศาสตร์โลกมุสลิม (Islamic World History)",
      "Branch": "-"
    },
    {
      "rowNum": 844,
      "Group": "มนุษยศาสตร์",
      "Field": "7501 ประวัติศาสตร์ (History)",
      "Subfield": "750107 ประวัติศาสตร์ยุโรป (European History)",
      "Branch": "-"
    },
    {
      "rowNum": 845,
      "Group": "มนุษยศาสตร์",
      "Field": "7601 โบราณคดี (Archaeology)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 846,
      "Group": "มนุษยศาสตร์",
      "Field": "7701 ศิลปะการละคร (Dramatic Arts)",
      "Subfield": "770101 การเขียน การสร้างบท การแปลบทและการดัดแปลงบท (Playwriting)",
      "Branch": "-"
    },
    {
      "rowNum": 847,
      "Group": "มนุษยศาสตร์",
      "Field": "7701 ศิลปะการละคร (Dramatic Arts)",
      "Subfield": "770102 วรรณกรรมและการวิจารณ์ละคร (Drama Literature and Criticism)",
      "Branch": "-"
    },
    {
      "rowNum": 848,
      "Group": "มนุษยศาสตร์",
      "Field": "7701 ศิลปะการละคร (Dramatic Arts)",
      "Subfield": "770103 ละครประยุกต์ ละครเยาวชน ละครในการศึกษา (Contemporary Dramatic Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 849,
      "Group": "มนุษยศาสตร์",
      "Field": "7801 ศาสนา และเทววิทยา (Religion and Theology)",
      "Subfield": "780101 พุทธศาสน์ศึกษา (Buddhist Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 850,
      "Group": "มนุษยศาสตร์",
      "Field": "7801 ศาสนา และเทววิทยา (Religion and Theology)",
      "Subfield": "780102 อิสลามศึกษา (Islamic Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 851,
      "Group": "มนุษยศาสตร์",
      "Field": "7801 ศาสนา และเทววิทยา (Religion and Theology)",
      "Subfield": "780103 เทววิทยา (Theology)",
      "Branch": "-"
    },
    {
      "rowNum": 852,
      "Group": "มนุษยศาสตร์",
      "Field": "7801 ศาสนา และเทววิทยา (Religion and Theology)",
      "Subfield": "780104 ศาสนาศึกษา (Religious Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 853,
      "Group": "มนุษยศาสตร์",
      "Field": "7802 พระพุทธศาสนา (Buddhism)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 854,
      "Group": "มนุษยศาสตร์",
      "Field": "7901 การแปลและการล่าม (Translation and Interpretation)",
      "Subfield": "790101 การแปลศึกษา (Translation Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 855,
      "Group": "มนุษยศาสตร์",
      "Field": "7901 การแปลและการล่าม (Translation and Interpretation)",
      "Subfield": "790102 การล่ามศึกษา (Interpreting Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 856,
      "Group": "มนุษยศาสตร์",
      "Field": "8001 ปรัชญา (Philosophy)",
      "Subfield": "800101 ปรัชญาตะวันตก (Western Philosophy)",
      "Branch": "จริยศาสตร์ (Ethics)"
    },
    {
      "rowNum": 857,
      "Group": "มนุษยศาสตร์",
      "Field": "8001 ปรัชญา (Philosophy)",
      "Subfield": "800101 ปรัชญาตะวันตก (Western Philosophy)",
      "Branch": "อภิปรัชญา (Metaphysics)"
    },
    {
      "rowNum": 858,
      "Group": "มนุษยศาสตร์",
      "Field": "8001 ปรัชญา (Philosophy)",
      "Subfield": "800101 ปรัชญาตะวันตก (Western Philosophy)",
      "Branch": "ญาณวิทยา (Epistemology)"
    },
    {
      "rowNum": 859,
      "Group": "มนุษยศาสตร์",
      "Field": "8001 ปรัชญา (Philosophy)",
      "Subfield": "800101 ปรัชญาตะวันตก (Western Philosophy)",
      "Branch": "สุนทรียศาสตร์ (Aesthetics)"
    },
    {
      "rowNum": 860,
      "Group": "มนุษยศาสตร์",
      "Field": "8001 ปรัชญา (Philosophy)",
      "Subfield": "800102 ปรัชญาตะวันออก (Eastern Philosophy)",
      "Branch": "พุทธปรัชญา (Buddhist Philosophy)"
    },
    {
      "rowNum": 861,
      "Group": "มนุษยศาสตร์",
      "Field": "8001 ปรัชญา (Philosophy)",
      "Subfield": "800102 ปรัชญาตะวันออก (Eastern Philosophy)",
      "Branch": "จริยศาสตร์ (Ethics)"
    },
    {
      "rowNum": 862,
      "Group": "มนุษยศาสตร์",
      "Field": "8001 ปรัชญา (Philosophy)",
      "Subfield": "800102 ปรัชญาตะวันออก (Eastern Philosophy)",
      "Branch": "อภิปรัชญา (Metaphysics)"
    },
    {
      "rowNum": 863,
      "Group": "มนุษยศาสตร์",
      "Field": "8001 ปรัชญา (Philosophy)",
      "Subfield": "800102 ปรัชญาตะวันออก (Eastern Philosophy)",
      "Branch": "ญาณวิทยา (Epistemology)"
    },
    {
      "rowNum": 864,
      "Group": "มนุษยศาสตร์",
      "Field": "8001 ปรัชญา (Philosophy)",
      "Subfield": "800102 ปรัชญาตะวันออก (Eastern Philosophy)",
      "Branch": "สุนทรียศาสตร์ (Aesthetics)"
    },
    {
      "rowNum": 865,
      "Group": "มนุษยศาสตร์",
      "Field": "8001 ปรัชญา (Philosophy)",
      "Subfield": "800102 ปรัชญาตะวันออก (Eastern Philosophy)",
      "Branch": "-"
    },
    {
      "rowNum": 866,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810101 จิตรกรรม (Painting)",
      "Branch": "-"
    },
    {
      "rowNum": 867,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810102 ประติมากรรม (Sculpture)",
      "Branch": "-"
    },
    {
      "rowNum": 868,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810103 ภาพพิมพ์ (Graphic Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 869,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810104 ศิลปะไทย (Thai Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 870,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810105 ศิลปะสื่อผสม (Multimedia Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 871,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810106 ศิลปการจัดวาง (Installation Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 872,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810107 ศิลปกับสิ่งแวดล้อม (Environment Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 873,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810108 ภูมิทัศนศิลป์ (Land Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 874,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810109 ดิจิทัลอาร์ต (Digital Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 875,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810110 คอมพิวเตอร์อาร์ต (Computer Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 876,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810111 ภาพยนตร์ (Cinema Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 877,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810112 ภาพถ่าย (Photo Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 878,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810113 ศิลปะภาพถ่าย (Photo Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 879,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810114 ศิลปะการถ่ายภาพ (Photography Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 880,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810115 ศิลปะชุมชน (Community Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 881,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810116 ศิลปะวีดิทัศน์ (Video Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 882,
      "Group": "วิจิตรศิลป์",
      "Field": "8101 ทัศนศิลป์ (Visual Arts)",
      "Subfield": "810117 ทฤษฎีศิลป์ (Art Theory)",
      "Branch": "-"
    },
    {
      "rowNum": 883,
      "Group": "วิจิตรศิลป์",
      "Field": "8102 นฤมิตศิลป์ (Creative Arts)",
      "Subfield": "810201 เรขศิลป์ (Graphic Design)",
      "Branch": "-"
    },
    {
      "rowNum": 884,
      "Group": "วิจิตรศิลป์",
      "Field": "8102 นฤมิตศิลป์ (Creative Arts)",
      "Subfield": "810202 แฟชั่นและสิ่งทอ (Fashion & Textile)",
      "Branch": "-"
    },
    {
      "rowNum": 885,
      "Group": "วิจิตรศิลป์",
      "Field": "8102 นฤมิตศิลป์ (Creative Arts)",
      "Subfield": "810203 มัณฑณศิลป์ (Decorative Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 886,
      "Group": "วิจิตรศิลป์",
      "Field": "8102 นฤมิตศิลป์ (Creative Arts)",
      "Subfield": "810204 หัตถศิลป์ (Craftsmanship Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 887,
      "Group": "วิจิตรศิลป์",
      "Field": "8102 นฤมิตศิลป์ (Creative Arts)",
      "Subfield": "810205 นิทรรศการศิลป์ (Art Exhibition)",
      "Branch": "-"
    },
    {
      "rowNum": 888,
      "Group": "วิจิตรศิลป์",
      "Field": "8103 โสตศิลป์ หรือ คีตศิลป์ หรือ ดุริยางคศิลป์ (Music)",
      "Subfield": "810301 คีตศิลป์ไทย (Thai Vocal Music)",
      "Branch": "-"
    },
    {
      "rowNum": 889,
      "Group": "วิจิตรศิลป์",
      "Field": "8103 โสตศิลป์ หรือ คีตศิลป์ หรือ ดุริยางคศิลป์ (Music)",
      "Subfield": "810302 ดนตรีไทย หรือ ดุริยางคศิลป์ไทย (Thai Music)",
      "Branch": "-"
    },
    {
      "rowNum": 890,
      "Group": "วิจิตรศิลป์",
      "Field": "8103 โสตศิลป์ หรือ คีตศิลป์ หรือ ดุริยางคศิลป์ (Music)",
      "Subfield": "810303 ดนตรีสากล หรือ ดุริยางคศิลป์ตะวันตก (Western Music)",
      "Branch": "-"
    },
    {
      "rowNum": 891,
      "Group": "วิจิตรศิลป์",
      "Field": "8103 โสตศิลป์ หรือ คีตศิลป์ หรือ ดุริยางคศิลป์ (Music)",
      "Subfield": "810304 ดนตรีไทยร่วมสมัย (Thai Contemporary Music)",
      "Branch": "-"
    },
    {
      "rowNum": 892,
      "Group": "วิจิตรศิลป์",
      "Field": "8103 โสตศิลป์ หรือ คีตศิลป์ หรือ ดุริยางคศิลป์ (Music)",
      "Subfield": "810305 ดนตรีสื่อผสม (MultimediaM usic)",
      "Branch": "-"
    },
    {
      "rowNum": 893,
      "Group": "วิจิตรศิลป์",
      "Field": "8103 โสตศิลป์ หรือ คีตศิลป์ หรือ ดุริยางคศิลป์ (Music)",
      "Subfield": "810306 ดนตรีพื้นบ้าน (Folk Music)",
      "Branch": "-"
    },
    {
      "rowNum": 894,
      "Group": "วิจิตรศิลป์",
      "Field": "8103 โสตศิลป์ หรือ คีตศิลป์ หรือ ดุริยางคศิลป์ (Music)",
      "Subfield": "810307 ดนตรีวิทยา (Musicology)",
      "Branch": "-"
    },
    {
      "rowNum": 895,
      "Group": "วิจิตรศิลป์",
      "Field": "8103 โสตศิลป์ หรือ คีตศิลป์ หรือ ดุริยางคศิลป์ (Music)",
      "Subfield": "810308 ดนตรีบำบัด (Music Therapy)",
      "Branch": "-"
    },
    {
      "rowNum": 896,
      "Group": "วิจิตรศิลป์",
      "Field": "8103 โสตศิลป์ หรือ คีตศิลป์ หรือ ดุริยางคศิลป์ (Music)",
      "Subfield": "810309 ดนตรีชาติพันธุ์วิทยา (Ethnomusicology)",
      "Branch": "-"
    },
    {
      "rowNum": 897,
      "Group": "วิจิตรศิลป์",
      "Field": "8103 โสตศิลป์ หรือ คีตศิลป์ หรือ ดุริยางคศิลป์ (Music)",
      "Subfield": "810310 การสอนดนตรี (Music Pedagogy)",
      "Branch": "-"
    },
    {
      "rowNum": 898,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810401 นาฏศิลป์สากล หรือ นาฏศิลป์ตะวันตก (Western Dance)",
      "Branch": "-"
    },
    {
      "rowNum": 899,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810402 นาฏศิลป์ตะวันออก (Eastern Dance)",
      "Branch": "-"
    },
    {
      "rowNum": 900,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810403 นาฏศิลป์ไทย (Thai Dance)",
      "Branch": "-"
    },
    {
      "rowNum": 901,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810404 นาฏศิลป์พื้นบ้าน (Folk Dance)",
      "Branch": "-"
    },
    {
      "rowNum": 902,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810405 ศิลปะการแสดงร่วมสมัย (Contemporary Performing Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 903,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810406 ศิลปะการแสดงข้ามสื่อ (Transmedia Performing Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 904,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810407 ศิลปะการแสดงผสมสื่อ (Multimedia Performing Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 905,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810408 ศิลปะการละคร (Theatre Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 906,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810409 การออกแบบเพื่อการแสดง (Theatre Design)",
      "Branch": "-"
    },
    {
      "rowNum": 907,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810410 การแสดงและกำกับการแสดง (A cting and Directing)",
      "Branch": "-"
    },
    {
      "rowNum": 908,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810411 เพลงและดนตรีเพื่อการแสดง (Music and Sound for Theatre)",
      "Branch": "-"
    },
    {
      "rowNum": 909,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810412 การแสดงละครประยุกต์ ละครเยาวชน ละครในการศึกษา (Applied Theatre)",
      "Branch": "-"
    },
    {
      "rowNum": 910,
      "Group": "วิจิตรศิลป์",
      "Field": "8104 นาฏศิลป์ (Dance) หรือ ศิลปะการแสดง (Performing Arts)",
      "Subfield": "810413 นาฏศิลป์ร่วมสมัย (Contemporary Dance)",
      "Branch": "-"
    },
    {
      "rowNum": 911,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8501 ประยุกต์ศิลป์ (Applied Arts)",
      "Subfield": "850101 แฟชั่นและสิ่งทอ (Fashion and Textile)",
      "Branch": "-"
    },
    {
      "rowNum": 912,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8501 ประยุกต์ศิลป์ (Applied Arts)",
      "Subfield": "850102 เครื่องลงรัก (Lacquer Work)",
      "Branch": "-"
    },
    {
      "rowNum": 913,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8501 ประยุกต์ศิลป์ (Applied Arts)",
      "Subfield": "850103 ศิลป์ประดิษฐ์ (Creative Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 914,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8502 ออกแบบอุตสาหกรรมศิลป์ (Industrial Design)",
      "Subfield": "850201 ออกแบบผลิตภัณฑ์ (Product Design)",
      "Branch": "-"
    },
    {
      "rowNum": 915,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8502 ออกแบบอุตสาหกรรมศิลป์ (Industrial Design)",
      "Subfield": "850202 ออกแบบเครื่องเคลือบดินเผk (Ceramic Design)",
      "Branch": "-"
    },
    {
      "rowNum": 916,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8502 ออกแบบอุตสาหกรรมศิลป์ (Industrial Design)",
      "Subfield": "850203 ออกแบบเซรามิกส์ (Ceramic Design)",
      "Branch": "-"
    },
    {
      "rowNum": 917,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8502 ออกแบบอุตสาหกรรมศิลป์ (Industrial Design)",
      "Subfield": "850204 ออกแบบแฟชั่น (Fashion Design)",
      "Branch": "-"
    },
    {
      "rowNum": 918,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8502 ออกแบบอุตสาหกรรมศิลป์ (Industrial Design)",
      "Subfield": "850205 ออกแบบเครื่องประดับ (Jewelry Design)",
      "Branch": "-"
    },
    {
      "rowNum": 919,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8503 ออกแบบพาณิชยศิลป์ (Commercial Design)",
      "Subfield": "850301 ออกแบบนิเทศศิลป์ (Visual Communication Design)",
      "Branch": "-"
    },
    {
      "rowNum": 920,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8503 ออกแบบพาณิชยศิลป์ (Commercial Design)",
      "Subfield": "850302 ออกแบบเลขศิลป์ (Graphic Design)",
      "Branch": "-"
    },
    {
      "rowNum": 921,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8503 ออกแบบพาณิชยศิลป์ (Commercial Design)",
      "Subfield": "850303 ออกแบบสื่อโฆษณาภาพยนตร์ (Cinema Media Design)",
      "Branch": "-"
    },
    {
      "rowNum": 922,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8503 ออกแบบพาณิชยศิลป์ (Commercial Design)",
      "Subfield": "850304 ออกแบบสื่อสาร (Communication Design)",
      "Branch": "-"
    },
    {
      "rowNum": 923,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8504 ออกแบบตกแต่ง (Design)",
      "Subfield": "850401 ออกแบบตกแต่งภายใน (Interior Design)",
      "Branch": "-"
    },
    {
      "rowNum": 924,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8504 ออกแบบตกแต่ง (Design)",
      "Subfield": "850402 ออกแบบตกแต่งภายนอก (Exterior Design)",
      "Branch": "-"
    },
    {
      "rowNum": 925,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8504 ออกแบบตกแต่ง (Design)",
      "Subfield": "850403 ออกแบบตกแต่งสถาปัตยกรรมภายใน (Interior Architecture Design)",
      "Branch": "-"
    },
    {
      "rowNum": 926,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8504 ออกแบบตกแต่ง (Design)",
      "Subfield": "850404 ออกแบบจัดสวน (Garden Design)",
      "Branch": "-"
    },
    {
      "rowNum": 927,
      "Group": "ประยุกต์ศิลป์",
      "Field": "8505 ประวัติศาสตร์ศิลป์ (History of Arts)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 928,
      "Group": "ภูมิภาคศึกษา - Regional Studies (ภูมิภาคระหว่างประเทศ)",
      "Field": "9101 เอเชียศึกษา (Asian Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 929,
      "Group": "ภูมิภาคศึกษา - Regional Studies (ภูมิภาคระหว่างประเทศ)",
      "Field": "9102 อาเซียนศึกษา (ASEAN Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 930,
      "Group": "ภูมิภาคศึกษา - Regional Studies (ภูมิภาคระหว่างประเทศ)",
      "Field": "9103 ยุโรปศึกษา (European Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 931,
      "Group": "ภูมิภาคศึกษา - Regional Studies (ภูมิภาคระหว่างประเทศ)",
      "Field": "9104 อัฟริกาศึกษา (African Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 932,
      "Group": "ภูมิภาคศึกษา - Regional Studies (ภูมิภาคระหว่างประเทศ)",
      "Field": "9105 ลาตินอเมริกาศึกษา (Latin American Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 933,
      "Group": "ภูมิภาคศึกษา - Regional Studies (ภูมิภาคระหว่างประเทศ)",
      "Field": "9106 เอเชียตะวันออกศึกษา (East Asian Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 934,
      "Group": "พื้นที่ศึกษา - Area Studies",
      "Field": "9121 จีนศึกษา (Chinese Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 935,
      "Group": "พื้นที่ศึกษา - Area Studies",
      "Field": "9122 เกาหลีศึกษา (Korean Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 936,
      "Group": "พื้นที่ศึกษา - Area Studies",
      "Field": "9123 ญี่ปุ่นศึกษา (Japanese Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 937,
      "Group": "พื้นที่ศึกษา - Area Studies",
      "Field": "9124 เขมรศึกษา (Khmer Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 938,
      "Group": "พื้นที่ศึกษา - Area Studies",
      "Field": "9125 อเมริกาศึกษา (American Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 939,
      "Group": "พื้นที่ศึกษา - Area Studies",
      "Field": "9126 อินเดียศึกษา (Indian Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 940,
      "Group": "ชาติพันธุ์ศึกษา - Ethnic GroupS tudies",
      "Field": "9141 มุสลิมศึกษา (Muslim Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 941,
      "Group": "ชาติพันธุ์ศึกษา - Ethnic GroupS tudies",
      "Field": "9142 อาหรับศึกษา (Arabian Studies)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 942,
      "Group": "อื่นๆ",
      "Field": "9151 การท่องเที่ยวและการโรงแรม (Hotel and Tourism)",
      "Subfield": "915101 การจัดการโรงแรมและการท่องเที่ยว (Hotel and Tourism Management)",
      "Branch": "-"
    },
    {
      "rowNum": 943,
      "Group": "อื่นๆ",
      "Field": "9151 การท่องเที่ยวและการโรงแรม (Hotel and Tourism)",
      "Subfield": "915102 การจัดการการท่องเที่ยว (Tourism Management)",
      "Branch": "-"
    },
    {
      "rowNum": 944,
      "Group": "อื่นๆ",
      "Field": "9151 การท่องเที่ยวและการโรงแรม (Hotel and Tourism)",
      "Subfield": "915103 การพัฒนาแหล่งท่องเที่ยวและการขนส่ง (Transportation and Tourism Destination Development)",
      "Branch": "-"
    },
    {
      "rowNum": 945,
      "Group": "อื่นๆ",
      "Field": "9151 การท่องเที่ยวและการโรงแรม (Hotel and Tourism)",
      "Subfield": "915104 การจัดการโรงแรม (Hotel Management)",
      "Branch": "-"
    },
    {
      "rowNum": 946,
      "Group": "อื่นๆ",
      "Field": "9156 คหกรรมศาสตร์ (Home Economics)",
      "Subfield": "915601 อาหารและโภชนำการ (Food and Nutrition)",
      "Branch": "-"
    },
    {
      "rowNum": 947,
      "Group": "อื่นๆ",
      "Field": "9156 คหกรรมศาสตร์ (Home Economics)",
      "Subfield": "915602 การออกแบบและตัดเย็บเสื้อผ้า (Garment Design and Dressmaking)",
      "Branch": "-"
    },
    {
      "rowNum": 948,
      "Group": "อื่นๆ",
      "Field": "9156 คหกรรมศาสตร์ (Home Economics)",
      "Subfield": "915603 ศิลป์ประดิษฐ์ (Creative Arts)",
      "Branch": "-"
    },
    {
      "rowNum": 949,
      "Group": "อื่นๆ",
      "Field": "9161 การบริหารงานยุติธรรม (Justice Administration)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 950,
      "Group": "อื่นๆ",
      "Field": "9162 การพัฒนาทรัพยากรมนุษย์ (Human Resource Development)",
      "Subfield": "-",
      "Branch": "-"
    },
    {
      "rowNum": 951,
      "Group": "อื่นๆ",
      "Field": "9163 สิทธิมนุษยชนและสันติศึกษา (Human Rights and Peace Studies)",
      "Subfield": "916301 สันติศึกษา (Peace Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 952,
      "Group": "อื่นๆ",
      "Field": "9163 สิทธิมนุษยชนและสันติศึกษา (Human Rights and Peace Studies)",
      "Subfield": "916302 สิทธิมนุษชน (Human Rights)",
      "Branch": "-"
    },
    {
      "rowNum": 953,
      "Group": "อื่นๆ",
      "Field": "9164 วัฒนธรรมศึกษา (Cultural Studies)",
      "Subfield": "916401 พิพิธภัณฑ์ศึกษาและการจัดการมรดกวัฒนธรรม (Museum Studies and Cultural Heritage Management)",
      "Branch": "-"
    },
    {
      "rowNum": 954,
      "Group": "อื่นๆ",
      "Field": "9164 วัฒนธรรมศึกษา (Cultural Studies)",
      "Subfield": "916402 ภาพยนตร์ศึกษาและสื่อศึกษา (Movies and Media Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 955,
      "Group": "อื่นๆ",
      "Field": "9164 วัฒนธรรมศึกษา (Cultural Studies)",
      "Subfield": "916403 พหุวัฒนธรรมศึกษา (Multicultural Studies)",
      "Branch": "-"
    },
    {
      "rowNum": 956,
      "Group": "อื่นๆ",
      "Field": "9164 วัฒนธรรมศึกษา (Cultural Studies)",
      "Subfield": "916404 วัฒนธรรมสุขภาพ (Culture and Health)",
      "Branch": "-"
    },
    {
      "rowNum": 957,
      "Group": "อื่นๆ",
      "Field": "9164 วัฒนธรรมศึกษา (Cultural Studies)",
      "Subfield": "916405 ภาษาและวัฒนธรรมเพื่อการพัฒนา (Language and Culture for Development)",
      "Branch": "-"
    },
    {
      "rowNum": 958,
      "Group": "อื่นๆ",
      "Field": "9164 วัฒนธรรมศึกษา (Cultural Studies)",
      "Subfield": "916406 การสื่อสารระหว่างวัฒนธรรม (Intercultural Communication)",
      "Branch": "-"
    },
    {
      "rowNum": 959,
      "Group": "อื่นๆ",
      "Field": "9164 วัฒนธรรมศึกษา (Cultural Studies)",
      "Subfield": "916407 วัฒนธรรมจีน (Chinese Culture)",
      "Branch": "-"
    }
  ],
  "branchConfigs": [
    {
      "rowNum": 2,
      "Title": "ที่มาข้อมูล",
      "Content": "ข้อมูลตามประกาศ ก.พ.อ. เรื่อง การกำหนดชื่อสาขาวิชาสำหรับการเสนอขอกำหนดตำแหน่งทางวิชาการและการเทียบเคียงสาขาวิชาที่เคยกำหนดไปแล้ว พ.ศ. 2562\nและหนังสือ สป.อว. ที่ อว 0209.5/ว23785 ลงวันที่ 7 พฤศจิกายน 2565 เรื่อง เพิ่มเติมรายชื่อสาชาวิชาและอนุสาชาวิชาที่แตกต่างไปจากบัญชีรายชื่อสาขาวิชาที่ ก.พ.อ. กำหนด"
    },
    {
      "rowNum": 3,
      "Title": "หมายเหตุ",
      "Content": "(1) เลขรหัส 4 หลัก กำกับสาขาวิชาของตำแหน่งทางวิชาการ\n(2) เลขรหัส 6 หลัก กำกับอนุสาขาวิชา ซึ่งจะระบุหรือไม่ก็ได้\n(3) บางอนุสาขาวิชาอาจมี \"แขนงวิชา\" ย่อยลงไปอีก และอาจย่อยลงไปถึงระดับ \"วิชา\""
    }
  ],
  "totalVisits": 284,
  "thisMonthVisits": 118
};
